frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/**
 * \file
 *
 * \brief Component description for USBC
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_USBC_COMPONENT_
#define _SAM4L_USBC_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR USBC */
/* ========================================================================== */
/** \addtogroup SAM4L_USBC USB 2.0 Interface */
/*@{*/

#define USBC_I7553
#define REV_USBC                    0x310

/* -------- USBC_UDCON : (USBC Offset: 0x000) (R/W 32) Device General Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t UADD:7;           /*!< bit:  0.. 6  USB Address                        */
    uint32_t ADDEN:1;          /*!< bit:      7  Address Enable                     */
    uint32_t DETACH:1;         /*!< bit:      8  Detach                             */
    uint32_t RMWKUP:1;         /*!< bit:      9  Remote Wake-Up                     */
    uint32_t SPDCONF:2;        /*!< bit: 10..11  Speed configuration                */
    uint32_t LS:1;             /*!< bit:     12  Low Speed Mode Force               */
    uint32_t TSTJ:1;           /*!< bit:     13  Test mode J                        */
    uint32_t TSTK:1;           /*!< bit:     14  Test mode K                        */
    uint32_t TSTPCKT:1;        /*!< bit:     15  Test Packet mode                   */
    uint32_t OPMODE2:1;        /*!< bit:     16  Specific Operational mode          */
    uint32_t GNAK:1;           /*!< bit:     17  Global NAK                         */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UDCON_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UDCON_OFFSET           0x000        /**< \brief (USBC_UDCON offset) Device General Control Register */
#define USBC_UDCON_RESETVALUE       _U(0x00000100); /**< \brief (USBC_UDCON reset_value) Device General Control Register */

#define USBC_UDCON_UADD_Pos         0            /**< \brief (USBC_UDCON) USB Address */
#define USBC_UDCON_UADD_Msk         (_U(0x7F) << USBC_UDCON_UADD_Pos)
#define USBC_UDCON_UADD(value)      (USBC_UDCON_UADD_Msk & ((value) << USBC_UDCON_UADD_Pos))
#define USBC_UDCON_ADDEN_Pos        7            /**< \brief (USBC_UDCON) Address Enable */
#define USBC_UDCON_ADDEN            (_U(0x1) << USBC_UDCON_ADDEN_Pos)
#define USBC_UDCON_DETACH_Pos       8            /**< \brief (USBC_UDCON) Detach */
#define USBC_UDCON_DETACH           (_U(0x1) << USBC_UDCON_DETACH_Pos)
#define USBC_UDCON_RMWKUP_Pos       9            /**< \brief (USBC_UDCON) Remote Wake-Up */
#define USBC_UDCON_RMWKUP           (_U(0x1) << USBC_UDCON_RMWKUP_Pos)
#define USBC_UDCON_SPDCONF_Pos      10           /**< \brief (USBC_UDCON) Speed configuration */
#define USBC_UDCON_SPDCONF_Msk      (_U(0x3) << USBC_UDCON_SPDCONF_Pos)
#define USBC_UDCON_SPDCONF(value)   (USBC_UDCON_SPDCONF_Msk & ((value) << USBC_UDCON_SPDCONF_Pos))
#define USBC_UDCON_LS_Pos           12           /**< \brief (USBC_UDCON) Low Speed Mode Force */
#define USBC_UDCON_LS               (_U(0x1) << USBC_UDCON_LS_Pos)
#define USBC_UDCON_TSTJ_Pos         13           /**< \brief (USBC_UDCON) Test mode J */
#define USBC_UDCON_TSTJ             (_U(0x1) << USBC_UDCON_TSTJ_Pos)
#define USBC_UDCON_TSTK_Pos         14           /**< \brief (USBC_UDCON) Test mode K */
#define USBC_UDCON_TSTK             (_U(0x1) << USBC_UDCON_TSTK_Pos)
#define USBC_UDCON_TSTPCKT_Pos      15           /**< \brief (USBC_UDCON) Test Packet mode */
#define USBC_UDCON_TSTPCKT          (_U(0x1) << USBC_UDCON_TSTPCKT_Pos)
#define USBC_UDCON_OPMODE2_Pos      16           /**< \brief (USBC_UDCON) Specific Operational mode */
#define USBC_UDCON_OPMODE2          (_U(0x1) << USBC_UDCON_OPMODE2_Pos)
#define USBC_UDCON_GNAK_Pos         17           /**< \brief (USBC_UDCON) Global NAK */
#define USBC_UDCON_GNAK             (_U(0x1) << USBC_UDCON_GNAK_Pos)
#define USBC_UDCON_MASK             _U(0x0003FFFF) /**< \brief (USBC_UDCON) MASK Register */

/* -------- USBC_UDINT : (USBC Offset: 0x004) (R/  32) Device Global Interupt Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SUSP:1;           /*!< bit:      0  Suspend Interrupt                  */
    uint32_t MSOF:1;           /*!< bit:      1  Micro Start of Frame Interrupt     */
    uint32_t SOF:1;            /*!< bit:      2  Start of Frame Interrupt           */
    uint32_t EORST:1;          /*!< bit:      3  End of Reset Interrupt             */
    uint32_t WAKEUP:1;         /*!< bit:      4  Wake-Up Interrupt                  */
    uint32_t EORSM:1;          /*!< bit:      5  End Of Resume Interrupt            */
    uint32_t UPRSM:1;          /*!< bit:      6  Upstream Resume Interrupt          */
    uint32_t :5;               /*!< bit:  7..11  Reserved                           */
    uint32_t EP0INT:1;         /*!< bit:     12  Endpoint 0 Interrupt               */
    uint32_t EP1INT:1;         /*!< bit:     13  Endpoint 1 Interrupt               */
    uint32_t EP2INT:1;         /*!< bit:     14  Endpoint 2 Interrupt               */
    uint32_t EP3INT:1;         /*!< bit:     15  Endpoint 3 Interrupt               */
    uint32_t EP4INT:1;         /*!< bit:     16  Endpoint 4 Interrupt               */
    uint32_t EP5INT:1;         /*!< bit:     17  Endpoint 5 Interrupt               */
    uint32_t EP6INT:1;         /*!< bit:     18  Endpoint 6 Interrupt               */
    uint32_t EP7INT:1;         /*!< bit:     19  Endpoint 7 Interrupt               */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UDINT_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UDINT_OFFSET           0x004        /**< \brief (USBC_UDINT offset) Device Global Interupt Register */
#define USBC_UDINT_RESETVALUE       _U(0x00000000); /**< \brief (USBC_UDINT reset_value) Device Global Interupt Register */

