frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/* -------- USBC_UDINTESET : (USBC Offset: 0x018) ( /W 32) Device Global Interrupt Enable Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SUSPES:1;         /*!< bit:      0  SUSP Interrupt Enable Set          */
    uint32_t MSOFES:1;         /*!< bit:      1  MSOF Interrupt Enable Set          */
    uint32_t SOFES:1;          /*!< bit:      2  SOF Interrupt Enable Set           */
    uint32_t EORSTES:1;        /*!< bit:      3  EORST Interrupt Enable Set         */
    uint32_t WAKEUPES:1;       /*!< bit:      4  WAKEUP Interrupt Enable Set        */
    uint32_t EORSMES:1;        /*!< bit:      5  EORSM Interrupt Enable Set         */
    uint32_t UPRSMES:1;        /*!< bit:      6  UPRSM Interrupt Enable Set         */
    uint32_t :5;               /*!< bit:  7..11  Reserved                           */
    uint32_t EP0INTES:1;       /*!< bit:     12  EP0INT Interrupt Enable Set        */
    uint32_t EP1INTES:1;       /*!< bit:     13  EP1INT Interrupt Enable Set        */
    uint32_t EP2INTES:1;       /*!< bit:     14  EP2INT Interrupt Enable Set        */
    uint32_t EP3INTES:1;       /*!< bit:     15  EP3INT Interrupt Enable Set        */
    uint32_t EP4INTES:1;       /*!< bit:     16  EP4INT Interrupt Enable Set        */
    uint32_t EP5INTES:1;       /*!< bit:     17  EP5INT Interrupt Enable Set        */
    uint32_t EP6INTES:1;       /*!< bit:     18  EP6INT Interrupt Enable Set        */
    uint32_t EP7INTES:1;       /*!< bit:     19  EP7INT Interrupt Enable Set        */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UDINTESET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UDINTESET_OFFSET       0x018        /**< \brief (USBC_UDINTESET offset) Device Global Interrupt Enable Set Register */
#define USBC_UDINTESET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UDINTESET reset_value) Device Global Interrupt Enable Set Register */

#define USBC_UDINTESET_SUSPES_Pos   0            /**< \brief (USBC_UDINTESET) SUSP Interrupt Enable Set */
#define USBC_UDINTESET_SUSPES       (_U(0x1) << USBC_UDINTESET_SUSPES_Pos)
#define USBC_UDINTESET_MSOFES_Pos   1            /**< \brief (USBC_UDINTESET) MSOF Interrupt Enable Set */
#define USBC_UDINTESET_MSOFES       (_U(0x1) << USBC_UDINTESET_MSOFES_Pos)
#define USBC_UDINTESET_SOFES_Pos    2            /**< \brief (USBC_UDINTESET) SOF Interrupt Enable Set */
#define USBC_UDINTESET_SOFES        (_U(0x1) << USBC_UDINTESET_SOFES_Pos)
#define USBC_UDINTESET_EORSTES_Pos  3            /**< \brief (USBC_UDINTESET) EORST Interrupt Enable Set */
#define USBC_UDINTESET_EORSTES      (_U(0x1) << USBC_UDINTESET_EORSTES_Pos)
#define USBC_UDINTESET_WAKEUPES_Pos 4            /**< \brief (USBC_UDINTESET) WAKEUP Interrupt Enable Set */
#define USBC_UDINTESET_WAKEUPES     (_U(0x1) << USBC_UDINTESET_WAKEUPES_Pos)
#define USBC_UDINTESET_EORSMES_Pos  5            /**< \brief (USBC_UDINTESET) EORSM Interrupt Enable Set */
#define USBC_UDINTESET_EORSMES      (_U(0x1) << USBC_UDINTESET_EORSMES_Pos)
#define USBC_UDINTESET_UPRSMES_Pos  6            /**< \brief (USBC_UDINTESET) UPRSM Interrupt Enable Set */
#define USBC_UDINTESET_UPRSMES      (_U(0x1) << USBC_UDINTESET_UPRSMES_Pos)
#define USBC_UDINTESET_EP0INTES_Pos 12           /**< \brief (USBC_UDINTESET) EP0INT Interrupt Enable Set */
#define USBC_UDINTESET_EP0INTES     (_U(0x1) << USBC_UDINTESET_EP0INTES_Pos)
#define USBC_UDINTESET_EP1INTES_Pos 13           /**< \brief (USBC_UDINTESET) EP1INT Interrupt Enable Set */
#define USBC_UDINTESET_EP1INTES     (_U(0x1) << USBC_UDINTESET_EP1INTES_Pos)
#define USBC_UDINTESET_EP2INTES_Pos 14           /**< \brief (USBC_UDINTESET) EP2INT Interrupt Enable Set */
#define USBC_UDINTESET_EP2INTES     (_U(0x1) << USBC_UDINTESET_EP2INTES_Pos)
#define USBC_UDINTESET_EP3INTES_Pos 15           /**< \brief (USBC_UDINTESET) EP3INT Interrupt Enable Set */
#define USBC_UDINTESET_EP3INTES     (_U(0x1) << USBC_UDINTESET_EP3INTES_Pos)
#define USBC_UDINTESET_EP4INTES_Pos 16           /**< \brief (USBC_UDINTESET) EP4INT Interrupt Enable Set */
#define USBC_UDINTESET_EP4INTES     (_U(0x1) << USBC_UDINTESET_EP4INTES_Pos)
#define USBC_UDINTESET_EP5INTES_Pos 17           /**< \brief (USBC_UDINTESET) EP5INT Interrupt Enable Set */
#define USBC_UDINTESET_EP5INTES     (_U(0x1) << USBC_UDINTESET_EP5INTES_Pos)
#define USBC_UDINTESET_EP6INTES_Pos 18           /**< \brief (USBC_UDINTESET) EP6INT Interrupt Enable Set */
#define USBC_UDINTESET_EP6INTES     (_U(0x1) << USBC_UDINTESET_EP6INTES_Pos)
#define USBC_UDINTESET_EP7INTES_Pos 19           /**< \brief (USBC_UDINTESET) EP7INT Interrupt Enable Set */
#define USBC_UDINTESET_EP7INTES     (_U(0x1) << USBC_UDINTESET_EP7INTES_Pos)
#define USBC_UDINTESET_MASK         _U(0x000FF07F) /**< \brief (USBC_UDINTESET) MASK Register */

/* -------- USBC_UERST : (USBC Offset: 0x01C) (R/W 32) Endpoint Enable/Reset Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t EPEN0:1;          /*!< bit:      0  Endpoint0 Enable                   */
    uint32_t EPEN1:1;          /*!< bit:      1  Endpoint1 Enable                   */
    uint32_t EPEN2:1;          /*!< bit:      2  Endpoint2 Enable                   */
    uint32_t EPEN3:1;          /*!< bit:      3  Endpoint3 Enable                   */
    uint32_t EPEN4:1;          /*!< bit:      4  Endpoint4 Enable                   */
    uint32_t EPEN5:1;          /*!< bit:      5  Endpoint5 Enable                   */
    uint32_t EPEN6:1;          /*!< bit:      6  Endpoint6 Enable                   */
    uint32_t EPEN7:1;          /*!< bit:      7  Endpoint7 Enable                   */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UERST_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UERST_OFFSET           0x01C        /**< \brief (USBC_UERST offset) Endpoint Enable/Reset Register */
#define USBC_UERST_RESETVALUE       _U(0x00000000); /**< \brief (USBC_UERST reset_value) Endpoint Enable/Reset Register */

#define USBC_UERST_EPEN0_Pos        0            /**< \brief (USBC_UERST) Endpoint0 Enable */
#define USBC_UERST_EPEN0            (_U(0x1) << USBC_UERST_EPEN0_Pos)
#define USBC_UERST_EPEN1_Pos        1            /**< \brief (USBC_UERST) Endpoint1 Enable */
#define USBC_UERST_EPEN1            (_U(0x1) << USBC_UERST_EPEN1_Pos)
#define USBC_UERST_EPEN2_Pos        2            /**< \brief (USBC_UERST) Endpoint2 Enable */
#define USBC_UERST_EPEN2            (_U(0x1) << USBC_UERST_EPEN2_Pos)
#define USBC_UERST_EPEN3_Pos        3            /**< \brief (USBC_UERST) Endpoint3 Enable */
#define USBC_UERST_EPEN3            (_U(0x1) << USBC_UERST_EPEN3_Pos)
#define USBC_UERST_EPEN4_Pos        4            /**< \brief (USBC_UERST) Endpoint4 Enable */
#define USBC_UERST_EPEN4            (_U(0x1) << USBC_UERST_EPEN4_Pos)
#define USBC_UERST_EPEN5_Pos        5            /**< \brief (USBC_UERST) Endpoint5 Enable */
#define USBC_UERST_EPEN5            (_U(0x1) << USBC_UERST_EPEN5_Pos)
#define USBC_UERST_EPEN6_Pos        6            /**< \brief (USBC_UERST) Endpoint6 Enable */
#define USBC_UERST_EPEN6            (_U(0x1) << USBC_UERST_EPEN6_Pos)
#define USBC_UERST_EPEN7_Pos        7            /**< \brief (USBC_UERST) Endpoint7 Enable */
#define USBC_UERST_EPEN7            (_U(0x1) << USBC_UERST_EPEN7_Pos)
#define USBC_UERST_MASK             _U(0x000000FF) /**< \brief (USBC_UERST) MASK Register */

/* -------- USBC_UDFNUM : (USBC Offset: 0x020) (R/  32) Device Frame Number Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t MFNUM:3;          /*!< bit:  0.. 2  Micro Frame Number                 */
    uint32_t FNUM:11;          /*!< bit:  3..13  Frame Number                       */
    uint32_t :1;               /*!< bit:     14  Reserved                           */
    uint32_t FNCERR:1;         /*!< bit:     15  Frame Number CRC Error             */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UDFNUM_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UDFNUM_OFFSET          0x020        /**< \brief (USBC_UDFNUM offset) Device Frame Number Register */
#define USBC_UDFNUM_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UDFNUM reset_value) Device Frame Number Register */

#define USBC_UDFNUM_MFNUM_Pos       0            /**< \brief (USBC_UDFNUM) Micro Frame Number */
#define USBC_UDFNUM_MFNUM_Msk       (_U(0x7) << USBC_UDFNUM_MFNUM_Pos)
#define USBC_UDFNUM_MFNUM(value)    (USBC_UDFNUM_MFNUM_Msk & ((value) << USBC_UDFNUM_MFNUM_Pos))
#define USBC_UDFNUM_FNUM_Pos        3            /**< \brief (USBC_UDFNUM) Frame Number */
#define USBC_UDFNUM_FNUM_Msk        (_U(0x7FF) << USBC_UDFNUM_FNUM_Pos)
#define USBC_UDFNUM_FNUM(value)     (USBC_UDFNUM_FNUM_Msk & ((value) << USBC_UDFNUM_FNUM_Pos))
#define USBC_UDFNUM_FNCERR_Pos      15           /**< \brief (USBC_UDFNUM) Frame Number CRC Error */
#define USBC_UDFNUM_FNCERR          (_U(0x1) << USBC_UDFNUM_FNCERR_Pos)
#define USBC_UDFNUM_MASK            _U(0x0000BFFF) /**< \brief (USBC_UDFNUM) MASK Register */

/* -------- USBC_UECFG0 : (USBC Offset: 0x100) (R/W 32) Endpoint Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t EPBK:1;           /*!< bit:      2  Endpoint Bank                      */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t EPSIZE:3;         /*!< bit:  4.. 6  Endpoint Size                      */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t EPDIR:1;          /*!< bit:      8  Endpoint Direction                 */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t EPTYPE:2;         /*!< bit: 11..12  Endpoint Type                      */
    uint32_t :3;               /*!< bit: 13..15  Reserved                           */
    uint32_t REPNB:4;          /*!< bit: 16..19  Redirected Endpoint Number         */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECFG0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECFG0_OFFSET          0x100        /**< \brief (USBC_UECFG0 offset) Endpoint Configuration Register */
#define USBC_UECFG0_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UECFG0 reset_value) Endpoint Configuration Register */

#define USBC_UECFG0_EPBK_Pos        2            /**< \brief (USBC_UECFG0) Endpoint Bank */
#define USBC_UECFG0_EPBK            (_U(0x1) << USBC_UECFG0_EPBK_Pos)
#define   USBC_UECFG0_EPBK_SINGLE_Val     _U(0x0)   /**< \brief (USBC_UECFG0)  */
#define   USBC_UECFG0_EPBK_DOUBLE_Val     _U(0x1)   /**< \brief (USBC_UECFG0)  */
#define USBC_UECFG0_EPBK_SINGLE     (USBC_UECFG0_EPBK_SINGLE_Val   << USBC_UECFG0_EPBK_Pos)
#define USBC_UECFG0_EPBK_DOUBLE     (USBC_UECFG0_EPBK_DOUBLE_Val   << USBC_UECFG0_EPBK_Pos)
#define USBC_UECFG0_EPSIZE_Pos      4            /**< \brief (USBC_UECFG0) Endpoint Size */
#define USBC_UECFG0_EPSIZE_Msk      (_U(0x7) << USBC_UECFG0_EPSIZE_Pos)
#define USBC_UECFG0_EPSIZE(value)   (USBC_UECFG0_EPSIZE_Msk & ((value) << USBC_UECFG0_EPSIZE_Pos))
#define   USBC_UECFG0_EPSIZE_8_Val        _U(0x0)   /**< \brief (USBC_UECFG0)  */
#define   USBC_UECFG0_EPSIZE_16_Val       _U(0x1)   /**< \brief (USBC_UECFG0)  */
#define   USBC_UECFG0_EPSIZE_32_Val       _U(0x2)   /**< \brief (USBC_UECFG0)  */
#define   USBC_UECFG0_EPSIZE_64_Val       _U(0x3)   /**< \brief (USBC_UECFG0)  */
#define   USBC_UECFG0_EPSIZE_128_Val      _U(0x4)   /**< \brief (USBC_UECFG0)  */
#define   USBC_UECFG0_EPSIZE_256_Val      _U(0x5)   /**< \brief (USBC_UECFG0)  */
#define   USBC_UECFG0_EPSIZE_512_Val      _U(0x6)   /**< \brief (USBC_UECFG0)  */
#define   USBC_UECFG0_EPSIZE_1024_Val     _U(0x7)   /**< \brief (USBC_UECFG0)  */
#define USBC_UECFG0_EPSIZE_8        (USBC_UECFG0_EPSIZE_8_Val      << USBC_UECFG0_EPSIZE_Pos)
#define USBC_UECFG0_EPSIZE_16       (USBC_UECFG0_EPSIZE_16_Val     << USBC_UECFG0_EPSIZE_Pos)
#define USBC_UECFG0_EPSIZE_32       (USBC_UECFG0_EPSIZE_32_Val     << USBC_UECFG0_EPSIZE_Pos)
#define USBC_UECFG0_EPSIZE_64       (USBC_UECFG0_EPSIZE_64_Val     << USBC_UECFG0_EPSIZE_Pos)
#define USBC_UECFG0_EPSIZE_128      (USBC_UECFG0_EPSIZE_128_Val    << USBC_UECFG0_EPSIZE_Pos)
#define USBC_UECFG0_EPSIZE_256      (USBC_UECFG0_EPSIZE_256_Val    << USBC_UECFG0_EPSIZE_Pos)
#define USBC_UECFG0_EPSIZE_512      (USBC_UECFG0_EPSIZE_512_Val    << USBC_UECFG0_EPSIZE_Pos)
#define USBC_UECFG0_EPSIZE_1024     (USBC_UECFG0_EPSIZE_1024_Val   << USBC_UECFG0_EPSIZE_Pos)
#define USBC_UECFG0_EPDIR_Pos       8            /**< \brief (USBC_UECFG0) Endpoint Direction */
#define USBC_UECFG0_EPDIR           (_U(0x1) << USBC_UECFG0_EPDIR_Pos)
#define   USBC_UECFG0_EPDIR_OUT_Val       _U(0x0)   /**< \brief (USBC_UECFG0)  */
#define   USBC_UECFG0_EPDIR_IN_Val        _U(0x1)   /**< \brief (USBC_UECFG0)  */
#define USBC_UECFG0_EPDIR_OUT       (USBC_UECFG0_EPDIR_OUT_Val     << USBC_UECFG0_EPDIR_Pos)
#define USBC_UECFG0_EPDIR_IN        (USBC_UECFG0_EPDIR_IN_Val      << USBC_UECFG0_EPDIR_Pos)
#define USBC_UECFG0_EPTYPE_Pos      11           /**< \brief (USBC_UECFG0) Endpoint Type */
#define USBC_UECFG0_EPTYPE_Msk      (_U(0x3) << USBC_UECFG0_EPTYPE_Pos)
#define USBC_UECFG0_EPTYPE(value)   (USBC_UECFG0_EPTYPE_Msk & ((value) << USBC_UECFG0_EPTYPE_Pos))
#define   USBC_UECFG0_EPTYPE_CONTROL_Val  _U(0x0)   /**< \brief (USBC_UECFG0)  */
#define   USBC_UECFG0_EPTYPE_ISOCHRONOUS_Val _U(0x1)   /**< \brief (USBC_UECFG0)  */
#define   USBC_UECFG0_EPTYPE_BULK_Val     _U(0x2)   /**< \brief (USBC_UECFG0)  */
#define   USBC_UECFG0_EPTYPE_INTERRUPT_Val _U(0x3)   /**< \brief (USBC_UECFG0)  */
#define USBC_UECFG0_EPTYPE_CONTROL  (USBC_UECFG0_EPTYPE_CONTROL_Val << USBC_UECFG0_EPTYPE_Pos)
#define USBC_UECFG0_EPTYPE_ISOCHRONOUS (USBC_UECFG0_EPTYPE_ISOCHRONOUS_Val << USBC_UECFG0_EPTYPE_Pos)
#define USBC_UECFG0_EPTYPE_BULK     (USBC_UECFG0_EPTYPE_BULK_Val   << USBC_UECFG0_EPTYPE_Pos)
#define USBC_UECFG0_EPTYPE_INTERRUPT (USBC_UECFG0_EPTYPE_INTERRUPT_Val << USBC_UECFG0_EPTYPE_Pos)
#define USBC_UECFG0_REPNB_Pos       16           /**< \brief (USBC_UECFG0) Redirected Endpoint Number */
#define USBC_UECFG0_REPNB_Msk       (_U(0xF) << USBC_UECFG0_REPNB_Pos)
#define USBC_UECFG0_REPNB(value)    (USBC_UECFG0_REPNB_Msk & ((value) << USBC_UECFG0_REPNB_Pos))
#define USBC_UECFG0_MASK            _U(0x000F1974) /**< \brief (USBC_UECFG0) MASK Register */

/* -------- USBC_UECFG1 : (USBC Offset: 0x104) (R/W 32) Endpoint Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t EPBK:1;           /*!< bit:      2  Endpoint Bank                      */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t EPSIZE:3;         /*!< bit:  4.. 6  Endpoint Size                      */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t EPDIR:1;          /*!< bit:      8  Endpoint Direction                 */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t EPTYPE:2;         /*!< bit: 11..12  Endpoint Type                      */
    uint32_t :3;               /*!< bit: 13..15  Reserved                           */
    uint32_t REPNB:4;          /*!< bit: 16..19  Redirected Endpoint Number         */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECFG1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECFG1_OFFSET          0x104        /**< \brief (USBC_UECFG1 offset) Endpoint Configuration Register */
#define USBC_UECFG1_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UECFG1 reset_value) Endpoint Configuration Register */

#define USBC_UECFG1_EPBK_Pos        2            /**< \brief (USBC_UECFG1) Endpoint Bank */
#define USBC_UECFG1_EPBK            (_U(0x1) << USBC_UECFG1_EPBK_Pos)
#define   USBC_UECFG1_EPBK_SINGLE_Val     _U(0x0)   /**< \brief (USBC_UECFG1)  */
#define   USBC_UECFG1_EPBK_DOUBLE_Val     _U(0x1)   /**< \brief (USBC_UECFG1)  */
#define USBC_UECFG1_EPBK_SINGLE     (USBC_UECFG1_EPBK_SINGLE_Val   << USBC_UECFG1_EPBK_Pos)
#define USBC_UECFG1_EPBK_DOUBLE     (USBC_UECFG1_EPBK_DOUBLE_Val   << USBC_UECFG1_EPBK_Pos)
#define USBC_UECFG1_EPSIZE_Pos      4            /**< \brief (USBC_UECFG1) Endpoint Size */
#define USBC_UECFG1_EPSIZE_Msk      (_U(0x7) << USBC_UECFG1_EPSIZE_Pos)
#define USBC_UECFG1_EPSIZE(value)   (USBC_UECFG1_EPSIZE_Msk & ((value) << USBC_UECFG1_EPSIZE_Pos))
#define   USBC_UECFG1_EPSIZE_8_Val        _U(0x0)   /**< \brief (USBC_UECFG1)  */
#define   USBC_UECFG1_EPSIZE_16_Val       _U(0x1)   /**< \brief (USBC_UECFG1)  */
#define   USBC_UECFG1_EPSIZE_32_Val       _U(0x2)   /**< \brief (USBC_UECFG1)  */
#define   USBC_UECFG1_EPSIZE_64_Val       _U(0x3)   /**< \brief (USBC_UECFG1)  */
#define   USBC_UECFG1_EPSIZE_128_Val      _U(0x4)   /**< \brief (USBC_UECFG1)  */
#define   USBC_UECFG1_EPSIZE_256_Val      _U(0x5)   /**< \brief (USBC_UECFG1)  */
#define   USBC_UECFG1_EPSIZE_512_Val      _U(0x6)   /**< \brief (USBC_UECFG1)  */
#define   USBC_UECFG1_EPSIZE_1024_Val     _U(0x7)   /**< \brief (USBC_UECFG1)  */
#define USBC_UECFG1_EPSIZE_8        (USBC_UECFG1_EPSIZE_8_Val      << USBC_UECFG1_EPSIZE_Pos)
#define USBC_UECFG1_EPSIZE_16       (USBC_UECFG1_EPSIZE_16_Val     << USBC_UECFG1_EPSIZE_Pos)
#define USBC_UECFG1_EPSIZE_32       (USBC_UECFG1_EPSIZE_32_Val     << USBC_UECFG1_EPSIZE_Pos)
#define USBC_UECFG1_EPSIZE_64       (USBC_UECFG1_EPSIZE_64_Val     << USBC_UECFG1_EPSIZE_Pos)
#define USBC_UECFG1_EPSIZE_128      (USBC_UECFG1_EPSIZE_128_Val    << USBC_UECFG1_EPSIZE_Pos)
#define USBC_UECFG1_EPSIZE_256      (USBC_UECFG1_EPSIZE_256_Val    << USBC_UECFG1_EPSIZE_Pos)
#define USBC_UECFG1_EPSIZE_512      (USBC_UECFG1_EPSIZE_512_Val    << USBC_UECFG1_EPSIZE_Pos)
#define USBC_UECFG1_EPSIZE_1024     (USBC_UECFG1_EPSIZE_1024_Val   << USBC_UECFG1_EPSIZE_Pos)
#define USBC_UECFG1_EPDIR_Pos       8            /**< \brief (USBC_UECFG1) Endpoint Direction */
#define USBC_UECFG1_EPDIR           (_U(0x1) << USBC_UECFG1_EPDIR_Pos)
#define   USBC_UECFG1_EPDIR_OUT_Val       _U(0x0)   /**< \brief (USBC_UECFG1)  */
#define   USBC_UECFG1_EPDIR_IN_Val        _U(0x1)   /**< \brief (USBC_UECFG1)  */
#define USBC_UECFG1_EPDIR_OUT       (USBC_UECFG1_EPDIR_OUT_Val     << USBC_UECFG1_EPDIR_Pos)
#define USBC_UECFG1_EPDIR_IN        (USBC_UECFG1_EPDIR_IN_Val      << USBC_UECFG1_EPDIR_Pos)
#define USBC_UECFG1_EPTYPE_Pos      11           /**< \brief (USBC_UECFG1) Endpoint Type */
#define USBC_UECFG1_EPTYPE_Msk      (_U(0x3) << USBC_UECFG1_EPTYPE_Pos)
#define USBC_UECFG1_EPTYPE(value)   (USBC_UECFG1_EPTYPE_Msk & ((value) << USBC_UECFG1_EPTYPE_Pos))
#define   USBC_UECFG1_EPTYPE_CONTROL_Val  _U(0x0)   /**< \brief (USBC_UECFG1)  */
#define   USBC_UECFG1_EPTYPE_ISOCHRONOUS_Val _U(0x1)   /**< \brief (USBC_UECFG1)  */
#define   USBC_UECFG1_EPTYPE_BULK_Val     _U(0x2)   /**< \brief (USBC_UECFG1)  */
#define   USBC_UECFG1_EPTYPE_INTERRUPT_Val _U(0x3)   /**< \brief (USBC_UECFG1)  */
#define USBC_UECFG1_EPTYPE_CONTROL  (USBC_UECFG1_EPTYPE_CONTROL_Val << USBC_UECFG1_EPTYPE_Pos)
#define USBC_UECFG1_EPTYPE_ISOCHRONOUS (USBC_UECFG1_EPTYPE_ISOCHRONOUS_Val << USBC_UECFG1_EPTYPE_Pos)
#define USBC_UECFG1_EPTYPE_BULK     (USBC_UECFG1_EPTYPE_BULK_Val   << USBC_UECFG1_EPTYPE_Pos)
#define USBC_UECFG1_EPTYPE_INTERRUPT (USBC_UECFG1_EPTYPE_INTERRUPT_Val << USBC_UECFG1_EPTYPE_Pos)
#define USBC_UECFG1_REPNB_Pos       16           /**< \brief (USBC_UECFG1) Redirected Endpoint Number */
#define USBC_UECFG1_REPNB_Msk       (_U(0xF) << USBC_UECFG1_REPNB_Pos)
#define USBC_UECFG1_REPNB(value)    (USBC_UECFG1_REPNB_Msk & ((value) << USBC_UECFG1_REPNB_Pos))
#define USBC_UECFG1_MASK            _U(0x000F1974) /**< \brief (USBC_UECFG1) MASK Register */

/* -------- USBC_UECFG2 : (USBC Offset: 0x108) (R/W 32) Endpoint Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t EPBK:1;           /*!< bit:      2  Endpoint Bank                      */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t EPSIZE:3;         /*!< bit:  4.. 6  Endpoint Size                      */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t EPDIR:1;          /*!< bit:      8  Endpoint Direction                 */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t EPTYPE:2;         /*!< bit: 11..12  Endpoint Type                      */
    uint32_t :3;               /*!< bit: 13..15  Reserved                           */
    uint32_t REPNB:4;          /*!< bit: 16..19  Redirected Endpoint Number         */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECFG2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECFG2_OFFSET          0x108        /**< \brief (USBC_UECFG2 offset) Endpoint Configuration Register */
#define USBC_UECFG2_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UECFG2 reset_value) Endpoint Configuration Register */

