frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UECFG4_OFFSET          0x110        /**< \brief (USBC_UECFG4 offset) Endpoint Configuration Register */
#define USBC_UECFG4_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UECFG4 reset_value) Endpoint Configuration Register */

#define USBC_UECFG4_EPBK_Pos        2            /**< \brief (USBC_UECFG4) Endpoint Bank */
#define USBC_UECFG4_EPBK            (_U(0x1) << USBC_UECFG4_EPBK_Pos)
#define   USBC_UECFG4_EPBK_SINGLE_Val     _U(0x0)   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPBK_DOUBLE_Val     _U(0x1)   /**< \brief (USBC_UECFG4)  */
#define USBC_UECFG4_EPBK_SINGLE     (USBC_UECFG4_EPBK_SINGLE_Val   << USBC_UECFG4_EPBK_Pos)
#define USBC_UECFG4_EPBK_DOUBLE     (USBC_UECFG4_EPBK_DOUBLE_Val   << USBC_UECFG4_EPBK_Pos)
#define USBC_UECFG4_EPSIZE_Pos      4            /**< \brief (USBC_UECFG4) Endpoint Size */
#define USBC_UECFG4_EPSIZE_Msk      (_U(0x7) << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE(value)   (USBC_UECFG4_EPSIZE_Msk & ((value) << USBC_UECFG4_EPSIZE_Pos))
#define   USBC_UECFG4_EPSIZE_8_Val        _U(0x0)   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPSIZE_16_Val       _U(0x1)   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPSIZE_32_Val       _U(0x2)   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPSIZE_64_Val       _U(0x3)   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPSIZE_128_Val      _U(0x4)   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPSIZE_256_Val      _U(0x5)   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPSIZE_512_Val      _U(0x6)   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPSIZE_1024_Val     _U(0x7)   /**< \brief (USBC_UECFG4)  */
#define USBC_UECFG4_EPSIZE_8        (USBC_UECFG4_EPSIZE_8_Val      << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE_16       (USBC_UECFG4_EPSIZE_16_Val     << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE_32       (USBC_UECFG4_EPSIZE_32_Val     << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE_64       (USBC_UECFG4_EPSIZE_64_Val     << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE_128      (USBC_UECFG4_EPSIZE_128_Val    << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE_256      (USBC_UECFG4_EPSIZE_256_Val    << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE_512      (USBC_UECFG4_EPSIZE_512_Val    << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPSIZE_1024     (USBC_UECFG4_EPSIZE_1024_Val   << USBC_UECFG4_EPSIZE_Pos)
#define USBC_UECFG4_EPDIR_Pos       8            /**< \brief (USBC_UECFG4) Endpoint Direction */
#define USBC_UECFG4_EPDIR           (_U(0x1) << USBC_UECFG4_EPDIR_Pos)
#define   USBC_UECFG4_EPDIR_OUT_Val       _U(0x0)   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPDIR_IN_Val        _U(0x1)   /**< \brief (USBC_UECFG4)  */
#define USBC_UECFG4_EPDIR_OUT       (USBC_UECFG4_EPDIR_OUT_Val     << USBC_UECFG4_EPDIR_Pos)
#define USBC_UECFG4_EPDIR_IN        (USBC_UECFG4_EPDIR_IN_Val      << USBC_UECFG4_EPDIR_Pos)
#define USBC_UECFG4_EPTYPE_Pos      11           /**< \brief (USBC_UECFG4) Endpoint Type */
#define USBC_UECFG4_EPTYPE_Msk      (_U(0x3) << USBC_UECFG4_EPTYPE_Pos)
#define USBC_UECFG4_EPTYPE(value)   (USBC_UECFG4_EPTYPE_Msk & ((value) << USBC_UECFG4_EPTYPE_Pos))
#define   USBC_UECFG4_EPTYPE_CONTROL_Val  _U(0x0)   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPTYPE_ISOCHRONOUS_Val _U(0x1)   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPTYPE_BULK_Val     _U(0x2)   /**< \brief (USBC_UECFG4)  */
#define   USBC_UECFG4_EPTYPE_INTERRUPT_Val _U(0x3)   /**< \brief (USBC_UECFG4)  */
#define USBC_UECFG4_EPTYPE_CONTROL  (USBC_UECFG4_EPTYPE_CONTROL_Val << USBC_UECFG4_EPTYPE_Pos)
#define USBC_UECFG4_EPTYPE_ISOCHRONOUS (USBC_UECFG4_EPTYPE_ISOCHRONOUS_Val << USBC_UECFG4_EPTYPE_Pos)
#define USBC_UECFG4_EPTYPE_BULK     (USBC_UECFG4_EPTYPE_BULK_Val   << USBC_UECFG4_EPTYPE_Pos)
#define USBC_UECFG4_EPTYPE_INTERRUPT (USBC_UECFG4_EPTYPE_INTERRUPT_Val << USBC_UECFG4_EPTYPE_Pos)
#define USBC_UECFG4_REPNB_Pos       16           /**< \brief (USBC_UECFG4) Redirected Endpoint Number */
#define USBC_UECFG4_REPNB_Msk       (_U(0xF) << USBC_UECFG4_REPNB_Pos)
#define USBC_UECFG4_REPNB(value)    (USBC_UECFG4_REPNB_Msk & ((value) << USBC_UECFG4_REPNB_Pos))
#define USBC_UECFG4_MASK            _U(0x000F1974) /**< \brief (USBC_UECFG4) MASK Register */

/* -------- USBC_UECFG5 : (USBC Offset: 0x114) (R/W 32) Endpoint Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t EPBK:1;           /*!< bit:      2  Endpoint Bank                      */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t EPSIZE:3;         /*!< bit:  4.. 6  Endpoint Size                      */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t EPDIR:1;          /*!< bit:      8  Endpoint Direction                 */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t EPTYPE:2;         /*!< bit: 11..12  Endpoint Type                      */
    uint32_t :3;               /*!< bit: 13..15  Reserved                           */
    uint32_t REPNB:4;          /*!< bit: 16..19  Redirected Endpoint Number         */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECFG5_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECFG5_OFFSET          0x114        /**< \brief (USBC_UECFG5 offset) Endpoint Configuration Register */
#define USBC_UECFG5_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UECFG5 reset_value) Endpoint Configuration Register */

#define USBC_UECFG5_EPBK_Pos        2            /**< \brief (USBC_UECFG5) Endpoint Bank */
#define USBC_UECFG5_EPBK            (_U(0x1) << USBC_UECFG5_EPBK_Pos)
#define   USBC_UECFG5_EPBK_SINGLE_Val     _U(0x0)   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPBK_DOUBLE_Val     _U(0x1)   /**< \brief (USBC_UECFG5)  */
#define USBC_UECFG5_EPBK_SINGLE     (USBC_UECFG5_EPBK_SINGLE_Val   << USBC_UECFG5_EPBK_Pos)
#define USBC_UECFG5_EPBK_DOUBLE     (USBC_UECFG5_EPBK_DOUBLE_Val   << USBC_UECFG5_EPBK_Pos)
#define USBC_UECFG5_EPSIZE_Pos      4            /**< \brief (USBC_UECFG5) Endpoint Size */
#define USBC_UECFG5_EPSIZE_Msk      (_U(0x7) << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE(value)   (USBC_UECFG5_EPSIZE_Msk & ((value) << USBC_UECFG5_EPSIZE_Pos))
#define   USBC_UECFG5_EPSIZE_8_Val        _U(0x0)   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPSIZE_16_Val       _U(0x1)   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPSIZE_32_Val       _U(0x2)   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPSIZE_64_Val       _U(0x3)   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPSIZE_128_Val      _U(0x4)   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPSIZE_256_Val      _U(0x5)   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPSIZE_512_Val      _U(0x6)   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPSIZE_1024_Val     _U(0x7)   /**< \brief (USBC_UECFG5)  */
#define USBC_UECFG5_EPSIZE_8        (USBC_UECFG5_EPSIZE_8_Val      << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE_16       (USBC_UECFG5_EPSIZE_16_Val     << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE_32       (USBC_UECFG5_EPSIZE_32_Val     << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE_64       (USBC_UECFG5_EPSIZE_64_Val     << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE_128      (USBC_UECFG5_EPSIZE_128_Val    << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE_256      (USBC_UECFG5_EPSIZE_256_Val    << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE_512      (USBC_UECFG5_EPSIZE_512_Val    << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPSIZE_1024     (USBC_UECFG5_EPSIZE_1024_Val   << USBC_UECFG5_EPSIZE_Pos)
#define USBC_UECFG5_EPDIR_Pos       8            /**< \brief (USBC_UECFG5) Endpoint Direction */
#define USBC_UECFG5_EPDIR           (_U(0x1) << USBC_UECFG5_EPDIR_Pos)
#define   USBC_UECFG5_EPDIR_OUT_Val       _U(0x0)   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPDIR_IN_Val        _U(0x1)   /**< \brief (USBC_UECFG5)  */
#define USBC_UECFG5_EPDIR_OUT       (USBC_UECFG5_EPDIR_OUT_Val     << USBC_UECFG5_EPDIR_Pos)
#define USBC_UECFG5_EPDIR_IN        (USBC_UECFG5_EPDIR_IN_Val      << USBC_UECFG5_EPDIR_Pos)
#define USBC_UECFG5_EPTYPE_Pos      11           /**< \brief (USBC_UECFG5) Endpoint Type */
#define USBC_UECFG5_EPTYPE_Msk      (_U(0x3) << USBC_UECFG5_EPTYPE_Pos)
#define USBC_UECFG5_EPTYPE(value)   (USBC_UECFG5_EPTYPE_Msk & ((value) << USBC_UECFG5_EPTYPE_Pos))
#define   USBC_UECFG5_EPTYPE_CONTROL_Val  _U(0x0)   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPTYPE_ISOCHRONOUS_Val _U(0x1)   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPTYPE_BULK_Val     _U(0x2)   /**< \brief (USBC_UECFG5)  */
#define   USBC_UECFG5_EPTYPE_INTERRUPT_Val _U(0x3)   /**< \brief (USBC_UECFG5)  */
#define USBC_UECFG5_EPTYPE_CONTROL  (USBC_UECFG5_EPTYPE_CONTROL_Val << USBC_UECFG5_EPTYPE_Pos)
#define USBC_UECFG5_EPTYPE_ISOCHRONOUS (USBC_UECFG5_EPTYPE_ISOCHRONOUS_Val << USBC_UECFG5_EPTYPE_Pos)
#define USBC_UECFG5_EPTYPE_BULK     (USBC_UECFG5_EPTYPE_BULK_Val   << USBC_UECFG5_EPTYPE_Pos)
#define USBC_UECFG5_EPTYPE_INTERRUPT (USBC_UECFG5_EPTYPE_INTERRUPT_Val << USBC_UECFG5_EPTYPE_Pos)
#define USBC_UECFG5_REPNB_Pos       16           /**< \brief (USBC_UECFG5) Redirected Endpoint Number */
#define USBC_UECFG5_REPNB_Msk       (_U(0xF) << USBC_UECFG5_REPNB_Pos)
#define USBC_UECFG5_REPNB(value)    (USBC_UECFG5_REPNB_Msk & ((value) << USBC_UECFG5_REPNB_Pos))
#define USBC_UECFG5_MASK            _U(0x000F1974) /**< \brief (USBC_UECFG5) MASK Register */

/* -------- USBC_UECFG6 : (USBC Offset: 0x118) (R/W 32) Endpoint Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t EPBK:1;           /*!< bit:      2  Endpoint Bank                      */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t EPSIZE:3;         /*!< bit:  4.. 6  Endpoint Size                      */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t EPDIR:1;          /*!< bit:      8  Endpoint Direction                 */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t EPTYPE:2;         /*!< bit: 11..12  Endpoint Type                      */
    uint32_t :3;               /*!< bit: 13..15  Reserved                           */
    uint32_t REPNB:4;          /*!< bit: 16..19  Redirected Endpoint Number         */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECFG6_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

