frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UECFG6_OFFSET          0x118        /**< \brief (USBC_UECFG6 offset) Endpoint Configuration Register */
#define USBC_UECFG6_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UECFG6 reset_value) Endpoint Configuration Register */

#define USBC_UECFG6_EPBK_Pos        2            /**< \brief (USBC_UECFG6) Endpoint Bank */
#define USBC_UECFG6_EPBK            (_U(0x1) << USBC_UECFG6_EPBK_Pos)
#define   USBC_UECFG6_EPBK_SINGLE_Val     _U(0x0)   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPBK_DOUBLE_Val     _U(0x1)   /**< \brief (USBC_UECFG6)  */
#define USBC_UECFG6_EPBK_SINGLE     (USBC_UECFG6_EPBK_SINGLE_Val   << USBC_UECFG6_EPBK_Pos)
#define USBC_UECFG6_EPBK_DOUBLE     (USBC_UECFG6_EPBK_DOUBLE_Val   << USBC_UECFG6_EPBK_Pos)
#define USBC_UECFG6_EPSIZE_Pos      4            /**< \brief (USBC_UECFG6) Endpoint Size */
#define USBC_UECFG6_EPSIZE_Msk      (_U(0x7) << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE(value)   (USBC_UECFG6_EPSIZE_Msk & ((value) << USBC_UECFG6_EPSIZE_Pos))
#define   USBC_UECFG6_EPSIZE_8_Val        _U(0x0)   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPSIZE_16_Val       _U(0x1)   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPSIZE_32_Val       _U(0x2)   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPSIZE_64_Val       _U(0x3)   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPSIZE_128_Val      _U(0x4)   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPSIZE_256_Val      _U(0x5)   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPSIZE_512_Val      _U(0x6)   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPSIZE_1024_Val     _U(0x7)   /**< \brief (USBC_UECFG6)  */
#define USBC_UECFG6_EPSIZE_8        (USBC_UECFG6_EPSIZE_8_Val      << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE_16       (USBC_UECFG6_EPSIZE_16_Val     << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE_32       (USBC_UECFG6_EPSIZE_32_Val     << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE_64       (USBC_UECFG6_EPSIZE_64_Val     << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE_128      (USBC_UECFG6_EPSIZE_128_Val    << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE_256      (USBC_UECFG6_EPSIZE_256_Val    << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE_512      (USBC_UECFG6_EPSIZE_512_Val    << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPSIZE_1024     (USBC_UECFG6_EPSIZE_1024_Val   << USBC_UECFG6_EPSIZE_Pos)
#define USBC_UECFG6_EPDIR_Pos       8            /**< \brief (USBC_UECFG6) Endpoint Direction */
#define USBC_UECFG6_EPDIR           (_U(0x1) << USBC_UECFG6_EPDIR_Pos)
#define   USBC_UECFG6_EPDIR_OUT_Val       _U(0x0)   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPDIR_IN_Val        _U(0x1)   /**< \brief (USBC_UECFG6)  */
#define USBC_UECFG6_EPDIR_OUT       (USBC_UECFG6_EPDIR_OUT_Val     << USBC_UECFG6_EPDIR_Pos)
#define USBC_UECFG6_EPDIR_IN        (USBC_UECFG6_EPDIR_IN_Val      << USBC_UECFG6_EPDIR_Pos)
#define USBC_UECFG6_EPTYPE_Pos      11           /**< \brief (USBC_UECFG6) Endpoint Type */
#define USBC_UECFG6_EPTYPE_Msk      (_U(0x3) << USBC_UECFG6_EPTYPE_Pos)
#define USBC_UECFG6_EPTYPE(value)   (USBC_UECFG6_EPTYPE_Msk & ((value) << USBC_UECFG6_EPTYPE_Pos))
#define   USBC_UECFG6_EPTYPE_CONTROL_Val  _U(0x0)   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPTYPE_ISOCHRONOUS_Val _U(0x1)   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPTYPE_BULK_Val     _U(0x2)   /**< \brief (USBC_UECFG6)  */
#define   USBC_UECFG6_EPTYPE_INTERRUPT_Val _U(0x3)   /**< \brief (USBC_UECFG6)  */
#define USBC_UECFG6_EPTYPE_CONTROL  (USBC_UECFG6_EPTYPE_CONTROL_Val << USBC_UECFG6_EPTYPE_Pos)
#define USBC_UECFG6_EPTYPE_ISOCHRONOUS (USBC_UECFG6_EPTYPE_ISOCHRONOUS_Val << USBC_UECFG6_EPTYPE_Pos)
#define USBC_UECFG6_EPTYPE_BULK     (USBC_UECFG6_EPTYPE_BULK_Val   << USBC_UECFG6_EPTYPE_Pos)
#define USBC_UECFG6_EPTYPE_INTERRUPT (USBC_UECFG6_EPTYPE_INTERRUPT_Val << USBC_UECFG6_EPTYPE_Pos)
#define USBC_UECFG6_REPNB_Pos       16           /**< \brief (USBC_UECFG6) Redirected Endpoint Number */
#define USBC_UECFG6_REPNB_Msk       (_U(0xF) << USBC_UECFG6_REPNB_Pos)
#define USBC_UECFG6_REPNB(value)    (USBC_UECFG6_REPNB_Msk & ((value) << USBC_UECFG6_REPNB_Pos))
#define USBC_UECFG6_MASK            _U(0x000F1974) /**< \brief (USBC_UECFG6) MASK Register */

/* -------- USBC_UECFG7 : (USBC Offset: 0x11C) (R/W 32) Endpoint Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t EPBK:1;           /*!< bit:      2  Endpoint Bank                      */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t EPSIZE:3;         /*!< bit:  4.. 6  Endpoint Size                      */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t EPDIR:1;          /*!< bit:      8  Endpoint Direction                 */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t EPTYPE:2;         /*!< bit: 11..12  Endpoint Type                      */
    uint32_t :3;               /*!< bit: 13..15  Reserved                           */
    uint32_t REPNB:4;          /*!< bit: 16..19  Redirected Endpoint Number         */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECFG7_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECFG7_OFFSET          0x11C        /**< \brief (USBC_UECFG7 offset) Endpoint Configuration Register */
#define USBC_UECFG7_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UECFG7 reset_value) Endpoint Configuration Register */

#define USBC_UECFG7_EPBK_Pos        2            /**< \brief (USBC_UECFG7) Endpoint Bank */
#define USBC_UECFG7_EPBK            (_U(0x1) << USBC_UECFG7_EPBK_Pos)
#define   USBC_UECFG7_EPBK_SINGLE_Val     _U(0x0)   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPBK_DOUBLE_Val     _U(0x1)   /**< \brief (USBC_UECFG7)  */
#define USBC_UECFG7_EPBK_SINGLE     (USBC_UECFG7_EPBK_SINGLE_Val   << USBC_UECFG7_EPBK_Pos)
#define USBC_UECFG7_EPBK_DOUBLE     (USBC_UECFG7_EPBK_DOUBLE_Val   << USBC_UECFG7_EPBK_Pos)
#define USBC_UECFG7_EPSIZE_Pos      4            /**< \brief (USBC_UECFG7) Endpoint Size */
#define USBC_UECFG7_EPSIZE_Msk      (_U(0x7) << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE(value)   (USBC_UECFG7_EPSIZE_Msk & ((value) << USBC_UECFG7_EPSIZE_Pos))
#define   USBC_UECFG7_EPSIZE_8_Val        _U(0x0)   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPSIZE_16_Val       _U(0x1)   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPSIZE_32_Val       _U(0x2)   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPSIZE_64_Val       _U(0x3)   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPSIZE_128_Val      _U(0x4)   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPSIZE_256_Val      _U(0x5)   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPSIZE_512_Val      _U(0x6)   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPSIZE_1024_Val     _U(0x7)   /**< \brief (USBC_UECFG7)  */
#define USBC_UECFG7_EPSIZE_8        (USBC_UECFG7_EPSIZE_8_Val      << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE_16       (USBC_UECFG7_EPSIZE_16_Val     << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE_32       (USBC_UECFG7_EPSIZE_32_Val     << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE_64       (USBC_UECFG7_EPSIZE_64_Val     << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE_128      (USBC_UECFG7_EPSIZE_128_Val    << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE_256      (USBC_UECFG7_EPSIZE_256_Val    << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE_512      (USBC_UECFG7_EPSIZE_512_Val    << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPSIZE_1024     (USBC_UECFG7_EPSIZE_1024_Val   << USBC_UECFG7_EPSIZE_Pos)
#define USBC_UECFG7_EPDIR_Pos       8            /**< \brief (USBC_UECFG7) Endpoint Direction */
#define USBC_UECFG7_EPDIR           (_U(0x1) << USBC_UECFG7_EPDIR_Pos)
#define   USBC_UECFG7_EPDIR_OUT_Val       _U(0x0)   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPDIR_IN_Val        _U(0x1)   /**< \brief (USBC_UECFG7)  */
#define USBC_UECFG7_EPDIR_OUT       (USBC_UECFG7_EPDIR_OUT_Val     << USBC_UECFG7_EPDIR_Pos)
#define USBC_UECFG7_EPDIR_IN        (USBC_UECFG7_EPDIR_IN_Val      << USBC_UECFG7_EPDIR_Pos)
#define USBC_UECFG7_EPTYPE_Pos      11           /**< \brief (USBC_UECFG7) Endpoint Type */
#define USBC_UECFG7_EPTYPE_Msk      (_U(0x3) << USBC_UECFG7_EPTYPE_Pos)
#define USBC_UECFG7_EPTYPE(value)   (USBC_UECFG7_EPTYPE_Msk & ((value) << USBC_UECFG7_EPTYPE_Pos))
#define   USBC_UECFG7_EPTYPE_CONTROL_Val  _U(0x0)   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPTYPE_ISOCHRONOUS_Val _U(0x1)   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPTYPE_BULK_Val     _U(0x2)   /**< \brief (USBC_UECFG7)  */
#define   USBC_UECFG7_EPTYPE_INTERRUPT_Val _U(0x3)   /**< \brief (USBC_UECFG7)  */
#define USBC_UECFG7_EPTYPE_CONTROL  (USBC_UECFG7_EPTYPE_CONTROL_Val << USBC_UECFG7_EPTYPE_Pos)
#define USBC_UECFG7_EPTYPE_ISOCHRONOUS (USBC_UECFG7_EPTYPE_ISOCHRONOUS_Val << USBC_UECFG7_EPTYPE_Pos)
#define USBC_UECFG7_EPTYPE_BULK     (USBC_UECFG7_EPTYPE_BULK_Val   << USBC_UECFG7_EPTYPE_Pos)
#define USBC_UECFG7_EPTYPE_INTERRUPT (USBC_UECFG7_EPTYPE_INTERRUPT_Val << USBC_UECFG7_EPTYPE_Pos)
#define USBC_UECFG7_REPNB_Pos       16           /**< \brief (USBC_UECFG7) Redirected Endpoint Number */
#define USBC_UECFG7_REPNB_Msk       (_U(0xF) << USBC_UECFG7_REPNB_Pos)
#define USBC_UECFG7_REPNB(value)    (USBC_UECFG7_REPNB_Msk & ((value) << USBC_UECFG7_REPNB_Pos))
#define USBC_UECFG7_MASK            _U(0x000F1974) /**< \brief (USBC_UECFG7) MASK Register */

/* -------- USBC_UESTA0 : (USBC Offset: 0x130) (R/  32) Endpoint Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINI:1;          /*!< bit:      0  Transmitted IN Data Interrupt      */
    uint32_t RXOUTI:1;         /*!< bit:      1  Received OUT Data Interrupt        */
    uint32_t RXSTPI:1;         /*!< bit:      2  Received SETUP Interrupt           */
    uint32_t NAKOUTI:1;        /*!< bit:      3  NAKed OUT Interrupt                */
    uint32_t NAKINI:1;         /*!< bit:      4  NAKed IN Interrupt                 */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDI:1;       /*!< bit:      6  STALLed Interrupt                  */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t DTSEQ:2;          /*!< bit:  8.. 9  Data Toggle Sequence               */
    uint32_t :1;               /*!< bit:     10  Reserved                           */
    uint32_t RAMACERI:1;       /*!< bit:     11  Ram Access Error Interrupt         */
    uint32_t NBUSYBK:2;        /*!< bit: 12..13  Number Of Busy Banks               */
    uint32_t CURRBK:2;         /*!< bit: 14..15  Current Bank                       */
    uint32_t :1;               /*!< bit:     16  Reserved                           */
    uint32_t CTRLDIR:1;        /*!< bit:     17  Control Direction                  */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UESTA0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UESTA0_OFFSET          0x130        /**< \brief (USBC_UESTA0 offset) Endpoint Status Register */
#define USBC_UESTA0_RESETVALUE      _U(0x00000100); /**< \brief (USBC_UESTA0 reset_value) Endpoint Status Register */

#define USBC_UESTA0_TXINI_Pos       0            /**< \brief (USBC_UESTA0) Transmitted IN Data Interrupt */
#define USBC_UESTA0_TXINI           (_U(0x1) << USBC_UESTA0_TXINI_Pos)
#define USBC_UESTA0_RXOUTI_Pos      1            /**< \brief (USBC_UESTA0) Received OUT Data Interrupt */
#define USBC_UESTA0_RXOUTI          (_U(0x1) << USBC_UESTA0_RXOUTI_Pos)
#define USBC_UESTA0_RXSTPI_Pos      2            /**< \brief (USBC_UESTA0) Received SETUP Interrupt */
#define USBC_UESTA0_RXSTPI          (_U(0x1) << USBC_UESTA0_RXSTPI_Pos)
#define USBC_UESTA0_NAKOUTI_Pos     3            /**< \brief (USBC_UESTA0) NAKed OUT Interrupt */
#define USBC_UESTA0_NAKOUTI         (_U(0x1) << USBC_UESTA0_NAKOUTI_Pos)
#define USBC_UESTA0_NAKINI_Pos      4            /**< \brief (USBC_UESTA0) NAKed IN Interrupt */
#define USBC_UESTA0_NAKINI          (_U(0x1) << USBC_UESTA0_NAKINI_Pos)
#define USBC_UESTA0_STALLEDI_Pos    6            /**< \brief (USBC_UESTA0) STALLed Interrupt */
#define USBC_UESTA0_STALLEDI        (_U(0x1) << USBC_UESTA0_STALLEDI_Pos)
#define USBC_UESTA0_DTSEQ_Pos       8            /**< \brief (USBC_UESTA0) Data Toggle Sequence */
#define USBC_UESTA0_DTSEQ_Msk       (_U(0x3) << USBC_UESTA0_DTSEQ_Pos)
#define USBC_UESTA0_DTSEQ(value)    (USBC_UESTA0_DTSEQ_Msk & ((value) << USBC_UESTA0_DTSEQ_Pos))
#define USBC_UESTA0_RAMACERI_Pos    11           /**< \brief (USBC_UESTA0) Ram Access Error Interrupt */
#define USBC_UESTA0_RAMACERI        (_U(0x1) << USBC_UESTA0_RAMACERI_Pos)
#define USBC_UESTA0_NBUSYBK_Pos     12           /**< \brief (USBC_UESTA0) Number Of Busy Banks */
#define USBC_UESTA0_NBUSYBK_Msk     (_U(0x3) << USBC_UESTA0_NBUSYBK_Pos)
#define USBC_UESTA0_NBUSYBK(value)  (USBC_UESTA0_NBUSYBK_Msk & ((value) << USBC_UESTA0_NBUSYBK_Pos))
#define USBC_UESTA0_CURRBK_Pos      14           /**< \brief (USBC_UESTA0) Current Bank */
#define USBC_UESTA0_CURRBK_Msk      (_U(0x3) << USBC_UESTA0_CURRBK_Pos)
#define USBC_UESTA0_CURRBK(value)   (USBC_UESTA0_CURRBK_Msk & ((value) << USBC_UESTA0_CURRBK_Pos))
#define USBC_UESTA0_CTRLDIR_Pos     17           /**< \brief (USBC_UESTA0) Control Direction */
#define USBC_UESTA0_CTRLDIR         (_U(0x1) << USBC_UESTA0_CTRLDIR_Pos)
#define   USBC_UESTA0_CTRLDIR_OUT_Val     _U(0x0)   /**< \brief (USBC_UESTA0)  */
#define   USBC_UESTA0_CTRLDIR_IN_Val      _U(0x1)   /**< \brief (USBC_UESTA0)  */
#define USBC_UESTA0_CTRLDIR_OUT     (USBC_UESTA0_CTRLDIR_OUT_Val   << USBC_UESTA0_CTRLDIR_Pos)
#define USBC_UESTA0_CTRLDIR_IN      (USBC_UESTA0_CTRLDIR_IN_Val    << USBC_UESTA0_CTRLDIR_Pos)
#define USBC_UESTA0_MASK            _U(0x0002FB5F) /**< \brief (USBC_UESTA0) MASK Register */

