frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/* -------- USBC_UESTA1 : (USBC Offset: 0x134) (R/  32) Endpoint Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINI:1;          /*!< bit:      0  Transmitted IN Data Interrupt      */
    uint32_t RXOUTI:1;         /*!< bit:      1  Received OUT Data Interrupt        */
    uint32_t RXSTPI:1;         /*!< bit:      2  Received SETUP Interrupt           */
    uint32_t NAKOUTI:1;        /*!< bit:      3  NAKed OUT Interrupt                */
    uint32_t NAKINI:1;         /*!< bit:      4  NAKed IN Interrupt                 */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDI:1;       /*!< bit:      6  STALLed Interrupt                  */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t DTSEQ:2;          /*!< bit:  8.. 9  Data Toggle Sequence               */
    uint32_t :1;               /*!< bit:     10  Reserved                           */
    uint32_t RAMACERI:1;       /*!< bit:     11  Ram Access Error Interrupt         */
    uint32_t NBUSYBK:2;        /*!< bit: 12..13  Number Of Busy Banks               */
    uint32_t CURRBK:2;         /*!< bit: 14..15  Current Bank                       */
    uint32_t :1;               /*!< bit:     16  Reserved                           */
    uint32_t CTRLDIR:1;        /*!< bit:     17  Control Direction                  */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UESTA1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UESTA1_OFFSET          0x134        /**< \brief (USBC_UESTA1 offset) Endpoint Status Register */
#define USBC_UESTA1_RESETVALUE      _U(0x00000100); /**< \brief (USBC_UESTA1 reset_value) Endpoint Status Register */

#define USBC_UESTA1_TXINI_Pos       0            /**< \brief (USBC_UESTA1) Transmitted IN Data Interrupt */
#define USBC_UESTA1_TXINI           (_U(0x1) << USBC_UESTA1_TXINI_Pos)
#define USBC_UESTA1_RXOUTI_Pos      1            /**< \brief (USBC_UESTA1) Received OUT Data Interrupt */
#define USBC_UESTA1_RXOUTI          (_U(0x1) << USBC_UESTA1_RXOUTI_Pos)
#define USBC_UESTA1_RXSTPI_Pos      2            /**< \brief (USBC_UESTA1) Received SETUP Interrupt */
#define USBC_UESTA1_RXSTPI          (_U(0x1) << USBC_UESTA1_RXSTPI_Pos)
#define USBC_UESTA1_NAKOUTI_Pos     3            /**< \brief (USBC_UESTA1) NAKed OUT Interrupt */
#define USBC_UESTA1_NAKOUTI         (_U(0x1) << USBC_UESTA1_NAKOUTI_Pos)
#define USBC_UESTA1_NAKINI_Pos      4            /**< \brief (USBC_UESTA1) NAKed IN Interrupt */
#define USBC_UESTA1_NAKINI          (_U(0x1) << USBC_UESTA1_NAKINI_Pos)
#define USBC_UESTA1_STALLEDI_Pos    6            /**< \brief (USBC_UESTA1) STALLed Interrupt */
#define USBC_UESTA1_STALLEDI        (_U(0x1) << USBC_UESTA1_STALLEDI_Pos)
#define USBC_UESTA1_DTSEQ_Pos       8            /**< \brief (USBC_UESTA1) Data Toggle Sequence */
#define USBC_UESTA1_DTSEQ_Msk       (_U(0x3) << USBC_UESTA1_DTSEQ_Pos)
#define USBC_UESTA1_DTSEQ(value)    (USBC_UESTA1_DTSEQ_Msk & ((value) << USBC_UESTA1_DTSEQ_Pos))
#define USBC_UESTA1_RAMACERI_Pos    11           /**< \brief (USBC_UESTA1) Ram Access Error Interrupt */
#define USBC_UESTA1_RAMACERI        (_U(0x1) << USBC_UESTA1_RAMACERI_Pos)
#define USBC_UESTA1_NBUSYBK_Pos     12           /**< \brief (USBC_UESTA1) Number Of Busy Banks */
#define USBC_UESTA1_NBUSYBK_Msk     (_U(0x3) << USBC_UESTA1_NBUSYBK_Pos)
#define USBC_UESTA1_NBUSYBK(value)  (USBC_UESTA1_NBUSYBK_Msk & ((value) << USBC_UESTA1_NBUSYBK_Pos))
#define USBC_UESTA1_CURRBK_Pos      14           /**< \brief (USBC_UESTA1) Current Bank */
#define USBC_UESTA1_CURRBK_Msk      (_U(0x3) << USBC_UESTA1_CURRBK_Pos)
#define USBC_UESTA1_CURRBK(value)   (USBC_UESTA1_CURRBK_Msk & ((value) << USBC_UESTA1_CURRBK_Pos))
#define USBC_UESTA1_CTRLDIR_Pos     17           /**< \brief (USBC_UESTA1) Control Direction */
#define USBC_UESTA1_CTRLDIR         (_U(0x1) << USBC_UESTA1_CTRLDIR_Pos)
#define   USBC_UESTA1_CTRLDIR_OUT_Val     _U(0x0)   /**< \brief (USBC_UESTA1)  */
#define   USBC_UESTA1_CTRLDIR_IN_Val      _U(0x1)   /**< \brief (USBC_UESTA1)  */
#define USBC_UESTA1_CTRLDIR_OUT     (USBC_UESTA1_CTRLDIR_OUT_Val   << USBC_UESTA1_CTRLDIR_Pos)
#define USBC_UESTA1_CTRLDIR_IN      (USBC_UESTA1_CTRLDIR_IN_Val    << USBC_UESTA1_CTRLDIR_Pos)
#define USBC_UESTA1_MASK            _U(0x0002FB5F) /**< \brief (USBC_UESTA1) MASK Register */

/* -------- USBC_UESTA2 : (USBC Offset: 0x138) (R/  32) Endpoint Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINI:1;          /*!< bit:      0  Transmitted IN Data Interrupt      */
    uint32_t RXOUTI:1;         /*!< bit:      1  Received OUT Data Interrupt        */
    uint32_t RXSTPI:1;         /*!< bit:      2  Received SETUP Interrupt           */
    uint32_t NAKOUTI:1;        /*!< bit:      3  NAKed OUT Interrupt                */
    uint32_t NAKINI:1;         /*!< bit:      4  NAKed IN Interrupt                 */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDI:1;       /*!< bit:      6  STALLed Interrupt                  */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t DTSEQ:2;          /*!< bit:  8.. 9  Data Toggle Sequence               */
    uint32_t :1;               /*!< bit:     10  Reserved                           */
    uint32_t RAMACERI:1;       /*!< bit:     11  Ram Access Error Interrupt         */
    uint32_t NBUSYBK:2;        /*!< bit: 12..13  Number Of Busy Banks               */
    uint32_t CURRBK:2;         /*!< bit: 14..15  Current Bank                       */
    uint32_t :1;               /*!< bit:     16  Reserved                           */
    uint32_t CTRLDIR:1;        /*!< bit:     17  Control Direction                  */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UESTA2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UESTA2_OFFSET          0x138        /**< \brief (USBC_UESTA2 offset) Endpoint Status Register */
#define USBC_UESTA2_RESETVALUE      _U(0x00000100); /**< \brief (USBC_UESTA2 reset_value) Endpoint Status Register */

