frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UESTA2_TXINI_Pos       0            /**< \brief (USBC_UESTA2) Transmitted IN Data Interrupt */
#define USBC_UESTA2_TXINI           (_U(0x1) << USBC_UESTA2_TXINI_Pos)
#define USBC_UESTA2_RXOUTI_Pos      1            /**< \brief (USBC_UESTA2) Received OUT Data Interrupt */
#define USBC_UESTA2_RXOUTI          (_U(0x1) << USBC_UESTA2_RXOUTI_Pos)
#define USBC_UESTA2_RXSTPI_Pos      2            /**< \brief (USBC_UESTA2) Received SETUP Interrupt */
#define USBC_UESTA2_RXSTPI          (_U(0x1) << USBC_UESTA2_RXSTPI_Pos)
#define USBC_UESTA2_NAKOUTI_Pos     3            /**< \brief (USBC_UESTA2) NAKed OUT Interrupt */
#define USBC_UESTA2_NAKOUTI         (_U(0x1) << USBC_UESTA2_NAKOUTI_Pos)
#define USBC_UESTA2_NAKINI_Pos      4            /**< \brief (USBC_UESTA2) NAKed IN Interrupt */
#define USBC_UESTA2_NAKINI          (_U(0x1) << USBC_UESTA2_NAKINI_Pos)
#define USBC_UESTA2_STALLEDI_Pos    6            /**< \brief (USBC_UESTA2) STALLed Interrupt */
#define USBC_UESTA2_STALLEDI        (_U(0x1) << USBC_UESTA2_STALLEDI_Pos)
#define USBC_UESTA2_DTSEQ_Pos       8            /**< \brief (USBC_UESTA2) Data Toggle Sequence */
#define USBC_UESTA2_DTSEQ_Msk       (_U(0x3) << USBC_UESTA2_DTSEQ_Pos)
#define USBC_UESTA2_DTSEQ(value)    (USBC_UESTA2_DTSEQ_Msk & ((value) << USBC_UESTA2_DTSEQ_Pos))
#define USBC_UESTA2_RAMACERI_Pos    11           /**< \brief (USBC_UESTA2) Ram Access Error Interrupt */
#define USBC_UESTA2_RAMACERI        (_U(0x1) << USBC_UESTA2_RAMACERI_Pos)
#define USBC_UESTA2_NBUSYBK_Pos     12           /**< \brief (USBC_UESTA2) Number Of Busy Banks */
#define USBC_UESTA2_NBUSYBK_Msk     (_U(0x3) << USBC_UESTA2_NBUSYBK_Pos)
#define USBC_UESTA2_NBUSYBK(value)  (USBC_UESTA2_NBUSYBK_Msk & ((value) << USBC_UESTA2_NBUSYBK_Pos))
#define USBC_UESTA2_CURRBK_Pos      14           /**< \brief (USBC_UESTA2) Current Bank */
#define USBC_UESTA2_CURRBK_Msk      (_U(0x3) << USBC_UESTA2_CURRBK_Pos)
#define USBC_UESTA2_CURRBK(value)   (USBC_UESTA2_CURRBK_Msk & ((value) << USBC_UESTA2_CURRBK_Pos))
#define USBC_UESTA2_CTRLDIR_Pos     17           /**< \brief (USBC_UESTA2) Control Direction */
#define USBC_UESTA2_CTRLDIR         (_U(0x1) << USBC_UESTA2_CTRLDIR_Pos)
#define   USBC_UESTA2_CTRLDIR_OUT_Val     _U(0x0)   /**< \brief (USBC_UESTA2)  */
#define   USBC_UESTA2_CTRLDIR_IN_Val      _U(0x1)   /**< \brief (USBC_UESTA2)  */
#define USBC_UESTA2_CTRLDIR_OUT     (USBC_UESTA2_CTRLDIR_OUT_Val   << USBC_UESTA2_CTRLDIR_Pos)
#define USBC_UESTA2_CTRLDIR_IN      (USBC_UESTA2_CTRLDIR_IN_Val    << USBC_UESTA2_CTRLDIR_Pos)
#define USBC_UESTA2_MASK            _U(0x0002FB5F) /**< \brief (USBC_UESTA2) MASK Register */

/* -------- USBC_UESTA3 : (USBC Offset: 0x13C) (R/  32) Endpoint Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINI:1;          /*!< bit:      0  Transmitted IN Data Interrupt      */
    uint32_t RXOUTI:1;         /*!< bit:      1  Received OUT Data Interrupt        */
    uint32_t RXSTPI:1;         /*!< bit:      2  Received SETUP Interrupt           */
    uint32_t NAKOUTI:1;        /*!< bit:      3  NAKed OUT Interrupt                */
    uint32_t NAKINI:1;         /*!< bit:      4  NAKed IN Interrupt                 */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDI:1;       /*!< bit:      6  STALLed Interrupt                  */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t DTSEQ:2;          /*!< bit:  8.. 9  Data Toggle Sequence               */
    uint32_t :1;               /*!< bit:     10  Reserved                           */
    uint32_t RAMACERI:1;       /*!< bit:     11  Ram Access Error Interrupt         */
    uint32_t NBUSYBK:2;        /*!< bit: 12..13  Number Of Busy Banks               */
    uint32_t CURRBK:2;         /*!< bit: 14..15  Current Bank                       */
    uint32_t :1;               /*!< bit:     16  Reserved                           */
    uint32_t CTRLDIR:1;        /*!< bit:     17  Control Direction                  */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UESTA3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UESTA3_OFFSET          0x13C        /**< \brief (USBC_UESTA3 offset) Endpoint Status Register */
#define USBC_UESTA3_RESETVALUE      _U(0x00000100); /**< \brief (USBC_UESTA3 reset_value) Endpoint Status Register */

#define USBC_UESTA3_TXINI_Pos       0            /**< \brief (USBC_UESTA3) Transmitted IN Data Interrupt */
#define USBC_UESTA3_TXINI           (_U(0x1) << USBC_UESTA3_TXINI_Pos)
#define USBC_UESTA3_RXOUTI_Pos      1            /**< \brief (USBC_UESTA3) Received OUT Data Interrupt */
#define USBC_UESTA3_RXOUTI          (_U(0x1) << USBC_UESTA3_RXOUTI_Pos)
#define USBC_UESTA3_RXSTPI_Pos      2            /**< \brief (USBC_UESTA3) Received SETUP Interrupt */
#define USBC_UESTA3_RXSTPI          (_U(0x1) << USBC_UESTA3_RXSTPI_Pos)
#define USBC_UESTA3_NAKOUTI_Pos     3            /**< \brief (USBC_UESTA3) NAKed OUT Interrupt */
#define USBC_UESTA3_NAKOUTI         (_U(0x1) << USBC_UESTA3_NAKOUTI_Pos)
#define USBC_UESTA3_NAKINI_Pos      4            /**< \brief (USBC_UESTA3) NAKed IN Interrupt */
#define USBC_UESTA3_NAKINI          (_U(0x1) << USBC_UESTA3_NAKINI_Pos)
#define USBC_UESTA3_STALLEDI_Pos    6            /**< \brief (USBC_UESTA3) STALLed Interrupt */
#define USBC_UESTA3_STALLEDI        (_U(0x1) << USBC_UESTA3_STALLEDI_Pos)
#define USBC_UESTA3_DTSEQ_Pos       8            /**< \brief (USBC_UESTA3) Data Toggle Sequence */
#define USBC_UESTA3_DTSEQ_Msk       (_U(0x3) << USBC_UESTA3_DTSEQ_Pos)
#define USBC_UESTA3_DTSEQ(value)    (USBC_UESTA3_DTSEQ_Msk & ((value) << USBC_UESTA3_DTSEQ_Pos))
#define USBC_UESTA3_RAMACERI_Pos    11           /**< \brief (USBC_UESTA3) Ram Access Error Interrupt */
#define USBC_UESTA3_RAMACERI        (_U(0x1) << USBC_UESTA3_RAMACERI_Pos)
#define USBC_UESTA3_NBUSYBK_Pos     12           /**< \brief (USBC_UESTA3) Number Of Busy Banks */
#define USBC_UESTA3_NBUSYBK_Msk     (_U(0x3) << USBC_UESTA3_NBUSYBK_Pos)
#define USBC_UESTA3_NBUSYBK(value)  (USBC_UESTA3_NBUSYBK_Msk & ((value) << USBC_UESTA3_NBUSYBK_Pos))
#define USBC_UESTA3_CURRBK_Pos      14           /**< \brief (USBC_UESTA3) Current Bank */
#define USBC_UESTA3_CURRBK_Msk      (_U(0x3) << USBC_UESTA3_CURRBK_Pos)
#define USBC_UESTA3_CURRBK(value)   (USBC_UESTA3_CURRBK_Msk & ((value) << USBC_UESTA3_CURRBK_Pos))
#define USBC_UESTA3_CTRLDIR_Pos     17           /**< \brief (USBC_UESTA3) Control Direction */
#define USBC_UESTA3_CTRLDIR         (_U(0x1) << USBC_UESTA3_CTRLDIR_Pos)
#define   USBC_UESTA3_CTRLDIR_OUT_Val     _U(0x0)   /**< \brief (USBC_UESTA3)  */
#define   USBC_UESTA3_CTRLDIR_IN_Val      _U(0x1)   /**< \brief (USBC_UESTA3)  */
#define USBC_UESTA3_CTRLDIR_OUT     (USBC_UESTA3_CTRLDIR_OUT_Val   << USBC_UESTA3_CTRLDIR_Pos)
#define USBC_UESTA3_CTRLDIR_IN      (USBC_UESTA3_CTRLDIR_IN_Val    << USBC_UESTA3_CTRLDIR_Pos)
#define USBC_UESTA3_MASK            _U(0x0002FB5F) /**< \brief (USBC_UESTA3) MASK Register */

/* -------- USBC_UESTA4 : (USBC Offset: 0x140) (R/  32) Endpoint Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINI:1;          /*!< bit:      0  Transmitted IN Data Interrupt      */
    uint32_t RXOUTI:1;         /*!< bit:      1  Received OUT Data Interrupt        */
    uint32_t RXSTPI:1;         /*!< bit:      2  Received SETUP Interrupt           */
    uint32_t NAKOUTI:1;        /*!< bit:      3  NAKed OUT Interrupt                */
    uint32_t NAKINI:1;         /*!< bit:      4  NAKed IN Interrupt                 */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDI:1;       /*!< bit:      6  STALLed Interrupt                  */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t DTSEQ:2;          /*!< bit:  8.. 9  Data Toggle Sequence               */
    uint32_t :1;               /*!< bit:     10  Reserved                           */
    uint32_t RAMACERI:1;       /*!< bit:     11  Ram Access Error Interrupt         */
    uint32_t NBUSYBK:2;        /*!< bit: 12..13  Number Of Busy Banks               */
    uint32_t CURRBK:2;         /*!< bit: 14..15  Current Bank                       */
    uint32_t :1;               /*!< bit:     16  Reserved                           */
    uint32_t CTRLDIR:1;        /*!< bit:     17  Control Direction                  */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UESTA4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

