frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UESTA4_OFFSET          0x140        /**< \brief (USBC_UESTA4 offset) Endpoint Status Register */
#define USBC_UESTA4_RESETVALUE      _U(0x00000100); /**< \brief (USBC_UESTA4 reset_value) Endpoint Status Register */

#define USBC_UESTA4_TXINI_Pos       0            /**< \brief (USBC_UESTA4) Transmitted IN Data Interrupt */
#define USBC_UESTA4_TXINI           (_U(0x1) << USBC_UESTA4_TXINI_Pos)
#define USBC_UESTA4_RXOUTI_Pos      1            /**< \brief (USBC_UESTA4) Received OUT Data Interrupt */
#define USBC_UESTA4_RXOUTI          (_U(0x1) << USBC_UESTA4_RXOUTI_Pos)
#define USBC_UESTA4_RXSTPI_Pos      2            /**< \brief (USBC_UESTA4) Received SETUP Interrupt */
#define USBC_UESTA4_RXSTPI          (_U(0x1) << USBC_UESTA4_RXSTPI_Pos)
#define USBC_UESTA4_NAKOUTI_Pos     3            /**< \brief (USBC_UESTA4) NAKed OUT Interrupt */
#define USBC_UESTA4_NAKOUTI         (_U(0x1) << USBC_UESTA4_NAKOUTI_Pos)
#define USBC_UESTA4_NAKINI_Pos      4            /**< \brief (USBC_UESTA4) NAKed IN Interrupt */
#define USBC_UESTA4_NAKINI          (_U(0x1) << USBC_UESTA4_NAKINI_Pos)
#define USBC_UESTA4_STALLEDI_Pos    6            /**< \brief (USBC_UESTA4) STALLed Interrupt */
#define USBC_UESTA4_STALLEDI        (_U(0x1) << USBC_UESTA4_STALLEDI_Pos)
#define USBC_UESTA4_DTSEQ_Pos       8            /**< \brief (USBC_UESTA4) Data Toggle Sequence */
#define USBC_UESTA4_DTSEQ_Msk       (_U(0x3) << USBC_UESTA4_DTSEQ_Pos)
#define USBC_UESTA4_DTSEQ(value)    (USBC_UESTA4_DTSEQ_Msk & ((value) << USBC_UESTA4_DTSEQ_Pos))
#define USBC_UESTA4_RAMACERI_Pos    11           /**< \brief (USBC_UESTA4) Ram Access Error Interrupt */
#define USBC_UESTA4_RAMACERI        (_U(0x1) << USBC_UESTA4_RAMACERI_Pos)
#define USBC_UESTA4_NBUSYBK_Pos     12           /**< \brief (USBC_UESTA4) Number Of Busy Banks */
#define USBC_UESTA4_NBUSYBK_Msk     (_U(0x3) << USBC_UESTA4_NBUSYBK_Pos)
#define USBC_UESTA4_NBUSYBK(value)  (USBC_UESTA4_NBUSYBK_Msk & ((value) << USBC_UESTA4_NBUSYBK_Pos))
#define USBC_UESTA4_CURRBK_Pos      14           /**< \brief (USBC_UESTA4) Current Bank */
#define USBC_UESTA4_CURRBK_Msk      (_U(0x3) << USBC_UESTA4_CURRBK_Pos)
#define USBC_UESTA4_CURRBK(value)   (USBC_UESTA4_CURRBK_Msk & ((value) << USBC_UESTA4_CURRBK_Pos))
#define USBC_UESTA4_CTRLDIR_Pos     17           /**< \brief (USBC_UESTA4) Control Direction */
#define USBC_UESTA4_CTRLDIR         (_U(0x1) << USBC_UESTA4_CTRLDIR_Pos)
#define   USBC_UESTA4_CTRLDIR_OUT_Val     _U(0x0)   /**< \brief (USBC_UESTA4)  */
#define   USBC_UESTA4_CTRLDIR_IN_Val      _U(0x1)   /**< \brief (USBC_UESTA4)  */
#define USBC_UESTA4_CTRLDIR_OUT     (USBC_UESTA4_CTRLDIR_OUT_Val   << USBC_UESTA4_CTRLDIR_Pos)
#define USBC_UESTA4_CTRLDIR_IN      (USBC_UESTA4_CTRLDIR_IN_Val    << USBC_UESTA4_CTRLDIR_Pos)
#define USBC_UESTA4_MASK            _U(0x0002FB5F) /**< \brief (USBC_UESTA4) MASK Register */

/* -------- USBC_UESTA5 : (USBC Offset: 0x144) (R/  32) Endpoint Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINI:1;          /*!< bit:      0  Transmitted IN Data Interrupt      */
    uint32_t RXOUTI:1;         /*!< bit:      1  Received OUT Data Interrupt        */
    uint32_t RXSTPI:1;         /*!< bit:      2  Received SETUP Interrupt           */
    uint32_t NAKOUTI:1;        /*!< bit:      3  NAKed OUT Interrupt                */
    uint32_t NAKINI:1;         /*!< bit:      4  NAKed IN Interrupt                 */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDI:1;       /*!< bit:      6  STALLed Interrupt                  */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t DTSEQ:2;          /*!< bit:  8.. 9  Data Toggle Sequence               */
    uint32_t :1;               /*!< bit:     10  Reserved                           */
    uint32_t RAMACERI:1;       /*!< bit:     11  Ram Access Error Interrupt         */
    uint32_t NBUSYBK:2;        /*!< bit: 12..13  Number Of Busy Banks               */
    uint32_t CURRBK:2;         /*!< bit: 14..15  Current Bank                       */
    uint32_t :1;               /*!< bit:     16  Reserved                           */
    uint32_t CTRLDIR:1;        /*!< bit:     17  Control Direction                  */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UESTA5_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UESTA5_OFFSET          0x144        /**< \brief (USBC_UESTA5 offset) Endpoint Status Register */
#define USBC_UESTA5_RESETVALUE      _U(0x00000100); /**< \brief (USBC_UESTA5 reset_value) Endpoint Status Register */

#define USBC_UESTA5_TXINI_Pos       0            /**< \brief (USBC_UESTA5) Transmitted IN Data Interrupt */
#define USBC_UESTA5_TXINI           (_U(0x1) << USBC_UESTA5_TXINI_Pos)
#define USBC_UESTA5_RXOUTI_Pos      1            /**< \brief (USBC_UESTA5) Received OUT Data Interrupt */
#define USBC_UESTA5_RXOUTI          (_U(0x1) << USBC_UESTA5_RXOUTI_Pos)
#define USBC_UESTA5_RXSTPI_Pos      2            /**< \brief (USBC_UESTA5) Received SETUP Interrupt */
#define USBC_UESTA5_RXSTPI          (_U(0x1) << USBC_UESTA5_RXSTPI_Pos)
#define USBC_UESTA5_NAKOUTI_Pos     3            /**< \brief (USBC_UESTA5) NAKed OUT Interrupt */
#define USBC_UESTA5_NAKOUTI         (_U(0x1) << USBC_UESTA5_NAKOUTI_Pos)
#define USBC_UESTA5_NAKINI_Pos      4            /**< \brief (USBC_UESTA5) NAKed IN Interrupt */
#define USBC_UESTA5_NAKINI          (_U(0x1) << USBC_UESTA5_NAKINI_Pos)
#define USBC_UESTA5_STALLEDI_Pos    6            /**< \brief (USBC_UESTA5) STALLed Interrupt */
#define USBC_UESTA5_STALLEDI        (_U(0x1) << USBC_UESTA5_STALLEDI_Pos)
#define USBC_UESTA5_DTSEQ_Pos       8            /**< \brief (USBC_UESTA5) Data Toggle Sequence */
#define USBC_UESTA5_DTSEQ_Msk       (_U(0x3) << USBC_UESTA5_DTSEQ_Pos)
#define USBC_UESTA5_DTSEQ(value)    (USBC_UESTA5_DTSEQ_Msk & ((value) << USBC_UESTA5_DTSEQ_Pos))
#define USBC_UESTA5_RAMACERI_Pos    11           /**< \brief (USBC_UESTA5) Ram Access Error Interrupt */
#define USBC_UESTA5_RAMACERI        (_U(0x1) << USBC_UESTA5_RAMACERI_Pos)
#define USBC_UESTA5_NBUSYBK_Pos     12           /**< \brief (USBC_UESTA5) Number Of Busy Banks */
#define USBC_UESTA5_NBUSYBK_Msk     (_U(0x3) << USBC_UESTA5_NBUSYBK_Pos)
#define USBC_UESTA5_NBUSYBK(value)  (USBC_UESTA5_NBUSYBK_Msk & ((value) << USBC_UESTA5_NBUSYBK_Pos))
#define USBC_UESTA5_CURRBK_Pos      14           /**< \brief (USBC_UESTA5) Current Bank */
#define USBC_UESTA5_CURRBK_Msk      (_U(0x3) << USBC_UESTA5_CURRBK_Pos)
#define USBC_UESTA5_CURRBK(value)   (USBC_UESTA5_CURRBK_Msk & ((value) << USBC_UESTA5_CURRBK_Pos))
#define USBC_UESTA5_CTRLDIR_Pos     17           /**< \brief (USBC_UESTA5) Control Direction */
#define USBC_UESTA5_CTRLDIR         (_U(0x1) << USBC_UESTA5_CTRLDIR_Pos)
#define   USBC_UESTA5_CTRLDIR_OUT_Val     _U(0x0)   /**< \brief (USBC_UESTA5)  */
#define   USBC_UESTA5_CTRLDIR_IN_Val      _U(0x1)   /**< \brief (USBC_UESTA5)  */
#define USBC_UESTA5_CTRLDIR_OUT     (USBC_UESTA5_CTRLDIR_OUT_Val   << USBC_UESTA5_CTRLDIR_Pos)
#define USBC_UESTA5_CTRLDIR_IN      (USBC_UESTA5_CTRLDIR_IN_Val    << USBC_UESTA5_CTRLDIR_Pos)
#define USBC_UESTA5_MASK            _U(0x0002FB5F) /**< \brief (USBC_UESTA5) MASK Register */

/* -------- USBC_UESTA6 : (USBC Offset: 0x148) (R/  32) Endpoint Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINI:1;          /*!< bit:      0  Transmitted IN Data Interrupt      */
    uint32_t RXOUTI:1;         /*!< bit:      1  Received OUT Data Interrupt        */
    uint32_t RXSTPI:1;         /*!< bit:      2  Received SETUP Interrupt           */
    uint32_t NAKOUTI:1;        /*!< bit:      3  NAKed OUT Interrupt                */
    uint32_t NAKINI:1;         /*!< bit:      4  NAKed IN Interrupt                 */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDI:1;       /*!< bit:      6  STALLed Interrupt                  */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t DTSEQ:2;          /*!< bit:  8.. 9  Data Toggle Sequence               */
    uint32_t :1;               /*!< bit:     10  Reserved                           */
    uint32_t RAMACERI:1;       /*!< bit:     11  Ram Access Error Interrupt         */
    uint32_t NBUSYBK:2;        /*!< bit: 12..13  Number Of Busy Banks               */
    uint32_t CURRBK:2;         /*!< bit: 14..15  Current Bank                       */
    uint32_t :1;               /*!< bit:     16  Reserved                           */
    uint32_t CTRLDIR:1;        /*!< bit:     17  Control Direction                  */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UESTA6_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UESTA6_OFFSET          0x148        /**< \brief (USBC_UESTA6 offset) Endpoint Status Register */
#define USBC_UESTA6_RESETVALUE      _U(0x00000100); /**< \brief (USBC_UESTA6 reset_value) Endpoint Status Register */

#define USBC_UESTA6_TXINI_Pos       0            /**< \brief (USBC_UESTA6) Transmitted IN Data Interrupt */
#define USBC_UESTA6_TXINI           (_U(0x1) << USBC_UESTA6_TXINI_Pos)
#define USBC_UESTA6_RXOUTI_Pos      1            /**< \brief (USBC_UESTA6) Received OUT Data Interrupt */
#define USBC_UESTA6_RXOUTI          (_U(0x1) << USBC_UESTA6_RXOUTI_Pos)
#define USBC_UESTA6_RXSTPI_Pos      2            /**< \brief (USBC_UESTA6) Received SETUP Interrupt */
#define USBC_UESTA6_RXSTPI          (_U(0x1) << USBC_UESTA6_RXSTPI_Pos)
#define USBC_UESTA6_NAKOUTI_Pos     3            /**< \brief (USBC_UESTA6) NAKed OUT Interrupt */
#define USBC_UESTA6_NAKOUTI         (_U(0x1) << USBC_UESTA6_NAKOUTI_Pos)
#define USBC_UESTA6_NAKINI_Pos      4            /**< \brief (USBC_UESTA6) NAKed IN Interrupt */
#define USBC_UESTA6_NAKINI          (_U(0x1) << USBC_UESTA6_NAKINI_Pos)
#define USBC_UESTA6_STALLEDI_Pos    6            /**< \brief (USBC_UESTA6) STALLed Interrupt */
#define USBC_UESTA6_STALLEDI        (_U(0x1) << USBC_UESTA6_STALLEDI_Pos)
#define USBC_UESTA6_DTSEQ_Pos       8            /**< \brief (USBC_UESTA6) Data Toggle Sequence */
#define USBC_UESTA6_DTSEQ_Msk       (_U(0x3) << USBC_UESTA6_DTSEQ_Pos)
#define USBC_UESTA6_DTSEQ(value)    (USBC_UESTA6_DTSEQ_Msk & ((value) << USBC_UESTA6_DTSEQ_Pos))
#define USBC_UESTA6_RAMACERI_Pos    11           /**< \brief (USBC_UESTA6) Ram Access Error Interrupt */
#define USBC_UESTA6_RAMACERI        (_U(0x1) << USBC_UESTA6_RAMACERI_Pos)
#define USBC_UESTA6_NBUSYBK_Pos     12           /**< \brief (USBC_UESTA6) Number Of Busy Banks */
#define USBC_UESTA6_NBUSYBK_Msk     (_U(0x3) << USBC_UESTA6_NBUSYBK_Pos)
#define USBC_UESTA6_NBUSYBK(value)  (USBC_UESTA6_NBUSYBK_Msk & ((value) << USBC_UESTA6_NBUSYBK_Pos))
#define USBC_UESTA6_CURRBK_Pos      14           /**< \brief (USBC_UESTA6) Current Bank */
#define USBC_UESTA6_CURRBK_Msk      (_U(0x3) << USBC_UESTA6_CURRBK_Pos)
#define USBC_UESTA6_CURRBK(value)   (USBC_UESTA6_CURRBK_Msk & ((value) << USBC_UESTA6_CURRBK_Pos))
#define USBC_UESTA6_CTRLDIR_Pos     17           /**< \brief (USBC_UESTA6) Control Direction */
#define USBC_UESTA6_CTRLDIR         (_U(0x1) << USBC_UESTA6_CTRLDIR_Pos)
#define   USBC_UESTA6_CTRLDIR_OUT_Val     _U(0x0)   /**< \brief (USBC_UESTA6)  */
#define   USBC_UESTA6_CTRLDIR_IN_Val      _U(0x1)   /**< \brief (USBC_UESTA6)  */
#define USBC_UESTA6_CTRLDIR_OUT     (USBC_UESTA6_CTRLDIR_OUT_Val   << USBC_UESTA6_CTRLDIR_Pos)
#define USBC_UESTA6_CTRLDIR_IN      (USBC_UESTA6_CTRLDIR_IN_Val    << USBC_UESTA6_CTRLDIR_Pos)
#define USBC_UESTA6_MASK            _U(0x0002FB5F) /**< \brief (USBC_UESTA6) MASK Register */

/* -------- USBC_UESTA7 : (USBC Offset: 0x14C) (R/  32) Endpoint Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINI:1;          /*!< bit:      0  Transmitted IN Data Interrupt      */
    uint32_t RXOUTI:1;         /*!< bit:      1  Received OUT Data Interrupt        */
    uint32_t RXSTPI:1;         /*!< bit:      2  Received SETUP Interrupt           */
    uint32_t NAKOUTI:1;        /*!< bit:      3  NAKed OUT Interrupt                */
    uint32_t NAKINI:1;         /*!< bit:      4  NAKed IN Interrupt                 */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDI:1;       /*!< bit:      6  STALLed Interrupt                  */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t DTSEQ:2;          /*!< bit:  8.. 9  Data Toggle Sequence               */
    uint32_t :1;               /*!< bit:     10  Reserved                           */
    uint32_t RAMACERI:1;       /*!< bit:     11  Ram Access Error Interrupt         */
    uint32_t NBUSYBK:2;        /*!< bit: 12..13  Number Of Busy Banks               */
    uint32_t CURRBK:2;         /*!< bit: 14..15  Current Bank                       */
    uint32_t :1;               /*!< bit:     16  Reserved                           */
    uint32_t CTRLDIR:1;        /*!< bit:     17  Control Direction                  */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UESTA7_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

