frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/* -------- USBC_UESTA5CLR : (USBC Offset: 0x174) ( /W 32) Endpoint Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINIC:1;         /*!< bit:      0  TXINI Clear                        */
    uint32_t RXOUTIC:1;        /*!< bit:      1  RXOUTI Clear                       */
    uint32_t RXSTPIC:1;        /*!< bit:      2  RXSTPI Clear                       */
    uint32_t NAKOUTIC:1;       /*!< bit:      3  NAKOUTI Clear                      */
    uint32_t NAKINIC:1;        /*!< bit:      4  NAKINI Clear                       */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDIC:1;      /*!< bit:      6  STALLEDI Clear                     */
    uint32_t :4;               /*!< bit:  7..10  Reserved                           */
    uint32_t RAMACERIC:1;      /*!< bit:     11  RAMACERI Clear                     */
    uint32_t :20;              /*!< bit: 12..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UESTA5CLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UESTA5CLR_OFFSET       0x174        /**< \brief (USBC_UESTA5CLR offset) Endpoint Status Clear Register */
#define USBC_UESTA5CLR_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UESTA5CLR reset_value) Endpoint Status Clear Register */

#define USBC_UESTA5CLR_TXINIC_Pos   0            /**< \brief (USBC_UESTA5CLR) TXINI Clear */
#define USBC_UESTA5CLR_TXINIC       (_U(0x1) << USBC_UESTA5CLR_TXINIC_Pos)
#define USBC_UESTA5CLR_RXOUTIC_Pos  1            /**< \brief (USBC_UESTA5CLR) RXOUTI Clear */
#define USBC_UESTA5CLR_RXOUTIC      (_U(0x1) << USBC_UESTA5CLR_RXOUTIC_Pos)
#define USBC_UESTA5CLR_RXSTPIC_Pos  2            /**< \brief (USBC_UESTA5CLR) RXSTPI Clear */
#define USBC_UESTA5CLR_RXSTPIC      (_U(0x1) << USBC_UESTA5CLR_RXSTPIC_Pos)
#define USBC_UESTA5CLR_NAKOUTIC_Pos 3            /**< \brief (USBC_UESTA5CLR) NAKOUTI Clear */
#define USBC_UESTA5CLR_NAKOUTIC     (_U(0x1) << USBC_UESTA5CLR_NAKOUTIC_Pos)
#define USBC_UESTA5CLR_NAKINIC_Pos  4            /**< \brief (USBC_UESTA5CLR) NAKINI Clear */
#define USBC_UESTA5CLR_NAKINIC      (_U(0x1) << USBC_UESTA5CLR_NAKINIC_Pos)
#define USBC_UESTA5CLR_STALLEDIC_Pos 6            /**< \brief (USBC_UESTA5CLR) STALLEDI Clear */
#define USBC_UESTA5CLR_STALLEDIC    (_U(0x1) << USBC_UESTA5CLR_STALLEDIC_Pos)
#define USBC_UESTA5CLR_RAMACERIC_Pos 11           /**< \brief (USBC_UESTA5CLR) RAMACERI Clear */
#define USBC_UESTA5CLR_RAMACERIC    (_U(0x1) << USBC_UESTA5CLR_RAMACERIC_Pos)
#define USBC_UESTA5CLR_MASK         _U(0x0000085F) /**< \brief (USBC_UESTA5CLR) MASK Register */

/* -------- USBC_UESTA6CLR : (USBC Offset: 0x178) ( /W 32) Endpoint Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINIC:1;         /*!< bit:      0  TXINI Clear                        */
    uint32_t RXOUTIC:1;        /*!< bit:      1  RXOUTI Clear                       */
    uint32_t RXSTPIC:1;        /*!< bit:      2  RXSTPI Clear                       */
    uint32_t NAKOUTIC:1;       /*!< bit:      3  NAKOUTI Clear                      */
    uint32_t NAKINIC:1;        /*!< bit:      4  NAKINI Clear                       */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDIC:1;      /*!< bit:      6  STALLEDI Clear                     */
    uint32_t :4;               /*!< bit:  7..10  Reserved                           */
    uint32_t RAMACERIC:1;      /*!< bit:     11  RAMACERI Clear                     */
    uint32_t :20;              /*!< bit: 12..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UESTA6CLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UESTA6CLR_OFFSET       0x178        /**< \brief (USBC_UESTA6CLR offset) Endpoint Status Clear Register */
#define USBC_UESTA6CLR_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UESTA6CLR reset_value) Endpoint Status Clear Register */

#define USBC_UESTA6CLR_TXINIC_Pos   0            /**< \brief (USBC_UESTA6CLR) TXINI Clear */
#define USBC_UESTA6CLR_TXINIC       (_U(0x1) << USBC_UESTA6CLR_TXINIC_Pos)
#define USBC_UESTA6CLR_RXOUTIC_Pos  1            /**< \brief (USBC_UESTA6CLR) RXOUTI Clear */
#define USBC_UESTA6CLR_RXOUTIC      (_U(0x1) << USBC_UESTA6CLR_RXOUTIC_Pos)
#define USBC_UESTA6CLR_RXSTPIC_Pos  2            /**< \brief (USBC_UESTA6CLR) RXSTPI Clear */
#define USBC_UESTA6CLR_RXSTPIC      (_U(0x1) << USBC_UESTA6CLR_RXSTPIC_Pos)
#define USBC_UESTA6CLR_NAKOUTIC_Pos 3            /**< \brief (USBC_UESTA6CLR) NAKOUTI Clear */
#define USBC_UESTA6CLR_NAKOUTIC     (_U(0x1) << USBC_UESTA6CLR_NAKOUTIC_Pos)
#define USBC_UESTA6CLR_NAKINIC_Pos  4            /**< \brief (USBC_UESTA6CLR) NAKINI Clear */
#define USBC_UESTA6CLR_NAKINIC      (_U(0x1) << USBC_UESTA6CLR_NAKINIC_Pos)
#define USBC_UESTA6CLR_STALLEDIC_Pos 6            /**< \brief (USBC_UESTA6CLR) STALLEDI Clear */
#define USBC_UESTA6CLR_STALLEDIC    (_U(0x1) << USBC_UESTA6CLR_STALLEDIC_Pos)
#define USBC_UESTA6CLR_RAMACERIC_Pos 11           /**< \brief (USBC_UESTA6CLR) RAMACERI Clear */
#define USBC_UESTA6CLR_RAMACERIC    (_U(0x1) << USBC_UESTA6CLR_RAMACERIC_Pos)
#define USBC_UESTA6CLR_MASK         _U(0x0000085F) /**< \brief (USBC_UESTA6CLR) MASK Register */

/* -------- USBC_UESTA7CLR : (USBC Offset: 0x17C) ( /W 32) Endpoint Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINIC:1;         /*!< bit:      0  TXINI Clear                        */
    uint32_t RXOUTIC:1;        /*!< bit:      1  RXOUTI Clear                       */
    uint32_t RXSTPIC:1;        /*!< bit:      2  RXSTPI Clear                       */
    uint32_t NAKOUTIC:1;       /*!< bit:      3  NAKOUTI Clear                      */
    uint32_t NAKINIC:1;        /*!< bit:      4  NAKINI Clear                       */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDIC:1;      /*!< bit:      6  STALLEDI Clear                     */
    uint32_t :4;               /*!< bit:  7..10  Reserved                           */
    uint32_t RAMACERIC:1;      /*!< bit:     11  RAMACERI Clear                     */
    uint32_t :20;              /*!< bit: 12..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UESTA7CLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UESTA7CLR_OFFSET       0x17C        /**< \brief (USBC_UESTA7CLR offset) Endpoint Status Clear Register */
#define USBC_UESTA7CLR_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UESTA7CLR reset_value) Endpoint Status Clear Register */

#define USBC_UESTA7CLR_TXINIC_Pos   0            /**< \brief (USBC_UESTA7CLR) TXINI Clear */
#define USBC_UESTA7CLR_TXINIC       (_U(0x1) << USBC_UESTA7CLR_TXINIC_Pos)
#define USBC_UESTA7CLR_RXOUTIC_Pos  1            /**< \brief (USBC_UESTA7CLR) RXOUTI Clear */
#define USBC_UESTA7CLR_RXOUTIC      (_U(0x1) << USBC_UESTA7CLR_RXOUTIC_Pos)
#define USBC_UESTA7CLR_RXSTPIC_Pos  2            /**< \brief (USBC_UESTA7CLR) RXSTPI Clear */
#define USBC_UESTA7CLR_RXSTPIC      (_U(0x1) << USBC_UESTA7CLR_RXSTPIC_Pos)
#define USBC_UESTA7CLR_NAKOUTIC_Pos 3            /**< \brief (USBC_UESTA7CLR) NAKOUTI Clear */
#define USBC_UESTA7CLR_NAKOUTIC     (_U(0x1) << USBC_UESTA7CLR_NAKOUTIC_Pos)
#define USBC_UESTA7CLR_NAKINIC_Pos  4            /**< \brief (USBC_UESTA7CLR) NAKINI Clear */
#define USBC_UESTA7CLR_NAKINIC      (_U(0x1) << USBC_UESTA7CLR_NAKINIC_Pos)
#define USBC_UESTA7CLR_STALLEDIC_Pos 6            /**< \brief (USBC_UESTA7CLR) STALLEDI Clear */
#define USBC_UESTA7CLR_STALLEDIC    (_U(0x1) << USBC_UESTA7CLR_STALLEDIC_Pos)
#define USBC_UESTA7CLR_RAMACERIC_Pos 11           /**< \brief (USBC_UESTA7CLR) RAMACERI Clear */
#define USBC_UESTA7CLR_RAMACERIC    (_U(0x1) << USBC_UESTA7CLR_RAMACERIC_Pos)
#define USBC_UESTA7CLR_MASK         _U(0x0000085F) /**< \brief (USBC_UESTA7CLR) MASK Register */

