frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/* -------- USBC_UESTA0SET : (USBC Offset: 0x190) ( /W 32) Endpoint Status Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINIS:1;         /*!< bit:      0  TXINI Set                          */
    uint32_t RXOUTIS:1;        /*!< bit:      1  RXOUTI Set                         */
    uint32_t RXSTPIS:1;        /*!< bit:      2  RXSTPI Set                         */
    uint32_t NAKOUTIS:1;       /*!< bit:      3  NAKOUTI Set                        */
    uint32_t NAKINIS:1;        /*!< bit:      4  NAKINI Set                         */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDIS:1;      /*!< bit:      6  STALLEDI Set                       */
    uint32_t :4;               /*!< bit:  7..10  Reserved                           */
    uint32_t RAMACERIS:1;      /*!< bit:     11  RAMACERI Set                       */
    uint32_t NBUSYBKS:1;       /*!< bit:     12  NBUSYBK Set                        */
    uint32_t :19;              /*!< bit: 13..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UESTA0SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UESTA0SET_OFFSET       0x190        /**< \brief (USBC_UESTA0SET offset) Endpoint Status Set Register */
#define USBC_UESTA0SET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UESTA0SET reset_value) Endpoint Status Set Register */

#define USBC_UESTA0SET_TXINIS_Pos   0            /**< \brief (USBC_UESTA0SET) TXINI Set */
#define USBC_UESTA0SET_TXINIS       (_U(0x1) << USBC_UESTA0SET_TXINIS_Pos)
#define USBC_UESTA0SET_RXOUTIS_Pos  1            /**< \brief (USBC_UESTA0SET) RXOUTI Set */
#define USBC_UESTA0SET_RXOUTIS      (_U(0x1) << USBC_UESTA0SET_RXOUTIS_Pos)
#define USBC_UESTA0SET_RXSTPIS_Pos  2            /**< \brief (USBC_UESTA0SET) RXSTPI Set */
#define USBC_UESTA0SET_RXSTPIS      (_U(0x1) << USBC_UESTA0SET_RXSTPIS_Pos)
#define USBC_UESTA0SET_NAKOUTIS_Pos 3            /**< \brief (USBC_UESTA0SET) NAKOUTI Set */
#define USBC_UESTA0SET_NAKOUTIS     (_U(0x1) << USBC_UESTA0SET_NAKOUTIS_Pos)
#define USBC_UESTA0SET_NAKINIS_Pos  4            /**< \brief (USBC_UESTA0SET) NAKINI Set */
#define USBC_UESTA0SET_NAKINIS      (_U(0x1) << USBC_UESTA0SET_NAKINIS_Pos)
#define USBC_UESTA0SET_STALLEDIS_Pos 6            /**< \brief (USBC_UESTA0SET) STALLEDI Set */
#define USBC_UESTA0SET_STALLEDIS    (_U(0x1) << USBC_UESTA0SET_STALLEDIS_Pos)
#define USBC_UESTA0SET_RAMACERIS_Pos 11           /**< \brief (USBC_UESTA0SET) RAMACERI Set */
#define USBC_UESTA0SET_RAMACERIS    (_U(0x1) << USBC_UESTA0SET_RAMACERIS_Pos)
#define USBC_UESTA0SET_NBUSYBKS_Pos 12           /**< \brief (USBC_UESTA0SET) NBUSYBK Set */
#define USBC_UESTA0SET_NBUSYBKS     (_U(0x1) << USBC_UESTA0SET_NBUSYBKS_Pos)
#define USBC_UESTA0SET_MASK         _U(0x0000185F) /**< \brief (USBC_UESTA0SET) MASK Register */

/* -------- USBC_UESTA1SET : (USBC Offset: 0x194) ( /W 32) Endpoint Status Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINIS:1;         /*!< bit:      0  TXINI Set                          */
    uint32_t RXOUTIS:1;        /*!< bit:      1  RXOUTI Set                         */
    uint32_t RXSTPIS:1;        /*!< bit:      2  RXSTPI Set                         */
    uint32_t NAKOUTIS:1;       /*!< bit:      3  NAKOUTI Set                        */
    uint32_t NAKINIS:1;        /*!< bit:      4  NAKINI Set                         */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDIS:1;      /*!< bit:      6  STALLEDI Set                       */
    uint32_t :4;               /*!< bit:  7..10  Reserved                           */
    uint32_t RAMACERIS:1;      /*!< bit:     11  RAMACERI Set                       */
    uint32_t NBUSYBKS:1;       /*!< bit:     12  NBUSYBK Set                        */
    uint32_t :19;              /*!< bit: 13..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UESTA1SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UESTA1SET_OFFSET       0x194        /**< \brief (USBC_UESTA1SET offset) Endpoint Status Set Register */
#define USBC_UESTA1SET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UESTA1SET reset_value) Endpoint Status Set Register */

#define USBC_UESTA1SET_TXINIS_Pos   0            /**< \brief (USBC_UESTA1SET) TXINI Set */
#define USBC_UESTA1SET_TXINIS       (_U(0x1) << USBC_UESTA1SET_TXINIS_Pos)
#define USBC_UESTA1SET_RXOUTIS_Pos  1            /**< \brief (USBC_UESTA1SET) RXOUTI Set */
#define USBC_UESTA1SET_RXOUTIS      (_U(0x1) << USBC_UESTA1SET_RXOUTIS_Pos)
#define USBC_UESTA1SET_RXSTPIS_Pos  2            /**< \brief (USBC_UESTA1SET) RXSTPI Set */
#define USBC_UESTA1SET_RXSTPIS      (_U(0x1) << USBC_UESTA1SET_RXSTPIS_Pos)
#define USBC_UESTA1SET_NAKOUTIS_Pos 3            /**< \brief (USBC_UESTA1SET) NAKOUTI Set */
#define USBC_UESTA1SET_NAKOUTIS     (_U(0x1) << USBC_UESTA1SET_NAKOUTIS_Pos)
#define USBC_UESTA1SET_NAKINIS_Pos  4            /**< \brief (USBC_UESTA1SET) NAKINI Set */
#define USBC_UESTA1SET_NAKINIS      (_U(0x1) << USBC_UESTA1SET_NAKINIS_Pos)
#define USBC_UESTA1SET_STALLEDIS_Pos 6            /**< \brief (USBC_UESTA1SET) STALLEDI Set */
#define USBC_UESTA1SET_STALLEDIS    (_U(0x1) << USBC_UESTA1SET_STALLEDIS_Pos)
#define USBC_UESTA1SET_RAMACERIS_Pos 11           /**< \brief (USBC_UESTA1SET) RAMACERI Set */
#define USBC_UESTA1SET_RAMACERIS    (_U(0x1) << USBC_UESTA1SET_RAMACERIS_Pos)
#define USBC_UESTA1SET_NBUSYBKS_Pos 12           /**< \brief (USBC_UESTA1SET) NBUSYBK Set */
#define USBC_UESTA1SET_NBUSYBKS     (_U(0x1) << USBC_UESTA1SET_NBUSYBKS_Pos)
#define USBC_UESTA1SET_MASK         _U(0x0000185F) /**< \brief (USBC_UESTA1SET) MASK Register */

/* -------- USBC_UESTA2SET : (USBC Offset: 0x198) ( /W 32) Endpoint Status Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINIS:1;         /*!< bit:      0  TXINI Set                          */
    uint32_t RXOUTIS:1;        /*!< bit:      1  RXOUTI Set                         */
    uint32_t RXSTPIS:1;        /*!< bit:      2  RXSTPI Set                         */
    uint32_t NAKOUTIS:1;       /*!< bit:      3  NAKOUTI Set                        */
    uint32_t NAKINIS:1;        /*!< bit:      4  NAKINI Set                         */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDIS:1;      /*!< bit:      6  STALLEDI Set                       */
    uint32_t :4;               /*!< bit:  7..10  Reserved                           */
    uint32_t RAMACERIS:1;      /*!< bit:     11  RAMACERI Set                       */
    uint32_t NBUSYBKS:1;       /*!< bit:     12  NBUSYBK Set                        */
    uint32_t :19;              /*!< bit: 13..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UESTA2SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

