frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/* -------- USBC_UECON1 : (USBC Offset: 0x1C4) (R/  32) Endpoint Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINE:1;          /*!< bit:      0  TXIN Interrupt Enable              */
    uint32_t RXOUTE:1;         /*!< bit:      1  RXOUT Interrupt Enable             */
    uint32_t RXSTPE:1;         /*!< bit:      2  RXSTP Interrupt Enable             */
    uint32_t NAKOUTE:1;        /*!< bit:      3  NAKOUT Interrupt Enable            */
    uint32_t NAKINE:1;         /*!< bit:      4  NAKIN Interrupt Enable             */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDE:1;       /*!< bit:      6  STALLED Interrupt Enable           */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLY:1;         /*!< bit:      8  No Reply                           */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACERE:1;       /*!< bit:     11  RAMACER Interrupt Enable           */
    uint32_t NBUSYBKE:1;       /*!< bit:     12  Number of Busy Banks Interrupt Enable */
    uint32_t KILLBK:1;         /*!< bit:     13  Kill IN Bank                       */
    uint32_t FIFOCON:1;        /*!< bit:     14  FIFO Control                       */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t NYETDIS:1;        /*!< bit:     17  NYET Token Enable                  */
    uint32_t RSTDT:1;          /*!< bit:     18  Reset Data Toggle                  */
    uint32_t STALLRQ:1;        /*!< bit:     19  STALL Request                      */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0:1;          /*!< bit:     24  Busy Bank1 Enable                  */
    uint32_t BUSY1:1;          /*!< bit:     25  Busy Bank0 Enable                  */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECON1_OFFSET          0x1C4        /**< \brief (USBC_UECON1 offset) Endpoint Control Register */
#define USBC_UECON1_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UECON1 reset_value) Endpoint Control Register */

#define USBC_UECON1_TXINE_Pos       0            /**< \brief (USBC_UECON1) TXIN Interrupt Enable */
#define USBC_UECON1_TXINE           (_U(0x1) << USBC_UECON1_TXINE_Pos)
#define USBC_UECON1_RXOUTE_Pos      1            /**< \brief (USBC_UECON1) RXOUT Interrupt Enable */
#define USBC_UECON1_RXOUTE          (_U(0x1) << USBC_UECON1_RXOUTE_Pos)
#define USBC_UECON1_RXSTPE_Pos      2            /**< \brief (USBC_UECON1) RXSTP Interrupt Enable */
#define USBC_UECON1_RXSTPE          (_U(0x1) << USBC_UECON1_RXSTPE_Pos)
#define USBC_UECON1_NAKOUTE_Pos     3            /**< \brief (USBC_UECON1) NAKOUT Interrupt Enable */
#define USBC_UECON1_NAKOUTE         (_U(0x1) << USBC_UECON1_NAKOUTE_Pos)
#define USBC_UECON1_NAKINE_Pos      4            /**< \brief (USBC_UECON1) NAKIN Interrupt Enable */
#define USBC_UECON1_NAKINE          (_U(0x1) << USBC_UECON1_NAKINE_Pos)
#define USBC_UECON1_STALLEDE_Pos    6            /**< \brief (USBC_UECON1) STALLED Interrupt Enable */
#define USBC_UECON1_STALLEDE        (_U(0x1) << USBC_UECON1_STALLEDE_Pos)
#define USBC_UECON1_NREPLY_Pos      8            /**< \brief (USBC_UECON1) No Reply */
#define USBC_UECON1_NREPLY          (_U(0x1) << USBC_UECON1_NREPLY_Pos)
#define USBC_UECON1_RAMACERE_Pos    11           /**< \brief (USBC_UECON1) RAMACER Interrupt Enable */
#define USBC_UECON1_RAMACERE        (_U(0x1) << USBC_UECON1_RAMACERE_Pos)
#define USBC_UECON1_NBUSYBKE_Pos    12           /**< \brief (USBC_UECON1) Number of Busy Banks Interrupt Enable */
#define USBC_UECON1_NBUSYBKE        (_U(0x1) << USBC_UECON1_NBUSYBKE_Pos)
#define USBC_UECON1_KILLBK_Pos      13           /**< \brief (USBC_UECON1) Kill IN Bank */
#define USBC_UECON1_KILLBK          (_U(0x1) << USBC_UECON1_KILLBK_Pos)
#define USBC_UECON1_FIFOCON_Pos     14           /**< \brief (USBC_UECON1) FIFO Control */
#define USBC_UECON1_FIFOCON         (_U(0x1) << USBC_UECON1_FIFOCON_Pos)
#define USBC_UECON1_NYETDIS_Pos     17           /**< \brief (USBC_UECON1) NYET Token Enable */
#define USBC_UECON1_NYETDIS         (_U(0x1) << USBC_UECON1_NYETDIS_Pos)
#define USBC_UECON1_RSTDT_Pos       18           /**< \brief (USBC_UECON1) Reset Data Toggle */
#define USBC_UECON1_RSTDT           (_U(0x1) << USBC_UECON1_RSTDT_Pos)
#define USBC_UECON1_STALLRQ_Pos     19           /**< \brief (USBC_UECON1) STALL Request */
#define USBC_UECON1_STALLRQ         (_U(0x1) << USBC_UECON1_STALLRQ_Pos)
#define USBC_UECON1_BUSY0_Pos       24           /**< \brief (USBC_UECON1) Busy Bank1 Enable */
#define USBC_UECON1_BUSY0           (_U(0x1) << USBC_UECON1_BUSY0_Pos)
#define USBC_UECON1_BUSY1_Pos       25           /**< \brief (USBC_UECON1) Busy Bank0 Enable */
#define USBC_UECON1_BUSY1           (_U(0x1) << USBC_UECON1_BUSY1_Pos)
#define USBC_UECON1_MASK            _U(0x030E795F) /**< \brief (USBC_UECON1) MASK Register */

/* -------- USBC_UECON2 : (USBC Offset: 0x1C8) (R/  32) Endpoint Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINE:1;          /*!< bit:      0  TXIN Interrupt Enable              */
    uint32_t RXOUTE:1;         /*!< bit:      1  RXOUT Interrupt Enable             */
    uint32_t RXSTPE:1;         /*!< bit:      2  RXSTP Interrupt Enable             */
    uint32_t NAKOUTE:1;        /*!< bit:      3  NAKOUT Interrupt Enable            */
    uint32_t NAKINE:1;         /*!< bit:      4  NAKIN Interrupt Enable             */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDE:1;       /*!< bit:      6  STALLED Interrupt Enable           */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLY:1;         /*!< bit:      8  No Reply                           */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACERE:1;       /*!< bit:     11  RAMACER Interrupt Enable           */
    uint32_t NBUSYBKE:1;       /*!< bit:     12  Number of Busy Banks Interrupt Enable */
    uint32_t KILLBK:1;         /*!< bit:     13  Kill IN Bank                       */
    uint32_t FIFOCON:1;        /*!< bit:     14  FIFO Control                       */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t NYETDIS:1;        /*!< bit:     17  NYET Token Enable                  */
    uint32_t RSTDT:1;          /*!< bit:     18  Reset Data Toggle                  */
    uint32_t STALLRQ:1;        /*!< bit:     19  STALL Request                      */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0:1;          /*!< bit:     24  Busy Bank1 Enable                  */
    uint32_t BUSY1:1;          /*!< bit:     25  Busy Bank0 Enable                  */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECON2_OFFSET          0x1C8        /**< \brief (USBC_UECON2 offset) Endpoint Control Register */
#define USBC_UECON2_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UECON2 reset_value) Endpoint Control Register */

#define USBC_UECON2_TXINE_Pos       0            /**< \brief (USBC_UECON2) TXIN Interrupt Enable */
#define USBC_UECON2_TXINE           (_U(0x1) << USBC_UECON2_TXINE_Pos)
#define USBC_UECON2_RXOUTE_Pos      1            /**< \brief (USBC_UECON2) RXOUT Interrupt Enable */
#define USBC_UECON2_RXOUTE          (_U(0x1) << USBC_UECON2_RXOUTE_Pos)
#define USBC_UECON2_RXSTPE_Pos      2            /**< \brief (USBC_UECON2) RXSTP Interrupt Enable */
#define USBC_UECON2_RXSTPE          (_U(0x1) << USBC_UECON2_RXSTPE_Pos)
#define USBC_UECON2_NAKOUTE_Pos     3            /**< \brief (USBC_UECON2) NAKOUT Interrupt Enable */
#define USBC_UECON2_NAKOUTE         (_U(0x1) << USBC_UECON2_NAKOUTE_Pos)
#define USBC_UECON2_NAKINE_Pos      4            /**< \brief (USBC_UECON2) NAKIN Interrupt Enable */
#define USBC_UECON2_NAKINE          (_U(0x1) << USBC_UECON2_NAKINE_Pos)
#define USBC_UECON2_STALLEDE_Pos    6            /**< \brief (USBC_UECON2) STALLED Interrupt Enable */
#define USBC_UECON2_STALLEDE        (_U(0x1) << USBC_UECON2_STALLEDE_Pos)
#define USBC_UECON2_NREPLY_Pos      8            /**< \brief (USBC_UECON2) No Reply */
#define USBC_UECON2_NREPLY          (_U(0x1) << USBC_UECON2_NREPLY_Pos)
#define USBC_UECON2_RAMACERE_Pos    11           /**< \brief (USBC_UECON2) RAMACER Interrupt Enable */
#define USBC_UECON2_RAMACERE        (_U(0x1) << USBC_UECON2_RAMACERE_Pos)
#define USBC_UECON2_NBUSYBKE_Pos    12           /**< \brief (USBC_UECON2) Number of Busy Banks Interrupt Enable */
#define USBC_UECON2_NBUSYBKE        (_U(0x1) << USBC_UECON2_NBUSYBKE_Pos)
#define USBC_UECON2_KILLBK_Pos      13           /**< \brief (USBC_UECON2) Kill IN Bank */
#define USBC_UECON2_KILLBK          (_U(0x1) << USBC_UECON2_KILLBK_Pos)
#define USBC_UECON2_FIFOCON_Pos     14           /**< \brief (USBC_UECON2) FIFO Control */
#define USBC_UECON2_FIFOCON         (_U(0x1) << USBC_UECON2_FIFOCON_Pos)
#define USBC_UECON2_NYETDIS_Pos     17           /**< \brief (USBC_UECON2) NYET Token Enable */
#define USBC_UECON2_NYETDIS         (_U(0x1) << USBC_UECON2_NYETDIS_Pos)
#define USBC_UECON2_RSTDT_Pos       18           /**< \brief (USBC_UECON2) Reset Data Toggle */
#define USBC_UECON2_RSTDT           (_U(0x1) << USBC_UECON2_RSTDT_Pos)
#define USBC_UECON2_STALLRQ_Pos     19           /**< \brief (USBC_UECON2) STALL Request */
#define USBC_UECON2_STALLRQ         (_U(0x1) << USBC_UECON2_STALLRQ_Pos)
#define USBC_UECON2_BUSY0_Pos       24           /**< \brief (USBC_UECON2) Busy Bank1 Enable */
#define USBC_UECON2_BUSY0           (_U(0x1) << USBC_UECON2_BUSY0_Pos)
#define USBC_UECON2_BUSY1_Pos       25           /**< \brief (USBC_UECON2) Busy Bank0 Enable */
#define USBC_UECON2_BUSY1           (_U(0x1) << USBC_UECON2_BUSY1_Pos)
#define USBC_UECON2_MASK            _U(0x030E795F) /**< \brief (USBC_UECON2) MASK Register */

/* -------- USBC_UECON3 : (USBC Offset: 0x1CC) (R/  32) Endpoint Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINE:1;          /*!< bit:      0  TXIN Interrupt Enable              */
    uint32_t RXOUTE:1;         /*!< bit:      1  RXOUT Interrupt Enable             */
    uint32_t RXSTPE:1;         /*!< bit:      2  RXSTP Interrupt Enable             */
    uint32_t NAKOUTE:1;        /*!< bit:      3  NAKOUT Interrupt Enable            */
    uint32_t NAKINE:1;         /*!< bit:      4  NAKIN Interrupt Enable             */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDE:1;       /*!< bit:      6  STALLED Interrupt Enable           */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLY:1;         /*!< bit:      8  No Reply                           */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACERE:1;       /*!< bit:     11  RAMACER Interrupt Enable           */
    uint32_t NBUSYBKE:1;       /*!< bit:     12  Number of Busy Banks Interrupt Enable */
    uint32_t KILLBK:1;         /*!< bit:     13  Kill IN Bank                       */
    uint32_t FIFOCON:1;        /*!< bit:     14  FIFO Control                       */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t NYETDIS:1;        /*!< bit:     17  NYET Token Enable                  */
    uint32_t RSTDT:1;          /*!< bit:     18  Reset Data Toggle                  */
    uint32_t STALLRQ:1;        /*!< bit:     19  STALL Request                      */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0:1;          /*!< bit:     24  Busy Bank1 Enable                  */
    uint32_t BUSY1:1;          /*!< bit:     25  Busy Bank0 Enable                  */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECON3_OFFSET          0x1CC        /**< \brief (USBC_UECON3 offset) Endpoint Control Register */
#define USBC_UECON3_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UECON3 reset_value) Endpoint Control Register */

