frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UECON5_TXINE_Pos       0            /**< \brief (USBC_UECON5) TXIN Interrupt Enable */
#define USBC_UECON5_TXINE           (_U(0x1) << USBC_UECON5_TXINE_Pos)
#define USBC_UECON5_RXOUTE_Pos      1            /**< \brief (USBC_UECON5) RXOUT Interrupt Enable */
#define USBC_UECON5_RXOUTE          (_U(0x1) << USBC_UECON5_RXOUTE_Pos)
#define USBC_UECON5_RXSTPE_Pos      2            /**< \brief (USBC_UECON5) RXSTP Interrupt Enable */
#define USBC_UECON5_RXSTPE          (_U(0x1) << USBC_UECON5_RXSTPE_Pos)
#define USBC_UECON5_NAKOUTE_Pos     3            /**< \brief (USBC_UECON5) NAKOUT Interrupt Enable */
#define USBC_UECON5_NAKOUTE         (_U(0x1) << USBC_UECON5_NAKOUTE_Pos)
#define USBC_UECON5_NAKINE_Pos      4            /**< \brief (USBC_UECON5) NAKIN Interrupt Enable */
#define USBC_UECON5_NAKINE          (_U(0x1) << USBC_UECON5_NAKINE_Pos)
#define USBC_UECON5_STALLEDE_Pos    6            /**< \brief (USBC_UECON5) STALLED Interrupt Enable */
#define USBC_UECON5_STALLEDE        (_U(0x1) << USBC_UECON5_STALLEDE_Pos)
#define USBC_UECON5_NREPLY_Pos      8            /**< \brief (USBC_UECON5) No Reply */
#define USBC_UECON5_NREPLY          (_U(0x1) << USBC_UECON5_NREPLY_Pos)
#define USBC_UECON5_RAMACERE_Pos    11           /**< \brief (USBC_UECON5) RAMACER Interrupt Enable */
#define USBC_UECON5_RAMACERE        (_U(0x1) << USBC_UECON5_RAMACERE_Pos)
#define USBC_UECON5_NBUSYBKE_Pos    12           /**< \brief (USBC_UECON5) Number of Busy Banks Interrupt Enable */
#define USBC_UECON5_NBUSYBKE        (_U(0x1) << USBC_UECON5_NBUSYBKE_Pos)
#define USBC_UECON5_KILLBK_Pos      13           /**< \brief (USBC_UECON5) Kill IN Bank */
#define USBC_UECON5_KILLBK          (_U(0x1) << USBC_UECON5_KILLBK_Pos)
#define USBC_UECON5_FIFOCON_Pos     14           /**< \brief (USBC_UECON5) FIFO Control */
#define USBC_UECON5_FIFOCON         (_U(0x1) << USBC_UECON5_FIFOCON_Pos)
#define USBC_UECON5_NYETDIS_Pos     17           /**< \brief (USBC_UECON5) NYET Token Enable */
#define USBC_UECON5_NYETDIS         (_U(0x1) << USBC_UECON5_NYETDIS_Pos)
#define USBC_UECON5_RSTDT_Pos       18           /**< \brief (USBC_UECON5) Reset Data Toggle */
#define USBC_UECON5_RSTDT           (_U(0x1) << USBC_UECON5_RSTDT_Pos)
#define USBC_UECON5_STALLRQ_Pos     19           /**< \brief (USBC_UECON5) STALL Request */
#define USBC_UECON5_STALLRQ         (_U(0x1) << USBC_UECON5_STALLRQ_Pos)
#define USBC_UECON5_BUSY0_Pos       24           /**< \brief (USBC_UECON5) Busy Bank1 Enable */
#define USBC_UECON5_BUSY0           (_U(0x1) << USBC_UECON5_BUSY0_Pos)
#define USBC_UECON5_BUSY1_Pos       25           /**< \brief (USBC_UECON5) Busy Bank0 Enable */
#define USBC_UECON5_BUSY1           (_U(0x1) << USBC_UECON5_BUSY1_Pos)
#define USBC_UECON5_MASK            _U(0x030E795F) /**< \brief (USBC_UECON5) MASK Register */

/* -------- USBC_UECON6 : (USBC Offset: 0x1D8) (R/  32) Endpoint Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINE:1;          /*!< bit:      0  TXIN Interrupt Enable              */
    uint32_t RXOUTE:1;         /*!< bit:      1  RXOUT Interrupt Enable             */
    uint32_t RXSTPE:1;         /*!< bit:      2  RXSTP Interrupt Enable             */
    uint32_t NAKOUTE:1;        /*!< bit:      3  NAKOUT Interrupt Enable            */
    uint32_t NAKINE:1;         /*!< bit:      4  NAKIN Interrupt Enable             */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDE:1;       /*!< bit:      6  STALLED Interrupt Enable           */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLY:1;         /*!< bit:      8  No Reply                           */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACERE:1;       /*!< bit:     11  RAMACER Interrupt Enable           */
    uint32_t NBUSYBKE:1;       /*!< bit:     12  Number of Busy Banks Interrupt Enable */
    uint32_t KILLBK:1;         /*!< bit:     13  Kill IN Bank                       */
    uint32_t FIFOCON:1;        /*!< bit:     14  FIFO Control                       */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t NYETDIS:1;        /*!< bit:     17  NYET Token Enable                  */
    uint32_t RSTDT:1;          /*!< bit:     18  Reset Data Toggle                  */
    uint32_t STALLRQ:1;        /*!< bit:     19  STALL Request                      */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0:1;          /*!< bit:     24  Busy Bank1 Enable                  */
    uint32_t BUSY1:1;          /*!< bit:     25  Busy Bank0 Enable                  */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON6_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECON6_OFFSET          0x1D8        /**< \brief (USBC_UECON6 offset) Endpoint Control Register */
#define USBC_UECON6_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UECON6 reset_value) Endpoint Control Register */

#define USBC_UECON6_TXINE_Pos       0            /**< \brief (USBC_UECON6) TXIN Interrupt Enable */
#define USBC_UECON6_TXINE           (_U(0x1) << USBC_UECON6_TXINE_Pos)
#define USBC_UECON6_RXOUTE_Pos      1            /**< \brief (USBC_UECON6) RXOUT Interrupt Enable */
#define USBC_UECON6_RXOUTE          (_U(0x1) << USBC_UECON6_RXOUTE_Pos)
#define USBC_UECON6_RXSTPE_Pos      2            /**< \brief (USBC_UECON6) RXSTP Interrupt Enable */
#define USBC_UECON6_RXSTPE          (_U(0x1) << USBC_UECON6_RXSTPE_Pos)
#define USBC_UECON6_NAKOUTE_Pos     3            /**< \brief (USBC_UECON6) NAKOUT Interrupt Enable */
#define USBC_UECON6_NAKOUTE         (_U(0x1) << USBC_UECON6_NAKOUTE_Pos)
#define USBC_UECON6_NAKINE_Pos      4            /**< \brief (USBC_UECON6) NAKIN Interrupt Enable */
#define USBC_UECON6_NAKINE          (_U(0x1) << USBC_UECON6_NAKINE_Pos)
#define USBC_UECON6_STALLEDE_Pos    6            /**< \brief (USBC_UECON6) STALLED Interrupt Enable */
#define USBC_UECON6_STALLEDE        (_U(0x1) << USBC_UECON6_STALLEDE_Pos)
#define USBC_UECON6_NREPLY_Pos      8            /**< \brief (USBC_UECON6) No Reply */
#define USBC_UECON6_NREPLY          (_U(0x1) << USBC_UECON6_NREPLY_Pos)
#define USBC_UECON6_RAMACERE_Pos    11           /**< \brief (USBC_UECON6) RAMACER Interrupt Enable */
#define USBC_UECON6_RAMACERE        (_U(0x1) << USBC_UECON6_RAMACERE_Pos)
#define USBC_UECON6_NBUSYBKE_Pos    12           /**< \brief (USBC_UECON6) Number of Busy Banks Interrupt Enable */
#define USBC_UECON6_NBUSYBKE        (_U(0x1) << USBC_UECON6_NBUSYBKE_Pos)
#define USBC_UECON6_KILLBK_Pos      13           /**< \brief (USBC_UECON6) Kill IN Bank */
#define USBC_UECON6_KILLBK          (_U(0x1) << USBC_UECON6_KILLBK_Pos)
#define USBC_UECON6_FIFOCON_Pos     14           /**< \brief (USBC_UECON6) FIFO Control */
#define USBC_UECON6_FIFOCON         (_U(0x1) << USBC_UECON6_FIFOCON_Pos)
#define USBC_UECON6_NYETDIS_Pos     17           /**< \brief (USBC_UECON6) NYET Token Enable */
#define USBC_UECON6_NYETDIS         (_U(0x1) << USBC_UECON6_NYETDIS_Pos)
#define USBC_UECON6_RSTDT_Pos       18           /**< \brief (USBC_UECON6) Reset Data Toggle */
#define USBC_UECON6_RSTDT           (_U(0x1) << USBC_UECON6_RSTDT_Pos)
#define USBC_UECON6_STALLRQ_Pos     19           /**< \brief (USBC_UECON6) STALL Request */
#define USBC_UECON6_STALLRQ         (_U(0x1) << USBC_UECON6_STALLRQ_Pos)
#define USBC_UECON6_BUSY0_Pos       24           /**< \brief (USBC_UECON6) Busy Bank1 Enable */
#define USBC_UECON6_BUSY0           (_U(0x1) << USBC_UECON6_BUSY0_Pos)
#define USBC_UECON6_BUSY1_Pos       25           /**< \brief (USBC_UECON6) Busy Bank0 Enable */
#define USBC_UECON6_BUSY1           (_U(0x1) << USBC_UECON6_BUSY1_Pos)
#define USBC_UECON6_MASK            _U(0x030E795F) /**< \brief (USBC_UECON6) MASK Register */

