frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/* -------- USBC_UECON7 : (USBC Offset: 0x1DC) (R/  32) Endpoint Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINE:1;          /*!< bit:      0  TXIN Interrupt Enable              */
    uint32_t RXOUTE:1;         /*!< bit:      1  RXOUT Interrupt Enable             */
    uint32_t RXSTPE:1;         /*!< bit:      2  RXSTP Interrupt Enable             */
    uint32_t NAKOUTE:1;        /*!< bit:      3  NAKOUT Interrupt Enable            */
    uint32_t NAKINE:1;         /*!< bit:      4  NAKIN Interrupt Enable             */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDE:1;       /*!< bit:      6  STALLED Interrupt Enable           */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLY:1;         /*!< bit:      8  No Reply                           */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACERE:1;       /*!< bit:     11  RAMACER Interrupt Enable           */
    uint32_t NBUSYBKE:1;       /*!< bit:     12  Number of Busy Banks Interrupt Enable */
    uint32_t KILLBK:1;         /*!< bit:     13  Kill IN Bank                       */
    uint32_t FIFOCON:1;        /*!< bit:     14  FIFO Control                       */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t NYETDIS:1;        /*!< bit:     17  NYET Token Enable                  */
    uint32_t RSTDT:1;          /*!< bit:     18  Reset Data Toggle                  */
    uint32_t STALLRQ:1;        /*!< bit:     19  STALL Request                      */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0:1;          /*!< bit:     24  Busy Bank1 Enable                  */
    uint32_t BUSY1:1;          /*!< bit:     25  Busy Bank0 Enable                  */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON7_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECON7_OFFSET          0x1DC        /**< \brief (USBC_UECON7 offset) Endpoint Control Register */
#define USBC_UECON7_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UECON7 reset_value) Endpoint Control Register */

#define USBC_UECON7_TXINE_Pos       0            /**< \brief (USBC_UECON7) TXIN Interrupt Enable */
#define USBC_UECON7_TXINE           (_U(0x1) << USBC_UECON7_TXINE_Pos)
#define USBC_UECON7_RXOUTE_Pos      1            /**< \brief (USBC_UECON7) RXOUT Interrupt Enable */
#define USBC_UECON7_RXOUTE          (_U(0x1) << USBC_UECON7_RXOUTE_Pos)
#define USBC_UECON7_RXSTPE_Pos      2            /**< \brief (USBC_UECON7) RXSTP Interrupt Enable */
#define USBC_UECON7_RXSTPE          (_U(0x1) << USBC_UECON7_RXSTPE_Pos)
#define USBC_UECON7_NAKOUTE_Pos     3            /**< \brief (USBC_UECON7) NAKOUT Interrupt Enable */
#define USBC_UECON7_NAKOUTE         (_U(0x1) << USBC_UECON7_NAKOUTE_Pos)
#define USBC_UECON7_NAKINE_Pos      4            /**< \brief (USBC_UECON7) NAKIN Interrupt Enable */
#define USBC_UECON7_NAKINE          (_U(0x1) << USBC_UECON7_NAKINE_Pos)
#define USBC_UECON7_STALLEDE_Pos    6            /**< \brief (USBC_UECON7) STALLED Interrupt Enable */
#define USBC_UECON7_STALLEDE        (_U(0x1) << USBC_UECON7_STALLEDE_Pos)
#define USBC_UECON7_NREPLY_Pos      8            /**< \brief (USBC_UECON7) No Reply */
#define USBC_UECON7_NREPLY          (_U(0x1) << USBC_UECON7_NREPLY_Pos)
#define USBC_UECON7_RAMACERE_Pos    11           /**< \brief (USBC_UECON7) RAMACER Interrupt Enable */
#define USBC_UECON7_RAMACERE        (_U(0x1) << USBC_UECON7_RAMACERE_Pos)
#define USBC_UECON7_NBUSYBKE_Pos    12           /**< \brief (USBC_UECON7) Number of Busy Banks Interrupt Enable */
#define USBC_UECON7_NBUSYBKE        (_U(0x1) << USBC_UECON7_NBUSYBKE_Pos)
#define USBC_UECON7_KILLBK_Pos      13           /**< \brief (USBC_UECON7) Kill IN Bank */
#define USBC_UECON7_KILLBK          (_U(0x1) << USBC_UECON7_KILLBK_Pos)
#define USBC_UECON7_FIFOCON_Pos     14           /**< \brief (USBC_UECON7) FIFO Control */
#define USBC_UECON7_FIFOCON         (_U(0x1) << USBC_UECON7_FIFOCON_Pos)
#define USBC_UECON7_NYETDIS_Pos     17           /**< \brief (USBC_UECON7) NYET Token Enable */
#define USBC_UECON7_NYETDIS         (_U(0x1) << USBC_UECON7_NYETDIS_Pos)
#define USBC_UECON7_RSTDT_Pos       18           /**< \brief (USBC_UECON7) Reset Data Toggle */
#define USBC_UECON7_RSTDT           (_U(0x1) << USBC_UECON7_RSTDT_Pos)
#define USBC_UECON7_STALLRQ_Pos     19           /**< \brief (USBC_UECON7) STALL Request */
#define USBC_UECON7_STALLRQ         (_U(0x1) << USBC_UECON7_STALLRQ_Pos)
#define USBC_UECON7_BUSY0_Pos       24           /**< \brief (USBC_UECON7) Busy Bank1 Enable */
#define USBC_UECON7_BUSY0           (_U(0x1) << USBC_UECON7_BUSY0_Pos)
#define USBC_UECON7_BUSY1_Pos       25           /**< \brief (USBC_UECON7) Busy Bank0 Enable */
#define USBC_UECON7_BUSY1           (_U(0x1) << USBC_UECON7_BUSY1_Pos)
#define USBC_UECON7_MASK            _U(0x030E795F) /**< \brief (USBC_UECON7) MASK Register */

/* -------- USBC_UECON0SET : (USBC Offset: 0x1F0) ( /W 32) Endpoint Control Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINES:1;         /*!< bit:      0  TXINE Set                          */
    uint32_t RXOUTES:1;        /*!< bit:      1  RXOUTE Set                         */
    uint32_t RXSTPES:1;        /*!< bit:      2  RXSTPE Set                         */
    uint32_t NAKOUTES:1;       /*!< bit:      3  NAKOUTE Set                        */
    uint32_t NAKINES:1;        /*!< bit:      4  NAKINE Set                         */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDES:1;      /*!< bit:      6  STALLEDE Set                       */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLYS:1;        /*!< bit:      8  NREPLY Set                         */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACERES:1;      /*!< bit:     11  RAMACERE Set                       */
    uint32_t NBUSYBKES:1;      /*!< bit:     12  NBUSYBKE Set                       */
    uint32_t KILLBKS:1;        /*!< bit:     13  KILLBK Set                         */
    uint32_t :3;               /*!< bit: 14..16  Reserved                           */
    uint32_t NYETDISS:1;       /*!< bit:     17  NYETDIS Set                        */
    uint32_t RSTDTS:1;         /*!< bit:     18  RSTDT Set                          */
    uint32_t STALLRQS:1;       /*!< bit:     19  STALLRQ Set                        */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0S:1;         /*!< bit:     24  BUSY0 Set                          */
    uint32_t BUSY1S:1;         /*!< bit:     25  BUSY1 Set                          */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON0SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECON0SET_OFFSET       0x1F0        /**< \brief (USBC_UECON0SET offset) Endpoint Control Set Register */
#define USBC_UECON0SET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UECON0SET reset_value) Endpoint Control Set Register */

#define USBC_UECON0SET_TXINES_Pos   0            /**< \brief (USBC_UECON0SET) TXINE Set */
#define USBC_UECON0SET_TXINES       (_U(0x1) << USBC_UECON0SET_TXINES_Pos)
#define USBC_UECON0SET_RXOUTES_Pos  1            /**< \brief (USBC_UECON0SET) RXOUTE Set */
#define USBC_UECON0SET_RXOUTES      (_U(0x1) << USBC_UECON0SET_RXOUTES_Pos)
#define USBC_UECON0SET_RXSTPES_Pos  2            /**< \brief (USBC_UECON0SET) RXSTPE Set */
#define USBC_UECON0SET_RXSTPES      (_U(0x1) << USBC_UECON0SET_RXSTPES_Pos)
#define USBC_UECON0SET_NAKOUTES_Pos 3            /**< \brief (USBC_UECON0SET) NAKOUTE Set */
#define USBC_UECON0SET_NAKOUTES     (_U(0x1) << USBC_UECON0SET_NAKOUTES_Pos)
#define USBC_UECON0SET_NAKINES_Pos  4            /**< \brief (USBC_UECON0SET) NAKINE Set */
#define USBC_UECON0SET_NAKINES      (_U(0x1) << USBC_UECON0SET_NAKINES_Pos)
#define USBC_UECON0SET_STALLEDES_Pos 6            /**< \brief (USBC_UECON0SET) STALLEDE Set */
#define USBC_UECON0SET_STALLEDES    (_U(0x1) << USBC_UECON0SET_STALLEDES_Pos)
#define USBC_UECON0SET_NREPLYS_Pos  8            /**< \brief (USBC_UECON0SET) NREPLY Set */
#define USBC_UECON0SET_NREPLYS      (_U(0x1) << USBC_UECON0SET_NREPLYS_Pos)
#define USBC_UECON0SET_RAMACERES_Pos 11           /**< \brief (USBC_UECON0SET) RAMACERE Set */
#define USBC_UECON0SET_RAMACERES    (_U(0x1) << USBC_UECON0SET_RAMACERES_Pos)
#define USBC_UECON0SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UECON0SET) NBUSYBKE Set */
#define USBC_UECON0SET_NBUSYBKES    (_U(0x1) << USBC_UECON0SET_NBUSYBKES_Pos)
#define USBC_UECON0SET_KILLBKS_Pos  13           /**< \brief (USBC_UECON0SET) KILLBK Set */
#define USBC_UECON0SET_KILLBKS      (_U(0x1) << USBC_UECON0SET_KILLBKS_Pos)
#define USBC_UECON0SET_NYETDISS_Pos 17           /**< \brief (USBC_UECON0SET) NYETDIS Set */
#define USBC_UECON0SET_NYETDISS     (_U(0x1) << USBC_UECON0SET_NYETDISS_Pos)
#define USBC_UECON0SET_RSTDTS_Pos   18           /**< \brief (USBC_UECON0SET) RSTDT Set */
#define USBC_UECON0SET_RSTDTS       (_U(0x1) << USBC_UECON0SET_RSTDTS_Pos)
#define USBC_UECON0SET_STALLRQS_Pos 19           /**< \brief (USBC_UECON0SET) STALLRQ Set */
#define USBC_UECON0SET_STALLRQS     (_U(0x1) << USBC_UECON0SET_STALLRQS_Pos)
#define USBC_UECON0SET_BUSY0S_Pos   24           /**< \brief (USBC_UECON0SET) BUSY0 Set */
#define USBC_UECON0SET_BUSY0S       (_U(0x1) << USBC_UECON0SET_BUSY0S_Pos)
#define USBC_UECON0SET_BUSY1S_Pos   25           /**< \brief (USBC_UECON0SET) BUSY1 Set */
#define USBC_UECON0SET_BUSY1S       (_U(0x1) << USBC_UECON0SET_BUSY1S_Pos)
#define USBC_UECON0SET_MASK         _U(0x030E395F) /**< \brief (USBC_UECON0SET) MASK Register */

