frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/* -------- USBC_UECON1SET : (USBC Offset: 0x1F4) ( /W 32) Endpoint Control Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINES:1;         /*!< bit:      0  TXINE Set                          */
    uint32_t RXOUTES:1;        /*!< bit:      1  RXOUTE Set                         */
    uint32_t RXSTPES:1;        /*!< bit:      2  RXSTPE Set                         */
    uint32_t NAKOUTES:1;       /*!< bit:      3  NAKOUTE Set                        */
    uint32_t NAKINES:1;        /*!< bit:      4  NAKINE Set                         */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDES:1;      /*!< bit:      6  STALLEDE Set                       */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLYS:1;        /*!< bit:      8  NREPLY Set                         */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACERES:1;      /*!< bit:     11  RAMACERE Set                       */
    uint32_t NBUSYBKES:1;      /*!< bit:     12  NBUSYBKE Set                       */
    uint32_t KILLBKS:1;        /*!< bit:     13  KILLBK Set                         */
    uint32_t :3;               /*!< bit: 14..16  Reserved                           */
    uint32_t NYETDISS:1;       /*!< bit:     17  NYETDIS Set                        */
    uint32_t RSTDTS:1;         /*!< bit:     18  RSTDT Set                          */
    uint32_t STALLRQS:1;       /*!< bit:     19  STALLRQ Set                        */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0S:1;         /*!< bit:     24  BUSY0 Set                          */
    uint32_t BUSY1S:1;         /*!< bit:     25  BUSY1 Set                          */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON1SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECON1SET_OFFSET       0x1F4        /**< \brief (USBC_UECON1SET offset) Endpoint Control Set Register */
#define USBC_UECON1SET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UECON1SET reset_value) Endpoint Control Set Register */

#define USBC_UECON1SET_TXINES_Pos   0            /**< \brief (USBC_UECON1SET) TXINE Set */
#define USBC_UECON1SET_TXINES       (_U(0x1) << USBC_UECON1SET_TXINES_Pos)
#define USBC_UECON1SET_RXOUTES_Pos  1            /**< \brief (USBC_UECON1SET) RXOUTE Set */
#define USBC_UECON1SET_RXOUTES      (_U(0x1) << USBC_UECON1SET_RXOUTES_Pos)
#define USBC_UECON1SET_RXSTPES_Pos  2            /**< \brief (USBC_UECON1SET) RXSTPE Set */
#define USBC_UECON1SET_RXSTPES      (_U(0x1) << USBC_UECON1SET_RXSTPES_Pos)
#define USBC_UECON1SET_NAKOUTES_Pos 3            /**< \brief (USBC_UECON1SET) NAKOUTE Set */
#define USBC_UECON1SET_NAKOUTES     (_U(0x1) << USBC_UECON1SET_NAKOUTES_Pos)
#define USBC_UECON1SET_NAKINES_Pos  4            /**< \brief (USBC_UECON1SET) NAKINE Set */
#define USBC_UECON1SET_NAKINES      (_U(0x1) << USBC_UECON1SET_NAKINES_Pos)
#define USBC_UECON1SET_STALLEDES_Pos 6            /**< \brief (USBC_UECON1SET) STALLEDE Set */
#define USBC_UECON1SET_STALLEDES    (_U(0x1) << USBC_UECON1SET_STALLEDES_Pos)
#define USBC_UECON1SET_NREPLYS_Pos  8            /**< \brief (USBC_UECON1SET) NREPLY Set */
#define USBC_UECON1SET_NREPLYS      (_U(0x1) << USBC_UECON1SET_NREPLYS_Pos)
#define USBC_UECON1SET_RAMACERES_Pos 11           /**< \brief (USBC_UECON1SET) RAMACERE Set */
#define USBC_UECON1SET_RAMACERES    (_U(0x1) << USBC_UECON1SET_RAMACERES_Pos)
#define USBC_UECON1SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UECON1SET) NBUSYBKE Set */
#define USBC_UECON1SET_NBUSYBKES    (_U(0x1) << USBC_UECON1SET_NBUSYBKES_Pos)
#define USBC_UECON1SET_KILLBKS_Pos  13           /**< \brief (USBC_UECON1SET) KILLBK Set */
#define USBC_UECON1SET_KILLBKS      (_U(0x1) << USBC_UECON1SET_KILLBKS_Pos)
#define USBC_UECON1SET_NYETDISS_Pos 17           /**< \brief (USBC_UECON1SET) NYETDIS Set */
#define USBC_UECON1SET_NYETDISS     (_U(0x1) << USBC_UECON1SET_NYETDISS_Pos)
#define USBC_UECON1SET_RSTDTS_Pos   18           /**< \brief (USBC_UECON1SET) RSTDT Set */
#define USBC_UECON1SET_RSTDTS       (_U(0x1) << USBC_UECON1SET_RSTDTS_Pos)
#define USBC_UECON1SET_STALLRQS_Pos 19           /**< \brief (USBC_UECON1SET) STALLRQ Set */
#define USBC_UECON1SET_STALLRQS     (_U(0x1) << USBC_UECON1SET_STALLRQS_Pos)
#define USBC_UECON1SET_BUSY0S_Pos   24           /**< \brief (USBC_UECON1SET) BUSY0 Set */
#define USBC_UECON1SET_BUSY0S       (_U(0x1) << USBC_UECON1SET_BUSY0S_Pos)
#define USBC_UECON1SET_BUSY1S_Pos   25           /**< \brief (USBC_UECON1SET) BUSY1 Set */
#define USBC_UECON1SET_BUSY1S       (_U(0x1) << USBC_UECON1SET_BUSY1S_Pos)
#define USBC_UECON1SET_MASK         _U(0x030E395F) /**< \brief (USBC_UECON1SET) MASK Register */

/* -------- USBC_UECON2SET : (USBC Offset: 0x1F8) ( /W 32) Endpoint Control Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINES:1;         /*!< bit:      0  TXINE Set                          */
    uint32_t RXOUTES:1;        /*!< bit:      1  RXOUTE Set                         */
    uint32_t RXSTPES:1;        /*!< bit:      2  RXSTPE Set                         */
    uint32_t NAKOUTES:1;       /*!< bit:      3  NAKOUTE Set                        */
    uint32_t NAKINES:1;        /*!< bit:      4  NAKINE Set                         */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDES:1;      /*!< bit:      6  STALLEDE Set                       */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLYS:1;        /*!< bit:      8  NREPLY Set                         */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACERES:1;      /*!< bit:     11  RAMACERE Set                       */
    uint32_t NBUSYBKES:1;      /*!< bit:     12  NBUSYBKE Set                       */
    uint32_t KILLBKS:1;        /*!< bit:     13  KILLBK Set                         */
    uint32_t :3;               /*!< bit: 14..16  Reserved                           */
    uint32_t NYETDISS:1;       /*!< bit:     17  NYETDIS Set                        */
    uint32_t RSTDTS:1;         /*!< bit:     18  RSTDT Set                          */
    uint32_t STALLRQS:1;       /*!< bit:     19  STALLRQ Set                        */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0S:1;         /*!< bit:     24  BUSY0 Set                          */
    uint32_t BUSY1S:1;         /*!< bit:     25  BUSY1 Set                          */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON2SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

