frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UECON2SET_OFFSET       0x1F8        /**< \brief (USBC_UECON2SET offset) Endpoint Control Set Register */
#define USBC_UECON2SET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UECON2SET reset_value) Endpoint Control Set Register */

#define USBC_UECON2SET_TXINES_Pos   0            /**< \brief (USBC_UECON2SET) TXINE Set */
#define USBC_UECON2SET_TXINES       (_U(0x1) << USBC_UECON2SET_TXINES_Pos)
#define USBC_UECON2SET_RXOUTES_Pos  1            /**< \brief (USBC_UECON2SET) RXOUTE Set */
#define USBC_UECON2SET_RXOUTES      (_U(0x1) << USBC_UECON2SET_RXOUTES_Pos)
#define USBC_UECON2SET_RXSTPES_Pos  2            /**< \brief (USBC_UECON2SET) RXSTPE Set */
#define USBC_UECON2SET_RXSTPES      (_U(0x1) << USBC_UECON2SET_RXSTPES_Pos)
#define USBC_UECON2SET_NAKOUTES_Pos 3            /**< \brief (USBC_UECON2SET) NAKOUTE Set */
#define USBC_UECON2SET_NAKOUTES     (_U(0x1) << USBC_UECON2SET_NAKOUTES_Pos)
#define USBC_UECON2SET_NAKINES_Pos  4            /**< \brief (USBC_UECON2SET) NAKINE Set */
#define USBC_UECON2SET_NAKINES      (_U(0x1) << USBC_UECON2SET_NAKINES_Pos)
#define USBC_UECON2SET_STALLEDES_Pos 6            /**< \brief (USBC_UECON2SET) STALLEDE Set */
#define USBC_UECON2SET_STALLEDES    (_U(0x1) << USBC_UECON2SET_STALLEDES_Pos)
#define USBC_UECON2SET_NREPLYS_Pos  8            /**< \brief (USBC_UECON2SET) NREPLY Set */
#define USBC_UECON2SET_NREPLYS      (_U(0x1) << USBC_UECON2SET_NREPLYS_Pos)
#define USBC_UECON2SET_RAMACERES_Pos 11           /**< \brief (USBC_UECON2SET) RAMACERE Set */
#define USBC_UECON2SET_RAMACERES    (_U(0x1) << USBC_UECON2SET_RAMACERES_Pos)
#define USBC_UECON2SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UECON2SET) NBUSYBKE Set */
#define USBC_UECON2SET_NBUSYBKES    (_U(0x1) << USBC_UECON2SET_NBUSYBKES_Pos)
#define USBC_UECON2SET_KILLBKS_Pos  13           /**< \brief (USBC_UECON2SET) KILLBK Set */
#define USBC_UECON2SET_KILLBKS      (_U(0x1) << USBC_UECON2SET_KILLBKS_Pos)
#define USBC_UECON2SET_NYETDISS_Pos 17           /**< \brief (USBC_UECON2SET) NYETDIS Set */
#define USBC_UECON2SET_NYETDISS     (_U(0x1) << USBC_UECON2SET_NYETDISS_Pos)
#define USBC_UECON2SET_RSTDTS_Pos   18           /**< \brief (USBC_UECON2SET) RSTDT Set */
#define USBC_UECON2SET_RSTDTS       (_U(0x1) << USBC_UECON2SET_RSTDTS_Pos)
#define USBC_UECON2SET_STALLRQS_Pos 19           /**< \brief (USBC_UECON2SET) STALLRQ Set */
#define USBC_UECON2SET_STALLRQS     (_U(0x1) << USBC_UECON2SET_STALLRQS_Pos)
#define USBC_UECON2SET_BUSY0S_Pos   24           /**< \brief (USBC_UECON2SET) BUSY0 Set */
#define USBC_UECON2SET_BUSY0S       (_U(0x1) << USBC_UECON2SET_BUSY0S_Pos)
#define USBC_UECON2SET_BUSY1S_Pos   25           /**< \brief (USBC_UECON2SET) BUSY1 Set */
#define USBC_UECON2SET_BUSY1S       (_U(0x1) << USBC_UECON2SET_BUSY1S_Pos)
#define USBC_UECON2SET_MASK         _U(0x030E395F) /**< \brief (USBC_UECON2SET) MASK Register */

/* -------- USBC_UECON3SET : (USBC Offset: 0x1FC) ( /W 32) Endpoint Control Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINES:1;         /*!< bit:      0  TXINE Set                          */
    uint32_t RXOUTES:1;        /*!< bit:      1  RXOUTE Set                         */
    uint32_t RXSTPES:1;        /*!< bit:      2  RXSTPE Set                         */
    uint32_t NAKOUTES:1;       /*!< bit:      3  NAKOUTE Set                        */
    uint32_t NAKINES:1;        /*!< bit:      4  NAKINE Set                         */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDES:1;      /*!< bit:      6  STALLEDE Set                       */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLYS:1;        /*!< bit:      8  NREPLY Set                         */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACERES:1;      /*!< bit:     11  RAMACERE Set                       */
    uint32_t NBUSYBKES:1;      /*!< bit:     12  NBUSYBKE Set                       */
    uint32_t KILLBKS:1;        /*!< bit:     13  KILLBK Set                         */
    uint32_t :3;               /*!< bit: 14..16  Reserved                           */
    uint32_t NYETDISS:1;       /*!< bit:     17  NYETDIS Set                        */
    uint32_t RSTDTS:1;         /*!< bit:     18  RSTDT Set                          */
    uint32_t STALLRQS:1;       /*!< bit:     19  STALLRQ Set                        */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0S:1;         /*!< bit:     24  BUSY0 Set                          */
    uint32_t BUSY1S:1;         /*!< bit:     25  BUSY1 Set                          */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON3SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECON3SET_OFFSET       0x1FC        /**< \brief (USBC_UECON3SET offset) Endpoint Control Set Register */
#define USBC_UECON3SET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UECON3SET reset_value) Endpoint Control Set Register */

#define USBC_UECON3SET_TXINES_Pos   0            /**< \brief (USBC_UECON3SET) TXINE Set */
#define USBC_UECON3SET_TXINES       (_U(0x1) << USBC_UECON3SET_TXINES_Pos)
#define USBC_UECON3SET_RXOUTES_Pos  1            /**< \brief (USBC_UECON3SET) RXOUTE Set */
#define USBC_UECON3SET_RXOUTES      (_U(0x1) << USBC_UECON3SET_RXOUTES_Pos)
#define USBC_UECON3SET_RXSTPES_Pos  2            /**< \brief (USBC_UECON3SET) RXSTPE Set */
#define USBC_UECON3SET_RXSTPES      (_U(0x1) << USBC_UECON3SET_RXSTPES_Pos)
#define USBC_UECON3SET_NAKOUTES_Pos 3            /**< \brief (USBC_UECON3SET) NAKOUTE Set */
#define USBC_UECON3SET_NAKOUTES     (_U(0x1) << USBC_UECON3SET_NAKOUTES_Pos)
#define USBC_UECON3SET_NAKINES_Pos  4            /**< \brief (USBC_UECON3SET) NAKINE Set */
#define USBC_UECON3SET_NAKINES      (_U(0x1) << USBC_UECON3SET_NAKINES_Pos)
#define USBC_UECON3SET_STALLEDES_Pos 6            /**< \brief (USBC_UECON3SET) STALLEDE Set */
#define USBC_UECON3SET_STALLEDES    (_U(0x1) << USBC_UECON3SET_STALLEDES_Pos)
#define USBC_UECON3SET_NREPLYS_Pos  8            /**< \brief (USBC_UECON3SET) NREPLY Set */
#define USBC_UECON3SET_NREPLYS      (_U(0x1) << USBC_UECON3SET_NREPLYS_Pos)
#define USBC_UECON3SET_RAMACERES_Pos 11           /**< \brief (USBC_UECON3SET) RAMACERE Set */
#define USBC_UECON3SET_RAMACERES    (_U(0x1) << USBC_UECON3SET_RAMACERES_Pos)
#define USBC_UECON3SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UECON3SET) NBUSYBKE Set */
#define USBC_UECON3SET_NBUSYBKES    (_U(0x1) << USBC_UECON3SET_NBUSYBKES_Pos)
#define USBC_UECON3SET_KILLBKS_Pos  13           /**< \brief (USBC_UECON3SET) KILLBK Set */
#define USBC_UECON3SET_KILLBKS      (_U(0x1) << USBC_UECON3SET_KILLBKS_Pos)
#define USBC_UECON3SET_NYETDISS_Pos 17           /**< \brief (USBC_UECON3SET) NYETDIS Set */
#define USBC_UECON3SET_NYETDISS     (_U(0x1) << USBC_UECON3SET_NYETDISS_Pos)
#define USBC_UECON3SET_RSTDTS_Pos   18           /**< \brief (USBC_UECON3SET) RSTDT Set */
#define USBC_UECON3SET_RSTDTS       (_U(0x1) << USBC_UECON3SET_RSTDTS_Pos)
#define USBC_UECON3SET_STALLRQS_Pos 19           /**< \brief (USBC_UECON3SET) STALLRQ Set */
#define USBC_UECON3SET_STALLRQS     (_U(0x1) << USBC_UECON3SET_STALLRQS_Pos)
#define USBC_UECON3SET_BUSY0S_Pos   24           /**< \brief (USBC_UECON3SET) BUSY0 Set */
#define USBC_UECON3SET_BUSY0S       (_U(0x1) << USBC_UECON3SET_BUSY0S_Pos)
#define USBC_UECON3SET_BUSY1S_Pos   25           /**< \brief (USBC_UECON3SET) BUSY1 Set */
#define USBC_UECON3SET_BUSY1S       (_U(0x1) << USBC_UECON3SET_BUSY1S_Pos)
#define USBC_UECON3SET_MASK         _U(0x030E395F) /**< \brief (USBC_UECON3SET) MASK Register */

/* -------- USBC_UECON4SET : (USBC Offset: 0x200) ( /W 32) Endpoint Control Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINES:1;         /*!< bit:      0  TXINE Set                          */
    uint32_t RXOUTES:1;        /*!< bit:      1  RXOUTE Set                         */
    uint32_t RXSTPES:1;        /*!< bit:      2  RXSTPE Set                         */
    uint32_t NAKOUTES:1;       /*!< bit:      3  NAKOUTE Set                        */
    uint32_t NAKINES:1;        /*!< bit:      4  NAKINE Set                         */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDES:1;      /*!< bit:      6  STALLEDE Set                       */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLYS:1;        /*!< bit:      8  NREPLY Set                         */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACERES:1;      /*!< bit:     11  RAMACERE Set                       */
    uint32_t NBUSYBKES:1;      /*!< bit:     12  NBUSYBKE Set                       */
    uint32_t KILLBKS:1;        /*!< bit:     13  KILLBK Set                         */
    uint32_t :3;               /*!< bit: 14..16  Reserved                           */
    uint32_t NYETDISS:1;       /*!< bit:     17  NYETDIS Set                        */
    uint32_t RSTDTS:1;         /*!< bit:     18  RSTDT Set                          */
    uint32_t STALLRQS:1;       /*!< bit:     19  STALLRQ Set                        */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0S:1;         /*!< bit:     24  BUSY0 Set                          */
    uint32_t BUSY1S:1;         /*!< bit:     25  BUSY1 Set                          */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON4SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECON4SET_OFFSET       0x200        /**< \brief (USBC_UECON4SET offset) Endpoint Control Set Register */
#define USBC_UECON4SET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UECON4SET reset_value) Endpoint Control Set Register */

#define USBC_UECON4SET_TXINES_Pos   0            /**< \brief (USBC_UECON4SET) TXINE Set */
#define USBC_UECON4SET_TXINES       (_U(0x1) << USBC_UECON4SET_TXINES_Pos)
#define USBC_UECON4SET_RXOUTES_Pos  1            /**< \brief (USBC_UECON4SET) RXOUTE Set */
#define USBC_UECON4SET_RXOUTES      (_U(0x1) << USBC_UECON4SET_RXOUTES_Pos)
#define USBC_UECON4SET_RXSTPES_Pos  2            /**< \brief (USBC_UECON4SET) RXSTPE Set */
#define USBC_UECON4SET_RXSTPES      (_U(0x1) << USBC_UECON4SET_RXSTPES_Pos)
#define USBC_UECON4SET_NAKOUTES_Pos 3            /**< \brief (USBC_UECON4SET) NAKOUTE Set */
#define USBC_UECON4SET_NAKOUTES     (_U(0x1) << USBC_UECON4SET_NAKOUTES_Pos)
#define USBC_UECON4SET_NAKINES_Pos  4            /**< \brief (USBC_UECON4SET) NAKINE Set */
#define USBC_UECON4SET_NAKINES      (_U(0x1) << USBC_UECON4SET_NAKINES_Pos)
#define USBC_UECON4SET_STALLEDES_Pos 6            /**< \brief (USBC_UECON4SET) STALLEDE Set */
#define USBC_UECON4SET_STALLEDES    (_U(0x1) << USBC_UECON4SET_STALLEDES_Pos)
#define USBC_UECON4SET_NREPLYS_Pos  8            /**< \brief (USBC_UECON4SET) NREPLY Set */
#define USBC_UECON4SET_NREPLYS      (_U(0x1) << USBC_UECON4SET_NREPLYS_Pos)
#define USBC_UECON4SET_RAMACERES_Pos 11           /**< \brief (USBC_UECON4SET) RAMACERE Set */
#define USBC_UECON4SET_RAMACERES    (_U(0x1) << USBC_UECON4SET_RAMACERES_Pos)
#define USBC_UECON4SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UECON4SET) NBUSYBKE Set */
#define USBC_UECON4SET_NBUSYBKES    (_U(0x1) << USBC_UECON4SET_NBUSYBKES_Pos)
#define USBC_UECON4SET_KILLBKS_Pos  13           /**< \brief (USBC_UECON4SET) KILLBK Set */
#define USBC_UECON4SET_KILLBKS      (_U(0x1) << USBC_UECON4SET_KILLBKS_Pos)
#define USBC_UECON4SET_NYETDISS_Pos 17           /**< \brief (USBC_UECON4SET) NYETDIS Set */
#define USBC_UECON4SET_NYETDISS     (_U(0x1) << USBC_UECON4SET_NYETDISS_Pos)
#define USBC_UECON4SET_RSTDTS_Pos   18           /**< \brief (USBC_UECON4SET) RSTDT Set */
#define USBC_UECON4SET_RSTDTS       (_U(0x1) << USBC_UECON4SET_RSTDTS_Pos)
#define USBC_UECON4SET_STALLRQS_Pos 19           /**< \brief (USBC_UECON4SET) STALLRQ Set */
#define USBC_UECON4SET_STALLRQS     (_U(0x1) << USBC_UECON4SET_STALLRQS_Pos)
#define USBC_UECON4SET_BUSY0S_Pos   24           /**< \brief (USBC_UECON4SET) BUSY0 Set */
#define USBC_UECON4SET_BUSY0S       (_U(0x1) << USBC_UECON4SET_BUSY0S_Pos)
#define USBC_UECON4SET_BUSY1S_Pos   25           /**< \brief (USBC_UECON4SET) BUSY1 Set */
#define USBC_UECON4SET_BUSY1S       (_U(0x1) << USBC_UECON4SET_BUSY1S_Pos)
#define USBC_UECON4SET_MASK         _U(0x030E395F) /**< \brief (USBC_UECON4SET) MASK Register */

/* -------- USBC_UECON5SET : (USBC Offset: 0x204) ( /W 32) Endpoint Control Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINES:1;         /*!< bit:      0  TXINE Set                          */
    uint32_t RXOUTES:1;        /*!< bit:      1  RXOUTE Set                         */
    uint32_t RXSTPES:1;        /*!< bit:      2  RXSTPE Set                         */
    uint32_t NAKOUTES:1;       /*!< bit:      3  NAKOUTE Set                        */
    uint32_t NAKINES:1;        /*!< bit:      4  NAKINE Set                         */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDES:1;      /*!< bit:      6  STALLEDE Set                       */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLYS:1;        /*!< bit:      8  NREPLY Set                         */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACERES:1;      /*!< bit:     11  RAMACERE Set                       */
    uint32_t NBUSYBKES:1;      /*!< bit:     12  NBUSYBKE Set                       */
    uint32_t KILLBKS:1;        /*!< bit:     13  KILLBK Set                         */
    uint32_t :3;               /*!< bit: 14..16  Reserved                           */
    uint32_t NYETDISS:1;       /*!< bit:     17  NYETDIS Set                        */
    uint32_t RSTDTS:1;         /*!< bit:     18  RSTDT Set                          */
    uint32_t STALLRQS:1;       /*!< bit:     19  STALLRQ Set                        */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0S:1;         /*!< bit:     24  BUSY0 Set                          */
    uint32_t BUSY1S:1;         /*!< bit:     25  BUSY1 Set                          */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON5SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECON5SET_OFFSET       0x204        /**< \brief (USBC_UECON5SET offset) Endpoint Control Set Register */
#define USBC_UECON5SET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UECON5SET reset_value) Endpoint Control Set Register */

#define USBC_UECON5SET_TXINES_Pos   0            /**< \brief (USBC_UECON5SET) TXINE Set */
#define USBC_UECON5SET_TXINES       (_U(0x1) << USBC_UECON5SET_TXINES_Pos)
#define USBC_UECON5SET_RXOUTES_Pos  1            /**< \brief (USBC_UECON5SET) RXOUTE Set */
#define USBC_UECON5SET_RXOUTES      (_U(0x1) << USBC_UECON5SET_RXOUTES_Pos)
#define USBC_UECON5SET_RXSTPES_Pos  2            /**< \brief (USBC_UECON5SET) RXSTPE Set */
#define USBC_UECON5SET_RXSTPES      (_U(0x1) << USBC_UECON5SET_RXSTPES_Pos)
#define USBC_UECON5SET_NAKOUTES_Pos 3            /**< \brief (USBC_UECON5SET) NAKOUTE Set */
#define USBC_UECON5SET_NAKOUTES     (_U(0x1) << USBC_UECON5SET_NAKOUTES_Pos)
#define USBC_UECON5SET_NAKINES_Pos  4            /**< \brief (USBC_UECON5SET) NAKINE Set */
#define USBC_UECON5SET_NAKINES      (_U(0x1) << USBC_UECON5SET_NAKINES_Pos)
#define USBC_UECON5SET_STALLEDES_Pos 6            /**< \brief (USBC_UECON5SET) STALLEDE Set */
#define USBC_UECON5SET_STALLEDES    (_U(0x1) << USBC_UECON5SET_STALLEDES_Pos)
#define USBC_UECON5SET_NREPLYS_Pos  8            /**< \brief (USBC_UECON5SET) NREPLY Set */
#define USBC_UECON5SET_NREPLYS      (_U(0x1) << USBC_UECON5SET_NREPLYS_Pos)
#define USBC_UECON5SET_RAMACERES_Pos 11           /**< \brief (USBC_UECON5SET) RAMACERE Set */
#define USBC_UECON5SET_RAMACERES    (_U(0x1) << USBC_UECON5SET_RAMACERES_Pos)
#define USBC_UECON5SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UECON5SET) NBUSYBKE Set */
#define USBC_UECON5SET_NBUSYBKES    (_U(0x1) << USBC_UECON5SET_NBUSYBKES_Pos)
#define USBC_UECON5SET_KILLBKS_Pos  13           /**< \brief (USBC_UECON5SET) KILLBK Set */
#define USBC_UECON5SET_KILLBKS      (_U(0x1) << USBC_UECON5SET_KILLBKS_Pos)
#define USBC_UECON5SET_NYETDISS_Pos 17           /**< \brief (USBC_UECON5SET) NYETDIS Set */
#define USBC_UECON5SET_NYETDISS     (_U(0x1) << USBC_UECON5SET_NYETDISS_Pos)
#define USBC_UECON5SET_RSTDTS_Pos   18           /**< \brief (USBC_UECON5SET) RSTDT Set */
#define USBC_UECON5SET_RSTDTS       (_U(0x1) << USBC_UECON5SET_RSTDTS_Pos)
#define USBC_UECON5SET_STALLRQS_Pos 19           /**< \brief (USBC_UECON5SET) STALLRQ Set */
#define USBC_UECON5SET_STALLRQS     (_U(0x1) << USBC_UECON5SET_STALLRQS_Pos)
#define USBC_UECON5SET_BUSY0S_Pos   24           /**< \brief (USBC_UECON5SET) BUSY0 Set */
#define USBC_UECON5SET_BUSY0S       (_U(0x1) << USBC_UECON5SET_BUSY0S_Pos)
#define USBC_UECON5SET_BUSY1S_Pos   25           /**< \brief (USBC_UECON5SET) BUSY1 Set */
#define USBC_UECON5SET_BUSY1S       (_U(0x1) << USBC_UECON5SET_BUSY1S_Pos)
#define USBC_UECON5SET_MASK         _U(0x030E395F) /**< \brief (USBC_UECON5SET) MASK Register */

/* -------- USBC_UECON6SET : (USBC Offset: 0x208) ( /W 32) Endpoint Control Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINES:1;         /*!< bit:      0  TXINE Set                          */
    uint32_t RXOUTES:1;        /*!< bit:      1  RXOUTE Set                         */
    uint32_t RXSTPES:1;        /*!< bit:      2  RXSTPE Set                         */
    uint32_t NAKOUTES:1;       /*!< bit:      3  NAKOUTE Set                        */
    uint32_t NAKINES:1;        /*!< bit:      4  NAKINE Set                         */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDES:1;      /*!< bit:      6  STALLEDE Set                       */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLYS:1;        /*!< bit:      8  NREPLY Set                         */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACERES:1;      /*!< bit:     11  RAMACERE Set                       */
    uint32_t NBUSYBKES:1;      /*!< bit:     12  NBUSYBKE Set                       */
    uint32_t KILLBKS:1;        /*!< bit:     13  KILLBK Set                         */
    uint32_t :3;               /*!< bit: 14..16  Reserved                           */
    uint32_t NYETDISS:1;       /*!< bit:     17  NYETDIS Set                        */
    uint32_t RSTDTS:1;         /*!< bit:     18  RSTDT Set                          */
    uint32_t STALLRQS:1;       /*!< bit:     19  STALLRQ Set                        */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0S:1;         /*!< bit:     24  BUSY0 Set                          */
    uint32_t BUSY1S:1;         /*!< bit:     25  BUSY1 Set                          */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON6SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECON6SET_OFFSET       0x208        /**< \brief (USBC_UECON6SET offset) Endpoint Control Set Register */
#define USBC_UECON6SET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UECON6SET reset_value) Endpoint Control Set Register */

