frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UECON6SET_TXINES_Pos   0            /**< \brief (USBC_UECON6SET) TXINE Set */
#define USBC_UECON6SET_TXINES       (_U(0x1) << USBC_UECON6SET_TXINES_Pos)
#define USBC_UECON6SET_RXOUTES_Pos  1            /**< \brief (USBC_UECON6SET) RXOUTE Set */
#define USBC_UECON6SET_RXOUTES      (_U(0x1) << USBC_UECON6SET_RXOUTES_Pos)
#define USBC_UECON6SET_RXSTPES_Pos  2            /**< \brief (USBC_UECON6SET) RXSTPE Set */
#define USBC_UECON6SET_RXSTPES      (_U(0x1) << USBC_UECON6SET_RXSTPES_Pos)
#define USBC_UECON6SET_NAKOUTES_Pos 3            /**< \brief (USBC_UECON6SET) NAKOUTE Set */
#define USBC_UECON6SET_NAKOUTES     (_U(0x1) << USBC_UECON6SET_NAKOUTES_Pos)
#define USBC_UECON6SET_NAKINES_Pos  4            /**< \brief (USBC_UECON6SET) NAKINE Set */
#define USBC_UECON6SET_NAKINES      (_U(0x1) << USBC_UECON6SET_NAKINES_Pos)
#define USBC_UECON6SET_STALLEDES_Pos 6            /**< \brief (USBC_UECON6SET) STALLEDE Set */
#define USBC_UECON6SET_STALLEDES    (_U(0x1) << USBC_UECON6SET_STALLEDES_Pos)
#define USBC_UECON6SET_NREPLYS_Pos  8            /**< \brief (USBC_UECON6SET) NREPLY Set */
#define USBC_UECON6SET_NREPLYS      (_U(0x1) << USBC_UECON6SET_NREPLYS_Pos)
#define USBC_UECON6SET_RAMACERES_Pos 11           /**< \brief (USBC_UECON6SET) RAMACERE Set */
#define USBC_UECON6SET_RAMACERES    (_U(0x1) << USBC_UECON6SET_RAMACERES_Pos)
#define USBC_UECON6SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UECON6SET) NBUSYBKE Set */
#define USBC_UECON6SET_NBUSYBKES    (_U(0x1) << USBC_UECON6SET_NBUSYBKES_Pos)
#define USBC_UECON6SET_KILLBKS_Pos  13           /**< \brief (USBC_UECON6SET) KILLBK Set */
#define USBC_UECON6SET_KILLBKS      (_U(0x1) << USBC_UECON6SET_KILLBKS_Pos)
#define USBC_UECON6SET_NYETDISS_Pos 17           /**< \brief (USBC_UECON6SET) NYETDIS Set */
#define USBC_UECON6SET_NYETDISS     (_U(0x1) << USBC_UECON6SET_NYETDISS_Pos)
#define USBC_UECON6SET_RSTDTS_Pos   18           /**< \brief (USBC_UECON6SET) RSTDT Set */
#define USBC_UECON6SET_RSTDTS       (_U(0x1) << USBC_UECON6SET_RSTDTS_Pos)
#define USBC_UECON6SET_STALLRQS_Pos 19           /**< \brief (USBC_UECON6SET) STALLRQ Set */
#define USBC_UECON6SET_STALLRQS     (_U(0x1) << USBC_UECON6SET_STALLRQS_Pos)
#define USBC_UECON6SET_BUSY0S_Pos   24           /**< \brief (USBC_UECON6SET) BUSY0 Set */
#define USBC_UECON6SET_BUSY0S       (_U(0x1) << USBC_UECON6SET_BUSY0S_Pos)
#define USBC_UECON6SET_BUSY1S_Pos   25           /**< \brief (USBC_UECON6SET) BUSY1 Set */
#define USBC_UECON6SET_BUSY1S       (_U(0x1) << USBC_UECON6SET_BUSY1S_Pos)
#define USBC_UECON6SET_MASK         _U(0x030E395F) /**< \brief (USBC_UECON6SET) MASK Register */

/* -------- USBC_UECON7SET : (USBC Offset: 0x20C) ( /W 32) Endpoint Control Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINES:1;         /*!< bit:      0  TXINE Set                          */
    uint32_t RXOUTES:1;        /*!< bit:      1  RXOUTE Set                         */
    uint32_t RXSTPES:1;        /*!< bit:      2  RXSTPE Set                         */
    uint32_t NAKOUTES:1;       /*!< bit:      3  NAKOUTE Set                        */
    uint32_t NAKINES:1;        /*!< bit:      4  NAKINE Set                         */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDES:1;      /*!< bit:      6  STALLEDE Set                       */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLYS:1;        /*!< bit:      8  NREPLY Set                         */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACERES:1;      /*!< bit:     11  RAMACERE Set                       */
    uint32_t NBUSYBKES:1;      /*!< bit:     12  NBUSYBKE Set                       */
    uint32_t KILLBKS:1;        /*!< bit:     13  KILLBK Set                         */
    uint32_t :3;               /*!< bit: 14..16  Reserved                           */
    uint32_t NYETDISS:1;       /*!< bit:     17  NYETDIS Set                        */
    uint32_t RSTDTS:1;         /*!< bit:     18  RSTDT Set                          */
    uint32_t STALLRQS:1;       /*!< bit:     19  STALLRQ Set                        */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0S:1;         /*!< bit:     24  BUSY0 Set                          */
    uint32_t BUSY1S:1;         /*!< bit:     25  BUSY1 Set                          */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON7SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECON7SET_OFFSET       0x20C        /**< \brief (USBC_UECON7SET offset) Endpoint Control Set Register */
#define USBC_UECON7SET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UECON7SET reset_value) Endpoint Control Set Register */

#define USBC_UECON7SET_TXINES_Pos   0            /**< \brief (USBC_UECON7SET) TXINE Set */
#define USBC_UECON7SET_TXINES       (_U(0x1) << USBC_UECON7SET_TXINES_Pos)
#define USBC_UECON7SET_RXOUTES_Pos  1            /**< \brief (USBC_UECON7SET) RXOUTE Set */
#define USBC_UECON7SET_RXOUTES      (_U(0x1) << USBC_UECON7SET_RXOUTES_Pos)
#define USBC_UECON7SET_RXSTPES_Pos  2            /**< \brief (USBC_UECON7SET) RXSTPE Set */
#define USBC_UECON7SET_RXSTPES      (_U(0x1) << USBC_UECON7SET_RXSTPES_Pos)
#define USBC_UECON7SET_NAKOUTES_Pos 3            /**< \brief (USBC_UECON7SET) NAKOUTE Set */
#define USBC_UECON7SET_NAKOUTES     (_U(0x1) << USBC_UECON7SET_NAKOUTES_Pos)
#define USBC_UECON7SET_NAKINES_Pos  4            /**< \brief (USBC_UECON7SET) NAKINE Set */
#define USBC_UECON7SET_NAKINES      (_U(0x1) << USBC_UECON7SET_NAKINES_Pos)
#define USBC_UECON7SET_STALLEDES_Pos 6            /**< \brief (USBC_UECON7SET) STALLEDE Set */
#define USBC_UECON7SET_STALLEDES    (_U(0x1) << USBC_UECON7SET_STALLEDES_Pos)
#define USBC_UECON7SET_NREPLYS_Pos  8            /**< \brief (USBC_UECON7SET) NREPLY Set */
#define USBC_UECON7SET_NREPLYS      (_U(0x1) << USBC_UECON7SET_NREPLYS_Pos)
#define USBC_UECON7SET_RAMACERES_Pos 11           /**< \brief (USBC_UECON7SET) RAMACERE Set */
#define USBC_UECON7SET_RAMACERES    (_U(0x1) << USBC_UECON7SET_RAMACERES_Pos)
#define USBC_UECON7SET_NBUSYBKES_Pos 12           /**< \brief (USBC_UECON7SET) NBUSYBKE Set */
#define USBC_UECON7SET_NBUSYBKES    (_U(0x1) << USBC_UECON7SET_NBUSYBKES_Pos)
#define USBC_UECON7SET_KILLBKS_Pos  13           /**< \brief (USBC_UECON7SET) KILLBK Set */
#define USBC_UECON7SET_KILLBKS      (_U(0x1) << USBC_UECON7SET_KILLBKS_Pos)
#define USBC_UECON7SET_NYETDISS_Pos 17           /**< \brief (USBC_UECON7SET) NYETDIS Set */
#define USBC_UECON7SET_NYETDISS     (_U(0x1) << USBC_UECON7SET_NYETDISS_Pos)
#define USBC_UECON7SET_RSTDTS_Pos   18           /**< \brief (USBC_UECON7SET) RSTDT Set */
#define USBC_UECON7SET_RSTDTS       (_U(0x1) << USBC_UECON7SET_RSTDTS_Pos)
#define USBC_UECON7SET_STALLRQS_Pos 19           /**< \brief (USBC_UECON7SET) STALLRQ Set */
#define USBC_UECON7SET_STALLRQS     (_U(0x1) << USBC_UECON7SET_STALLRQS_Pos)
#define USBC_UECON7SET_BUSY0S_Pos   24           /**< \brief (USBC_UECON7SET) BUSY0 Set */
#define USBC_UECON7SET_BUSY0S       (_U(0x1) << USBC_UECON7SET_BUSY0S_Pos)
#define USBC_UECON7SET_BUSY1S_Pos   25           /**< \brief (USBC_UECON7SET) BUSY1 Set */
#define USBC_UECON7SET_BUSY1S       (_U(0x1) << USBC_UECON7SET_BUSY1S_Pos)
#define USBC_UECON7SET_MASK         _U(0x030E395F) /**< \brief (USBC_UECON7SET) MASK Register */

/* -------- USBC_UECON0CLR : (USBC Offset: 0x220) ( /W 32) Endpoint Control Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINEC:1;         /*!< bit:      0  TXINE Clear                        */
    uint32_t RXOUTEC:1;        /*!< bit:      1  RXOUTE Clear                       */
    uint32_t RXSTPEC:1;        /*!< bit:      2  RXSTPE Clear                       */
    uint32_t NAKOUTEC:1;       /*!< bit:      3  NAKOUTE Clear                      */
    uint32_t NAKINEC:1;        /*!< bit:      4  NAKINE Clear                       */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDEC:1;      /*!< bit:      6  STALLEDE Clear                     */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLYC:1;        /*!< bit:      8  NREPLY Clear                       */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACEREC:1;      /*!< bit:     11  RAMACERE Clear                     */
    uint32_t NBUSYBKEC:1;      /*!< bit:     12  NBUSYBKE Clear                     */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t FIFOCONC:1;       /*!< bit:     14  FIFOCON Clear                      */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t NYETDISC:1;       /*!< bit:     17  NYETDIS Clear                      */
    uint32_t :1;               /*!< bit:     18  Reserved                           */
    uint32_t STALLRQC:1;       /*!< bit:     19  STALLRQ Clear                      */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0C:1;         /*!< bit:     24  BUSY0 Clear                        */
    uint32_t BUSY1C:1;         /*!< bit:     25  BUSY1 Clear                        */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON0CLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

