frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UECON0CLR_OFFSET       0x220        /**< \brief (USBC_UECON0CLR offset) Endpoint Control Clear Register */
#define USBC_UECON0CLR_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UECON0CLR reset_value) Endpoint Control Clear Register */

#define USBC_UECON0CLR_TXINEC_Pos   0            /**< \brief (USBC_UECON0CLR) TXINE Clear */
#define USBC_UECON0CLR_TXINEC       (_U(0x1) << USBC_UECON0CLR_TXINEC_Pos)
#define USBC_UECON0CLR_RXOUTEC_Pos  1            /**< \brief (USBC_UECON0CLR) RXOUTE Clear */
#define USBC_UECON0CLR_RXOUTEC      (_U(0x1) << USBC_UECON0CLR_RXOUTEC_Pos)
#define USBC_UECON0CLR_RXSTPEC_Pos  2            /**< \brief (USBC_UECON0CLR) RXSTPE Clear */
#define USBC_UECON0CLR_RXSTPEC      (_U(0x1) << USBC_UECON0CLR_RXSTPEC_Pos)
#define USBC_UECON0CLR_NAKOUTEC_Pos 3            /**< \brief (USBC_UECON0CLR) NAKOUTE Clear */
#define USBC_UECON0CLR_NAKOUTEC     (_U(0x1) << USBC_UECON0CLR_NAKOUTEC_Pos)
#define USBC_UECON0CLR_NAKINEC_Pos  4            /**< \brief (USBC_UECON0CLR) NAKINE Clear */
#define USBC_UECON0CLR_NAKINEC      (_U(0x1) << USBC_UECON0CLR_NAKINEC_Pos)
#define USBC_UECON0CLR_STALLEDEC_Pos 6            /**< \brief (USBC_UECON0CLR) STALLEDE Clear */
#define USBC_UECON0CLR_STALLEDEC    (_U(0x1) << USBC_UECON0CLR_STALLEDEC_Pos)
#define USBC_UECON0CLR_NREPLYC_Pos  8            /**< \brief (USBC_UECON0CLR) NREPLY Clear */
#define USBC_UECON0CLR_NREPLYC      (_U(0x1) << USBC_UECON0CLR_NREPLYC_Pos)
#define USBC_UECON0CLR_RAMACEREC_Pos 11           /**< \brief (USBC_UECON0CLR) RAMACERE Clear */
#define USBC_UECON0CLR_RAMACEREC    (_U(0x1) << USBC_UECON0CLR_RAMACEREC_Pos)
#define USBC_UECON0CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UECON0CLR) NBUSYBKE Clear */
#define USBC_UECON0CLR_NBUSYBKEC    (_U(0x1) << USBC_UECON0CLR_NBUSYBKEC_Pos)
#define USBC_UECON0CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UECON0CLR) FIFOCON Clear */
#define USBC_UECON0CLR_FIFOCONC     (_U(0x1) << USBC_UECON0CLR_FIFOCONC_Pos)
#define USBC_UECON0CLR_NYETDISC_Pos 17           /**< \brief (USBC_UECON0CLR) NYETDIS Clear */
#define USBC_UECON0CLR_NYETDISC     (_U(0x1) << USBC_UECON0CLR_NYETDISC_Pos)
#define USBC_UECON0CLR_STALLRQC_Pos 19           /**< \brief (USBC_UECON0CLR) STALLRQ Clear */
#define USBC_UECON0CLR_STALLRQC     (_U(0x1) << USBC_UECON0CLR_STALLRQC_Pos)
#define USBC_UECON0CLR_BUSY0C_Pos   24           /**< \brief (USBC_UECON0CLR) BUSY0 Clear */
#define USBC_UECON0CLR_BUSY0C       (_U(0x1) << USBC_UECON0CLR_BUSY0C_Pos)
#define USBC_UECON0CLR_BUSY1C_Pos   25           /**< \brief (USBC_UECON0CLR) BUSY1 Clear */
#define USBC_UECON0CLR_BUSY1C       (_U(0x1) << USBC_UECON0CLR_BUSY1C_Pos)
#define USBC_UECON0CLR_MASK         _U(0x030A595F) /**< \brief (USBC_UECON0CLR) MASK Register */

/* -------- USBC_UECON1CLR : (USBC Offset: 0x224) ( /W 32) TXINE Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINEC:1;         /*!< bit:      0  TXINE Clear                        */
    uint32_t RXOUTEC:1;        /*!< bit:      1  RXOUTE Clear                       */
    uint32_t RXSTPEC:1;        /*!< bit:      2  RXOUTE Clear                       */
    uint32_t NAKOUTEC:1;       /*!< bit:      3  NAKOUTE Clear                      */
    uint32_t NAKINEC:1;        /*!< bit:      4  NAKINE Clear                       */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDEC:1;      /*!< bit:      6  RXSTPE Clear                       */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLYC:1;        /*!< bit:      8  NREPLY Clear                       */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACEREC:1;      /*!< bit:     11  RAMACERE Clear                     */
    uint32_t NBUSYBKEC:1;      /*!< bit:     12  NBUSYBKE Clear                     */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t FIFOCONC:1;       /*!< bit:     14  FIFOCON Clear                      */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t NYETDISC:1;       /*!< bit:     17  NYETDIS Clear                      */
    uint32_t :1;               /*!< bit:     18  Reserved                           */
    uint32_t STALLRQC:1;       /*!< bit:     19  STALLEDE Clear                     */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0C:1;         /*!< bit:     24  BUSY0 Clear                        */
    uint32_t BUSY1C:1;         /*!< bit:     25  BUSY1 Clear                        */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON1CLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECON1CLR_OFFSET       0x224        /**< \brief (USBC_UECON1CLR offset) TXINE Clear */
#define USBC_UECON1CLR_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UECON1CLR reset_value) TXINE Clear */

#define USBC_UECON1CLR_TXINEC_Pos   0            /**< \brief (USBC_UECON1CLR) TXINE Clear */
#define USBC_UECON1CLR_TXINEC       (_U(0x1) << USBC_UECON1CLR_TXINEC_Pos)
#define USBC_UECON1CLR_RXOUTEC_Pos  1            /**< \brief (USBC_UECON1CLR) RXOUTE Clear */
#define USBC_UECON1CLR_RXOUTEC      (_U(0x1) << USBC_UECON1CLR_RXOUTEC_Pos)
#define USBC_UECON1CLR_RXSTPEC_Pos  2            /**< \brief (USBC_UECON1CLR) RXOUTE Clear */
#define USBC_UECON1CLR_RXSTPEC      (_U(0x1) << USBC_UECON1CLR_RXSTPEC_Pos)
#define USBC_UECON1CLR_NAKOUTEC_Pos 3            /**< \brief (USBC_UECON1CLR) NAKOUTE Clear */
#define USBC_UECON1CLR_NAKOUTEC     (_U(0x1) << USBC_UECON1CLR_NAKOUTEC_Pos)
#define USBC_UECON1CLR_NAKINEC_Pos  4            /**< \brief (USBC_UECON1CLR) NAKINE Clear */
#define USBC_UECON1CLR_NAKINEC      (_U(0x1) << USBC_UECON1CLR_NAKINEC_Pos)
#define USBC_UECON1CLR_STALLEDEC_Pos 6            /**< \brief (USBC_UECON1CLR) RXSTPE Clear */
#define USBC_UECON1CLR_STALLEDEC    (_U(0x1) << USBC_UECON1CLR_STALLEDEC_Pos)
#define USBC_UECON1CLR_NREPLYC_Pos  8            /**< \brief (USBC_UECON1CLR) NREPLY Clear */
#define USBC_UECON1CLR_NREPLYC      (_U(0x1) << USBC_UECON1CLR_NREPLYC_Pos)
#define USBC_UECON1CLR_RAMACEREC_Pos 11           /**< \brief (USBC_UECON1CLR) RAMACERE Clear */
#define USBC_UECON1CLR_RAMACEREC    (_U(0x1) << USBC_UECON1CLR_RAMACEREC_Pos)
#define USBC_UECON1CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UECON1CLR) NBUSYBKE Clear */
#define USBC_UECON1CLR_NBUSYBKEC    (_U(0x1) << USBC_UECON1CLR_NBUSYBKEC_Pos)
#define USBC_UECON1CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UECON1CLR) FIFOCON Clear */
#define USBC_UECON1CLR_FIFOCONC     (_U(0x1) << USBC_UECON1CLR_FIFOCONC_Pos)
#define USBC_UECON1CLR_NYETDISC_Pos 17           /**< \brief (USBC_UECON1CLR) NYETDIS Clear */
#define USBC_UECON1CLR_NYETDISC     (_U(0x1) << USBC_UECON1CLR_NYETDISC_Pos)
#define USBC_UECON1CLR_STALLRQC_Pos 19           /**< \brief (USBC_UECON1CLR) STALLEDE Clear */
#define USBC_UECON1CLR_STALLRQC     (_U(0x1) << USBC_UECON1CLR_STALLRQC_Pos)
#define USBC_UECON1CLR_BUSY0C_Pos   24           /**< \brief (USBC_UECON1CLR) BUSY0 Clear */
#define USBC_UECON1CLR_BUSY0C       (_U(0x1) << USBC_UECON1CLR_BUSY0C_Pos)
#define USBC_UECON1CLR_BUSY1C_Pos   25           /**< \brief (USBC_UECON1CLR) BUSY1 Clear */
#define USBC_UECON1CLR_BUSY1C       (_U(0x1) << USBC_UECON1CLR_BUSY1C_Pos)
#define USBC_UECON1CLR_MASK         _U(0x030A595F) /**< \brief (USBC_UECON1CLR) MASK Register */

/* -------- USBC_UECON2CLR : (USBC Offset: 0x228) ( /W 32) TXINE Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINEC:1;         /*!< bit:      0  TXINE Clear                        */
    uint32_t RXOUTEC:1;        /*!< bit:      1  RXOUTE Clear                       */
    uint32_t RXSTPEC:1;        /*!< bit:      2  RXOUTE Clear                       */
    uint32_t NAKOUTEC:1;       /*!< bit:      3  NAKOUTE Clear                      */
    uint32_t NAKINEC:1;        /*!< bit:      4  NAKINE Clear                       */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDEC:1;      /*!< bit:      6  RXSTPE Clear                       */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLYC:1;        /*!< bit:      8  NREPLY Clear                       */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACEREC:1;      /*!< bit:     11  RAMACERE Clear                     */
    uint32_t NBUSYBKEC:1;      /*!< bit:     12  NBUSYBKE Clear                     */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t FIFOCONC:1;       /*!< bit:     14  FIFOCON Clear                      */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t NYETDISC:1;       /*!< bit:     17  NYETDIS Clear                      */
    uint32_t :1;               /*!< bit:     18  Reserved                           */
    uint32_t STALLRQC:1;       /*!< bit:     19  STALLEDE Clear                     */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0C:1;         /*!< bit:     24  BUSY0 Clear                        */
    uint32_t BUSY1C:1;         /*!< bit:     25  BUSY1 Clear                        */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON2CLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

