frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/* -------- USBC_UECON6CLR : (USBC Offset: 0x238) ( /W 32) TXINE Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINEC:1;         /*!< bit:      0  TXINE Clear                        */
    uint32_t RXOUTEC:1;        /*!< bit:      1  RXOUTE Clear                       */
    uint32_t RXSTPEC:1;        /*!< bit:      2  RXOUTE Clear                       */
    uint32_t NAKOUTEC:1;       /*!< bit:      3  NAKOUTE Clear                      */
    uint32_t NAKINEC:1;        /*!< bit:      4  NAKINE Clear                       */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDEC:1;      /*!< bit:      6  RXSTPE Clear                       */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLYC:1;        /*!< bit:      8  NREPLY Clear                       */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACEREC:1;      /*!< bit:     11  RAMACERE Clear                     */
    uint32_t NBUSYBKEC:1;      /*!< bit:     12  NBUSYBKE Clear                     */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t FIFOCONC:1;       /*!< bit:     14  FIFOCON Clear                      */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t NYETDISC:1;       /*!< bit:     17  NYETDIS Clear                      */
    uint32_t :1;               /*!< bit:     18  Reserved                           */
    uint32_t STALLRQC:1;       /*!< bit:     19  STALLEDE Clear                     */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0C:1;         /*!< bit:     24  BUSY0 Clear                        */
    uint32_t BUSY1C:1;         /*!< bit:     25  BUSY1 Clear                        */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON6CLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECON6CLR_OFFSET       0x238        /**< \brief (USBC_UECON6CLR offset) TXINE Clear */
#define USBC_UECON6CLR_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UECON6CLR reset_value) TXINE Clear */

#define USBC_UECON6CLR_TXINEC_Pos   0            /**< \brief (USBC_UECON6CLR) TXINE Clear */
#define USBC_UECON6CLR_TXINEC       (_U(0x1) << USBC_UECON6CLR_TXINEC_Pos)
#define USBC_UECON6CLR_RXOUTEC_Pos  1            /**< \brief (USBC_UECON6CLR) RXOUTE Clear */
#define USBC_UECON6CLR_RXOUTEC      (_U(0x1) << USBC_UECON6CLR_RXOUTEC_Pos)
#define USBC_UECON6CLR_RXSTPEC_Pos  2            /**< \brief (USBC_UECON6CLR) RXOUTE Clear */
#define USBC_UECON6CLR_RXSTPEC      (_U(0x1) << USBC_UECON6CLR_RXSTPEC_Pos)
#define USBC_UECON6CLR_NAKOUTEC_Pos 3            /**< \brief (USBC_UECON6CLR) NAKOUTE Clear */
#define USBC_UECON6CLR_NAKOUTEC     (_U(0x1) << USBC_UECON6CLR_NAKOUTEC_Pos)
#define USBC_UECON6CLR_NAKINEC_Pos  4            /**< \brief (USBC_UECON6CLR) NAKINE Clear */
#define USBC_UECON6CLR_NAKINEC      (_U(0x1) << USBC_UECON6CLR_NAKINEC_Pos)
#define USBC_UECON6CLR_STALLEDEC_Pos 6            /**< \brief (USBC_UECON6CLR) RXSTPE Clear */
#define USBC_UECON6CLR_STALLEDEC    (_U(0x1) << USBC_UECON6CLR_STALLEDEC_Pos)
#define USBC_UECON6CLR_NREPLYC_Pos  8            /**< \brief (USBC_UECON6CLR) NREPLY Clear */
#define USBC_UECON6CLR_NREPLYC      (_U(0x1) << USBC_UECON6CLR_NREPLYC_Pos)
#define USBC_UECON6CLR_RAMACEREC_Pos 11           /**< \brief (USBC_UECON6CLR) RAMACERE Clear */
#define USBC_UECON6CLR_RAMACEREC    (_U(0x1) << USBC_UECON6CLR_RAMACEREC_Pos)
#define USBC_UECON6CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UECON6CLR) NBUSYBKE Clear */
#define USBC_UECON6CLR_NBUSYBKEC    (_U(0x1) << USBC_UECON6CLR_NBUSYBKEC_Pos)
#define USBC_UECON6CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UECON6CLR) FIFOCON Clear */
#define USBC_UECON6CLR_FIFOCONC     (_U(0x1) << USBC_UECON6CLR_FIFOCONC_Pos)
#define USBC_UECON6CLR_NYETDISC_Pos 17           /**< \brief (USBC_UECON6CLR) NYETDIS Clear */
#define USBC_UECON6CLR_NYETDISC     (_U(0x1) << USBC_UECON6CLR_NYETDISC_Pos)
#define USBC_UECON6CLR_STALLRQC_Pos 19           /**< \brief (USBC_UECON6CLR) STALLEDE Clear */
#define USBC_UECON6CLR_STALLRQC     (_U(0x1) << USBC_UECON6CLR_STALLRQC_Pos)
#define USBC_UECON6CLR_BUSY0C_Pos   24           /**< \brief (USBC_UECON6CLR) BUSY0 Clear */
#define USBC_UECON6CLR_BUSY0C       (_U(0x1) << USBC_UECON6CLR_BUSY0C_Pos)
#define USBC_UECON6CLR_BUSY1C_Pos   25           /**< \brief (USBC_UECON6CLR) BUSY1 Clear */
#define USBC_UECON6CLR_BUSY1C       (_U(0x1) << USBC_UECON6CLR_BUSY1C_Pos)
#define USBC_UECON6CLR_MASK         _U(0x030A595F) /**< \brief (USBC_UECON6CLR) MASK Register */

/* -------- USBC_UECON7CLR : (USBC Offset: 0x23C) ( /W 32) TXINE Clear -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXINEC:1;         /*!< bit:      0  TXINE Clear                        */
    uint32_t RXOUTEC:1;        /*!< bit:      1  RXOUTE Clear                       */
    uint32_t RXSTPEC:1;        /*!< bit:      2  RXOUTE Clear                       */
    uint32_t NAKOUTEC:1;       /*!< bit:      3  NAKOUTE Clear                      */
    uint32_t NAKINEC:1;        /*!< bit:      4  NAKINE Clear                       */
    uint32_t :1;               /*!< bit:      5  Reserved                           */
    uint32_t STALLEDEC:1;      /*!< bit:      6  RXSTPE Clear                       */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t NREPLYC:1;        /*!< bit:      8  NREPLY Clear                       */
    uint32_t :2;               /*!< bit:  9..10  Reserved                           */
    uint32_t RAMACEREC:1;      /*!< bit:     11  RAMACERE Clear                     */
    uint32_t NBUSYBKEC:1;      /*!< bit:     12  NBUSYBKE Clear                     */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t FIFOCONC:1;       /*!< bit:     14  FIFOCON Clear                      */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t NYETDISC:1;       /*!< bit:     17  NYETDIS Clear                      */
    uint32_t :1;               /*!< bit:     18  Reserved                           */
    uint32_t STALLRQC:1;       /*!< bit:     19  STALLEDE Clear                     */
    uint32_t :4;               /*!< bit: 20..23  Reserved                           */
    uint32_t BUSY0C:1;         /*!< bit:     24  BUSY0 Clear                        */
    uint32_t BUSY1C:1;         /*!< bit:     25  BUSY1 Clear                        */
    uint32_t :6;               /*!< bit: 26..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UECON7CLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UECON7CLR_OFFSET       0x23C        /**< \brief (USBC_UECON7CLR offset) TXINE Clear */
#define USBC_UECON7CLR_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UECON7CLR reset_value) TXINE Clear */

#define USBC_UECON7CLR_TXINEC_Pos   0            /**< \brief (USBC_UECON7CLR) TXINE Clear */
#define USBC_UECON7CLR_TXINEC       (_U(0x1) << USBC_UECON7CLR_TXINEC_Pos)
#define USBC_UECON7CLR_RXOUTEC_Pos  1            /**< \brief (USBC_UECON7CLR) RXOUTE Clear */
#define USBC_UECON7CLR_RXOUTEC      (_U(0x1) << USBC_UECON7CLR_RXOUTEC_Pos)
#define USBC_UECON7CLR_RXSTPEC_Pos  2            /**< \brief (USBC_UECON7CLR) RXOUTE Clear */
#define USBC_UECON7CLR_RXSTPEC      (_U(0x1) << USBC_UECON7CLR_RXSTPEC_Pos)
#define USBC_UECON7CLR_NAKOUTEC_Pos 3            /**< \brief (USBC_UECON7CLR) NAKOUTE Clear */
#define USBC_UECON7CLR_NAKOUTEC     (_U(0x1) << USBC_UECON7CLR_NAKOUTEC_Pos)
#define USBC_UECON7CLR_NAKINEC_Pos  4            /**< \brief (USBC_UECON7CLR) NAKINE Clear */
#define USBC_UECON7CLR_NAKINEC      (_U(0x1) << USBC_UECON7CLR_NAKINEC_Pos)
#define USBC_UECON7CLR_STALLEDEC_Pos 6            /**< \brief (USBC_UECON7CLR) RXSTPE Clear */
#define USBC_UECON7CLR_STALLEDEC    (_U(0x1) << USBC_UECON7CLR_STALLEDEC_Pos)
#define USBC_UECON7CLR_NREPLYC_Pos  8            /**< \brief (USBC_UECON7CLR) NREPLY Clear */
#define USBC_UECON7CLR_NREPLYC      (_U(0x1) << USBC_UECON7CLR_NREPLYC_Pos)
#define USBC_UECON7CLR_RAMACEREC_Pos 11           /**< \brief (USBC_UECON7CLR) RAMACERE Clear */
#define USBC_UECON7CLR_RAMACEREC    (_U(0x1) << USBC_UECON7CLR_RAMACEREC_Pos)
#define USBC_UECON7CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UECON7CLR) NBUSYBKE Clear */
#define USBC_UECON7CLR_NBUSYBKEC    (_U(0x1) << USBC_UECON7CLR_NBUSYBKEC_Pos)
#define USBC_UECON7CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UECON7CLR) FIFOCON Clear */
#define USBC_UECON7CLR_FIFOCONC     (_U(0x1) << USBC_UECON7CLR_FIFOCONC_Pos)
#define USBC_UECON7CLR_NYETDISC_Pos 17           /**< \brief (USBC_UECON7CLR) NYETDIS Clear */
#define USBC_UECON7CLR_NYETDISC     (_U(0x1) << USBC_UECON7CLR_NYETDISC_Pos)
#define USBC_UECON7CLR_STALLRQC_Pos 19           /**< \brief (USBC_UECON7CLR) STALLEDE Clear */
#define USBC_UECON7CLR_STALLRQC     (_U(0x1) << USBC_UECON7CLR_STALLRQC_Pos)
#define USBC_UECON7CLR_BUSY0C_Pos   24           /**< \brief (USBC_UECON7CLR) BUSY0 Clear */
#define USBC_UECON7CLR_BUSY0C       (_U(0x1) << USBC_UECON7CLR_BUSY0C_Pos)
#define USBC_UECON7CLR_BUSY1C_Pos   25           /**< \brief (USBC_UECON7CLR) BUSY1 Clear */
#define USBC_UECON7CLR_BUSY1C       (_U(0x1) << USBC_UECON7CLR_BUSY1C_Pos)
#define USBC_UECON7CLR_MASK         _U(0x030A595F) /**< \brief (USBC_UECON7CLR) MASK Register */

/* -------- USBC_UHCON : (USBC Offset: 0x400) (R/W 32) Host General Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :8;               /*!< bit:  0.. 7  Reserved                           */
    uint32_t SOFE:1;           /*!< bit:      8  SOF Enable                         */
    uint32_t RESET:1;          /*!< bit:      9  Send USB Reset                     */
    uint32_t RESUME:1;         /*!< bit:     10  Send USB Resume                    */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t SPDCONF:2;        /*!< bit: 12..13  Speed Configuration                */
    uint32_t :2;               /*!< bit: 14..15  Reserved                           */
    uint32_t TSTJ:1;           /*!< bit:     16  Test J                             */
    uint32_t TSTK:1;           /*!< bit:     17  Test K                             */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UHCON_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

