frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UPCFG1_OFFSET          0x504        /**< \brief (USBC_UPCFG1 offset) Pipe Configuration Register */
#define USBC_UPCFG1_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPCFG1 reset_value) Pipe Configuration Register */

#define USBC_UPCFG1_PBK_Pos         2            /**< \brief (USBC_UPCFG1) Pipe Banks */
#define USBC_UPCFG1_PBK             (_U(0x1) << USBC_UPCFG1_PBK_Pos)
#define   USBC_UPCFG1_PBK_SINGLE_Val      _U(0x0)   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PBK_DOUBLE_Val      _U(0x1)   /**< \brief (USBC_UPCFG1)  */
#define USBC_UPCFG1_PBK_SINGLE      (USBC_UPCFG1_PBK_SINGLE_Val    << USBC_UPCFG1_PBK_Pos)
#define USBC_UPCFG1_PBK_DOUBLE      (USBC_UPCFG1_PBK_DOUBLE_Val    << USBC_UPCFG1_PBK_Pos)
#define USBC_UPCFG1_PSIZE_Pos       4            /**< \brief (USBC_UPCFG1) Pipe Size */
#define USBC_UPCFG1_PSIZE_Msk       (_U(0x7) << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE(value)    (USBC_UPCFG1_PSIZE_Msk & ((value) << USBC_UPCFG1_PSIZE_Pos))
#define   USBC_UPCFG1_PSIZE_8_Val         _U(0x0)   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_16_Val        _U(0x1)   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_32_Val        _U(0x2)   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_64_Val        _U(0x3)   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_128_Val       _U(0x4)   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_256_Val       _U(0x5)   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_512_Val       _U(0x6)   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_1024_Val      _U(0x7)   /**< \brief (USBC_UPCFG1)  */
#define USBC_UPCFG1_PSIZE_8         (USBC_UPCFG1_PSIZE_8_Val       << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE_16        (USBC_UPCFG1_PSIZE_16_Val      << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE_32        (USBC_UPCFG1_PSIZE_32_Val      << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE_64        (USBC_UPCFG1_PSIZE_64_Val      << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE_128       (USBC_UPCFG1_PSIZE_128_Val     << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE_256       (USBC_UPCFG1_PSIZE_256_Val     << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE_512       (USBC_UPCFG1_PSIZE_512_Val     << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PSIZE_1024      (USBC_UPCFG1_PSIZE_1024_Val    << USBC_UPCFG1_PSIZE_Pos)
#define USBC_UPCFG1_PTOKEN_Pos      8            /**< \brief (USBC_UPCFG1) Pipe Token */
#define USBC_UPCFG1_PTOKEN_Msk      (_U(0x3) << USBC_UPCFG1_PTOKEN_Pos)
#define USBC_UPCFG1_PTOKEN(value)   (USBC_UPCFG1_PTOKEN_Msk & ((value) << USBC_UPCFG1_PTOKEN_Pos))
#define   USBC_UPCFG1_PTOKEN_SETUP_Val    _U(0x0)   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PTOKEN_IN_Val       _U(0x1)   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PTOKEN_OUT_Val      _U(0x2)   /**< \brief (USBC_UPCFG1)  */
#define USBC_UPCFG1_PTOKEN_SETUP    (USBC_UPCFG1_PTOKEN_SETUP_Val  << USBC_UPCFG1_PTOKEN_Pos)
#define USBC_UPCFG1_PTOKEN_IN       (USBC_UPCFG1_PTOKEN_IN_Val     << USBC_UPCFG1_PTOKEN_Pos)
#define USBC_UPCFG1_PTOKEN_OUT      (USBC_UPCFG1_PTOKEN_OUT_Val    << USBC_UPCFG1_PTOKEN_Pos)
#define USBC_UPCFG1_PTYPE_Pos       12           /**< \brief (USBC_UPCFG1) Pipe Type */
#define USBC_UPCFG1_PTYPE_Msk       (_U(0x3) << USBC_UPCFG1_PTYPE_Pos)
#define USBC_UPCFG1_PTYPE(value)    (USBC_UPCFG1_PTYPE_Msk & ((value) << USBC_UPCFG1_PTYPE_Pos))
#define   USBC_UPCFG1_PTYPE_CONTROL_Val   _U(0x0)   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PTYPE_ISOCHRONOUS_Val _U(0x1)   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PTYPE_BULK_Val      _U(0x2)   /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PTYPE_INTERRUPT_Val _U(0x3)   /**< \brief (USBC_UPCFG1)  */
#define USBC_UPCFG1_PTYPE_CONTROL   (USBC_UPCFG1_PTYPE_CONTROL_Val << USBC_UPCFG1_PTYPE_Pos)
#define USBC_UPCFG1_PTYPE_ISOCHRONOUS (USBC_UPCFG1_PTYPE_ISOCHRONOUS_Val << USBC_UPCFG1_PTYPE_Pos)
#define USBC_UPCFG1_PTYPE_BULK      (USBC_UPCFG1_PTYPE_BULK_Val    << USBC_UPCFG1_PTYPE_Pos)
#define USBC_UPCFG1_PTYPE_INTERRUPT (USBC_UPCFG1_PTYPE_INTERRUPT_Val << USBC_UPCFG1_PTYPE_Pos)
#define USBC_UPCFG1_PINGEN_Pos      20           /**< \brief (USBC_UPCFG1) Ping Enable */
#define USBC_UPCFG1_PINGEN          (_U(0x1) << USBC_UPCFG1_PINGEN_Pos)
#define USBC_UPCFG1_BINTERVAL_Pos   24           /**< \brief (USBC_UPCFG1) binterval parameter */
#define USBC_UPCFG1_BINTERVAL_Msk   (_U(0xFF) << USBC_UPCFG1_BINTERVAL_Pos)
#define USBC_UPCFG1_BINTERVAL(value) (USBC_UPCFG1_BINTERVAL_Msk & ((value) << USBC_UPCFG1_BINTERVAL_Pos))
#define USBC_UPCFG1_MASK            _U(0xFF103374) /**< \brief (USBC_UPCFG1) MASK Register */

/* -------- USBC_UPCFG2 : (USBC Offset: 0x508) (R/W 32) Pipe Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t PBK:1;            /*!< bit:      2  Pipe Banks                         */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t PSIZE:3;          /*!< bit:  4.. 6  Pipe Size                          */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t PTOKEN:2;         /*!< bit:  8.. 9  Pipe Token                         */
    uint32_t :2;               /*!< bit: 10..11  Reserved                           */
    uint32_t PTYPE:2;          /*!< bit: 12..13  Pipe Type                          */
    uint32_t :6;               /*!< bit: 14..19  Reserved                           */
    uint32_t PINGEN:1;         /*!< bit:     20  Ping Enable                        */
    uint32_t :3;               /*!< bit: 21..23  Reserved                           */
    uint32_t BINTERVAL:8;      /*!< bit: 24..31  binterval parameter                */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPCFG2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPCFG2_OFFSET          0x508        /**< \brief (USBC_UPCFG2 offset) Pipe Configuration Register */
#define USBC_UPCFG2_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPCFG2 reset_value) Pipe Configuration Register */

#define USBC_UPCFG2_PBK_Pos         2            /**< \brief (USBC_UPCFG2) Pipe Banks */
#define USBC_UPCFG2_PBK             (_U(0x1) << USBC_UPCFG2_PBK_Pos)
#define   USBC_UPCFG2_PBK_SINGLE_Val      _U(0x0)   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PBK_DOUBLE_Val      _U(0x1)   /**< \brief (USBC_UPCFG2)  */
#define USBC_UPCFG2_PBK_SINGLE      (USBC_UPCFG2_PBK_SINGLE_Val    << USBC_UPCFG2_PBK_Pos)
#define USBC_UPCFG2_PBK_DOUBLE      (USBC_UPCFG2_PBK_DOUBLE_Val    << USBC_UPCFG2_PBK_Pos)
#define USBC_UPCFG2_PSIZE_Pos       4            /**< \brief (USBC_UPCFG2) Pipe Size */
#define USBC_UPCFG2_PSIZE_Msk       (_U(0x7) << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE(value)    (USBC_UPCFG2_PSIZE_Msk & ((value) << USBC_UPCFG2_PSIZE_Pos))
#define   USBC_UPCFG2_PSIZE_8_Val         _U(0x0)   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_16_Val        _U(0x1)   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_32_Val        _U(0x2)   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_64_Val        _U(0x3)   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_128_Val       _U(0x4)   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_256_Val       _U(0x5)   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_512_Val       _U(0x6)   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_1024_Val      _U(0x7)   /**< \brief (USBC_UPCFG2)  */
#define USBC_UPCFG2_PSIZE_8         (USBC_UPCFG2_PSIZE_8_Val       << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE_16        (USBC_UPCFG2_PSIZE_16_Val      << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE_32        (USBC_UPCFG2_PSIZE_32_Val      << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE_64        (USBC_UPCFG2_PSIZE_64_Val      << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE_128       (USBC_UPCFG2_PSIZE_128_Val     << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE_256       (USBC_UPCFG2_PSIZE_256_Val     << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE_512       (USBC_UPCFG2_PSIZE_512_Val     << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PSIZE_1024      (USBC_UPCFG2_PSIZE_1024_Val    << USBC_UPCFG2_PSIZE_Pos)
#define USBC_UPCFG2_PTOKEN_Pos      8            /**< \brief (USBC_UPCFG2) Pipe Token */
#define USBC_UPCFG2_PTOKEN_Msk      (_U(0x3) << USBC_UPCFG2_PTOKEN_Pos)
#define USBC_UPCFG2_PTOKEN(value)   (USBC_UPCFG2_PTOKEN_Msk & ((value) << USBC_UPCFG2_PTOKEN_Pos))
#define   USBC_UPCFG2_PTOKEN_SETUP_Val    _U(0x0)   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PTOKEN_IN_Val       _U(0x1)   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PTOKEN_OUT_Val      _U(0x2)   /**< \brief (USBC_UPCFG2)  */
#define USBC_UPCFG2_PTOKEN_SETUP    (USBC_UPCFG2_PTOKEN_SETUP_Val  << USBC_UPCFG2_PTOKEN_Pos)
#define USBC_UPCFG2_PTOKEN_IN       (USBC_UPCFG2_PTOKEN_IN_Val     << USBC_UPCFG2_PTOKEN_Pos)
#define USBC_UPCFG2_PTOKEN_OUT      (USBC_UPCFG2_PTOKEN_OUT_Val    << USBC_UPCFG2_PTOKEN_Pos)
#define USBC_UPCFG2_PTYPE_Pos       12           /**< \brief (USBC_UPCFG2) Pipe Type */
#define USBC_UPCFG2_PTYPE_Msk       (_U(0x3) << USBC_UPCFG2_PTYPE_Pos)
#define USBC_UPCFG2_PTYPE(value)    (USBC_UPCFG2_PTYPE_Msk & ((value) << USBC_UPCFG2_PTYPE_Pos))
#define   USBC_UPCFG2_PTYPE_CONTROL_Val   _U(0x0)   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PTYPE_ISOCHRONOUS_Val _U(0x1)   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PTYPE_BULK_Val      _U(0x2)   /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PTYPE_INTERRUPT_Val _U(0x3)   /**< \brief (USBC_UPCFG2)  */
#define USBC_UPCFG2_PTYPE_CONTROL   (USBC_UPCFG2_PTYPE_CONTROL_Val << USBC_UPCFG2_PTYPE_Pos)
#define USBC_UPCFG2_PTYPE_ISOCHRONOUS (USBC_UPCFG2_PTYPE_ISOCHRONOUS_Val << USBC_UPCFG2_PTYPE_Pos)
#define USBC_UPCFG2_PTYPE_BULK      (USBC_UPCFG2_PTYPE_BULK_Val    << USBC_UPCFG2_PTYPE_Pos)
#define USBC_UPCFG2_PTYPE_INTERRUPT (USBC_UPCFG2_PTYPE_INTERRUPT_Val << USBC_UPCFG2_PTYPE_Pos)
#define USBC_UPCFG2_PINGEN_Pos      20           /**< \brief (USBC_UPCFG2) Ping Enable */
#define USBC_UPCFG2_PINGEN          (_U(0x1) << USBC_UPCFG2_PINGEN_Pos)
#define USBC_UPCFG2_BINTERVAL_Pos   24           /**< \brief (USBC_UPCFG2) binterval parameter */
#define USBC_UPCFG2_BINTERVAL_Msk   (_U(0xFF) << USBC_UPCFG2_BINTERVAL_Pos)
#define USBC_UPCFG2_BINTERVAL(value) (USBC_UPCFG2_BINTERVAL_Msk & ((value) << USBC_UPCFG2_BINTERVAL_Pos))
#define USBC_UPCFG2_MASK            _U(0xFF103374) /**< \brief (USBC_UPCFG2) MASK Register */

/* -------- USBC_UPCFG3 : (USBC Offset: 0x50C) (R/W 32) Pipe Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t PBK:1;            /*!< bit:      2  Pipe Banks                         */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t PSIZE:3;          /*!< bit:  4.. 6  Pipe Size                          */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t PTOKEN:2;         /*!< bit:  8.. 9  Pipe Token                         */
    uint32_t :2;               /*!< bit: 10..11  Reserved                           */
    uint32_t PTYPE:2;          /*!< bit: 12..13  Pipe Type                          */
    uint32_t :6;               /*!< bit: 14..19  Reserved                           */
    uint32_t PINGEN:1;         /*!< bit:     20  Ping Enable                        */
    uint32_t :3;               /*!< bit: 21..23  Reserved                           */
    uint32_t BINTERVAL:8;      /*!< bit: 24..31  binterval parameter                */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPCFG3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

