frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/* -------- USBC_UPCFG6 : (USBC Offset: 0x518) (R/W 32) Pipe Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t PBK:1;            /*!< bit:      2  Pipe Banks                         */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t PSIZE:3;          /*!< bit:  4.. 6  Pipe Size                          */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t PTOKEN:2;         /*!< bit:  8.. 9  Pipe Token                         */
    uint32_t :2;               /*!< bit: 10..11  Reserved                           */
    uint32_t PTYPE:2;          /*!< bit: 12..13  Pipe Type                          */
    uint32_t :6;               /*!< bit: 14..19  Reserved                           */
    uint32_t PINGEN:1;         /*!< bit:     20  Ping Enable                        */
    uint32_t :3;               /*!< bit: 21..23  Reserved                           */
    uint32_t BINTERVAL:8;      /*!< bit: 24..31  binterval parameter                */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPCFG6_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPCFG6_OFFSET          0x518        /**< \brief (USBC_UPCFG6 offset) Pipe Configuration Register */
#define USBC_UPCFG6_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPCFG6 reset_value) Pipe Configuration Register */

#define USBC_UPCFG6_PBK_Pos         2            /**< \brief (USBC_UPCFG6) Pipe Banks */
#define USBC_UPCFG6_PBK             (_U(0x1) << USBC_UPCFG6_PBK_Pos)
#define   USBC_UPCFG6_PBK_SINGLE_Val      _U(0x0)   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PBK_DOUBLE_Val      _U(0x1)   /**< \brief (USBC_UPCFG6)  */
#define USBC_UPCFG6_PBK_SINGLE      (USBC_UPCFG6_PBK_SINGLE_Val    << USBC_UPCFG6_PBK_Pos)
#define USBC_UPCFG6_PBK_DOUBLE      (USBC_UPCFG6_PBK_DOUBLE_Val    << USBC_UPCFG6_PBK_Pos)
#define USBC_UPCFG6_PSIZE_Pos       4            /**< \brief (USBC_UPCFG6) Pipe Size */
#define USBC_UPCFG6_PSIZE_Msk       (_U(0x7) << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE(value)    (USBC_UPCFG6_PSIZE_Msk & ((value) << USBC_UPCFG6_PSIZE_Pos))
#define   USBC_UPCFG6_PSIZE_8_Val         _U(0x0)   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_16_Val        _U(0x1)   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_32_Val        _U(0x2)   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_64_Val        _U(0x3)   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_128_Val       _U(0x4)   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_256_Val       _U(0x5)   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_512_Val       _U(0x6)   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_1024_Val      _U(0x7)   /**< \brief (USBC_UPCFG6)  */
#define USBC_UPCFG6_PSIZE_8         (USBC_UPCFG6_PSIZE_8_Val       << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE_16        (USBC_UPCFG6_PSIZE_16_Val      << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE_32        (USBC_UPCFG6_PSIZE_32_Val      << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE_64        (USBC_UPCFG6_PSIZE_64_Val      << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE_128       (USBC_UPCFG6_PSIZE_128_Val     << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE_256       (USBC_UPCFG6_PSIZE_256_Val     << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE_512       (USBC_UPCFG6_PSIZE_512_Val     << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PSIZE_1024      (USBC_UPCFG6_PSIZE_1024_Val    << USBC_UPCFG6_PSIZE_Pos)
#define USBC_UPCFG6_PTOKEN_Pos      8            /**< \brief (USBC_UPCFG6) Pipe Token */
#define USBC_UPCFG6_PTOKEN_Msk      (_U(0x3) << USBC_UPCFG6_PTOKEN_Pos)
#define USBC_UPCFG6_PTOKEN(value)   (USBC_UPCFG6_PTOKEN_Msk & ((value) << USBC_UPCFG6_PTOKEN_Pos))
#define   USBC_UPCFG6_PTOKEN_SETUP_Val    _U(0x0)   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PTOKEN_IN_Val       _U(0x1)   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PTOKEN_OUT_Val      _U(0x2)   /**< \brief (USBC_UPCFG6)  */
#define USBC_UPCFG6_PTOKEN_SETUP    (USBC_UPCFG6_PTOKEN_SETUP_Val  << USBC_UPCFG6_PTOKEN_Pos)
#define USBC_UPCFG6_PTOKEN_IN       (USBC_UPCFG6_PTOKEN_IN_Val     << USBC_UPCFG6_PTOKEN_Pos)
#define USBC_UPCFG6_PTOKEN_OUT      (USBC_UPCFG6_PTOKEN_OUT_Val    << USBC_UPCFG6_PTOKEN_Pos)
#define USBC_UPCFG6_PTYPE_Pos       12           /**< \brief (USBC_UPCFG6) Pipe Type */
#define USBC_UPCFG6_PTYPE_Msk       (_U(0x3) << USBC_UPCFG6_PTYPE_Pos)
#define USBC_UPCFG6_PTYPE(value)    (USBC_UPCFG6_PTYPE_Msk & ((value) << USBC_UPCFG6_PTYPE_Pos))
#define   USBC_UPCFG6_PTYPE_CONTROL_Val   _U(0x0)   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PTYPE_ISOCHRONOUS_Val _U(0x1)   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PTYPE_BULK_Val      _U(0x2)   /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PTYPE_INTERRUPT_Val _U(0x3)   /**< \brief (USBC_UPCFG6)  */
#define USBC_UPCFG6_PTYPE_CONTROL   (USBC_UPCFG6_PTYPE_CONTROL_Val << USBC_UPCFG6_PTYPE_Pos)
#define USBC_UPCFG6_PTYPE_ISOCHRONOUS (USBC_UPCFG6_PTYPE_ISOCHRONOUS_Val << USBC_UPCFG6_PTYPE_Pos)
#define USBC_UPCFG6_PTYPE_BULK      (USBC_UPCFG6_PTYPE_BULK_Val    << USBC_UPCFG6_PTYPE_Pos)
#define USBC_UPCFG6_PTYPE_INTERRUPT (USBC_UPCFG6_PTYPE_INTERRUPT_Val << USBC_UPCFG6_PTYPE_Pos)
#define USBC_UPCFG6_PINGEN_Pos      20           /**< \brief (USBC_UPCFG6) Ping Enable */
#define USBC_UPCFG6_PINGEN          (_U(0x1) << USBC_UPCFG6_PINGEN_Pos)
#define USBC_UPCFG6_BINTERVAL_Pos   24           /**< \brief (USBC_UPCFG6) binterval parameter */
#define USBC_UPCFG6_BINTERVAL_Msk   (_U(0xFF) << USBC_UPCFG6_BINTERVAL_Pos)
#define USBC_UPCFG6_BINTERVAL(value) (USBC_UPCFG6_BINTERVAL_Msk & ((value) << USBC_UPCFG6_BINTERVAL_Pos))
#define USBC_UPCFG6_MASK            _U(0xFF103374) /**< \brief (USBC_UPCFG6) MASK Register */

/* -------- USBC_UPCFG7 : (USBC Offset: 0x51C) (R/W 32) Pipe Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :2;               /*!< bit:  0.. 1  Reserved                           */
    uint32_t PBK:1;            /*!< bit:      2  Pipe Banks                         */
    uint32_t :1;               /*!< bit:      3  Reserved                           */
    uint32_t PSIZE:3;          /*!< bit:  4.. 6  Pipe Size                          */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t PTOKEN:2;         /*!< bit:  8.. 9  Pipe Token                         */
    uint32_t :2;               /*!< bit: 10..11  Reserved                           */
    uint32_t PTYPE:2;          /*!< bit: 12..13  Pipe Type                          */
    uint32_t :6;               /*!< bit: 14..19  Reserved                           */
    uint32_t PINGEN:1;         /*!< bit:     20  Ping Enable                        */
    uint32_t :3;               /*!< bit: 21..23  Reserved                           */
    uint32_t BINTERVAL:8;      /*!< bit: 24..31  binterval parameter                */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPCFG7_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

