frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UPCFG7_OFFSET          0x51C        /**< \brief (USBC_UPCFG7 offset) Pipe Configuration Register */
#define USBC_UPCFG7_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPCFG7 reset_value) Pipe Configuration Register */

#define USBC_UPCFG7_PBK_Pos         2            /**< \brief (USBC_UPCFG7) Pipe Banks */
#define USBC_UPCFG7_PBK             (_U(0x1) << USBC_UPCFG7_PBK_Pos)
#define   USBC_UPCFG7_PBK_SINGLE_Val      _U(0x0)   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PBK_DOUBLE_Val      _U(0x1)   /**< \brief (USBC_UPCFG7)  */
#define USBC_UPCFG7_PBK_SINGLE      (USBC_UPCFG7_PBK_SINGLE_Val    << USBC_UPCFG7_PBK_Pos)
#define USBC_UPCFG7_PBK_DOUBLE      (USBC_UPCFG7_PBK_DOUBLE_Val    << USBC_UPCFG7_PBK_Pos)
#define USBC_UPCFG7_PSIZE_Pos       4            /**< \brief (USBC_UPCFG7) Pipe Size */
#define USBC_UPCFG7_PSIZE_Msk       (_U(0x7) << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE(value)    (USBC_UPCFG7_PSIZE_Msk & ((value) << USBC_UPCFG7_PSIZE_Pos))
#define   USBC_UPCFG7_PSIZE_8_Val         _U(0x0)   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_16_Val        _U(0x1)   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_32_Val        _U(0x2)   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_64_Val        _U(0x3)   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_128_Val       _U(0x4)   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_256_Val       _U(0x5)   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_512_Val       _U(0x6)   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_1024_Val      _U(0x7)   /**< \brief (USBC_UPCFG7)  */
#define USBC_UPCFG7_PSIZE_8         (USBC_UPCFG7_PSIZE_8_Val       << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE_16        (USBC_UPCFG7_PSIZE_16_Val      << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE_32        (USBC_UPCFG7_PSIZE_32_Val      << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE_64        (USBC_UPCFG7_PSIZE_64_Val      << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE_128       (USBC_UPCFG7_PSIZE_128_Val     << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE_256       (USBC_UPCFG7_PSIZE_256_Val     << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE_512       (USBC_UPCFG7_PSIZE_512_Val     << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PSIZE_1024      (USBC_UPCFG7_PSIZE_1024_Val    << USBC_UPCFG7_PSIZE_Pos)
#define USBC_UPCFG7_PTOKEN_Pos      8            /**< \brief (USBC_UPCFG7) Pipe Token */
#define USBC_UPCFG7_PTOKEN_Msk      (_U(0x3) << USBC_UPCFG7_PTOKEN_Pos)
#define USBC_UPCFG7_PTOKEN(value)   (USBC_UPCFG7_PTOKEN_Msk & ((value) << USBC_UPCFG7_PTOKEN_Pos))
#define   USBC_UPCFG7_PTOKEN_SETUP_Val    _U(0x0)   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PTOKEN_IN_Val       _U(0x1)   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PTOKEN_OUT_Val      _U(0x2)   /**< \brief (USBC_UPCFG7)  */
#define USBC_UPCFG7_PTOKEN_SETUP    (USBC_UPCFG7_PTOKEN_SETUP_Val  << USBC_UPCFG7_PTOKEN_Pos)
#define USBC_UPCFG7_PTOKEN_IN       (USBC_UPCFG7_PTOKEN_IN_Val     << USBC_UPCFG7_PTOKEN_Pos)
#define USBC_UPCFG7_PTOKEN_OUT      (USBC_UPCFG7_PTOKEN_OUT_Val    << USBC_UPCFG7_PTOKEN_Pos)
#define USBC_UPCFG7_PTYPE_Pos       12           /**< \brief (USBC_UPCFG7) Pipe Type */
#define USBC_UPCFG7_PTYPE_Msk       (_U(0x3) << USBC_UPCFG7_PTYPE_Pos)
#define USBC_UPCFG7_PTYPE(value)    (USBC_UPCFG7_PTYPE_Msk & ((value) << USBC_UPCFG7_PTYPE_Pos))
#define   USBC_UPCFG7_PTYPE_CONTROL_Val   _U(0x0)   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PTYPE_ISOCHRONOUS_Val _U(0x1)   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PTYPE_BULK_Val      _U(0x2)   /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PTYPE_INTERRUPT_Val _U(0x3)   /**< \brief (USBC_UPCFG7)  */
#define USBC_UPCFG7_PTYPE_CONTROL   (USBC_UPCFG7_PTYPE_CONTROL_Val << USBC_UPCFG7_PTYPE_Pos)
#define USBC_UPCFG7_PTYPE_ISOCHRONOUS (USBC_UPCFG7_PTYPE_ISOCHRONOUS_Val << USBC_UPCFG7_PTYPE_Pos)
#define USBC_UPCFG7_PTYPE_BULK      (USBC_UPCFG7_PTYPE_BULK_Val    << USBC_UPCFG7_PTYPE_Pos)
#define USBC_UPCFG7_PTYPE_INTERRUPT (USBC_UPCFG7_PTYPE_INTERRUPT_Val << USBC_UPCFG7_PTYPE_Pos)
#define USBC_UPCFG7_PINGEN_Pos      20           /**< \brief (USBC_UPCFG7) Ping Enable */
#define USBC_UPCFG7_PINGEN          (_U(0x1) << USBC_UPCFG7_PINGEN_Pos)
#define USBC_UPCFG7_BINTERVAL_Pos   24           /**< \brief (USBC_UPCFG7) binterval parameter */
#define USBC_UPCFG7_BINTERVAL_Msk   (_U(0xFF) << USBC_UPCFG7_BINTERVAL_Pos)
#define USBC_UPCFG7_BINTERVAL(value) (USBC_UPCFG7_BINTERVAL_Msk & ((value) << USBC_UPCFG7_BINTERVAL_Pos))
#define USBC_UPCFG7_MASK            _U(0xFF103374) /**< \brief (USBC_UPCFG7) MASK Register */

/* -------- USBC_UPSTA0 : (USBC Offset: 0x530) (R/  32) Pipe Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINI:1;          /*!< bit:      0  Received IN Data Interrupt         */
    uint32_t TXOUTI:1;         /*!< bit:      1  Transmitted OUT Data Interrupt     */
    uint32_t TXSTPI:1;         /*!< bit:      2  Transmitted SETUP Interrupt        */
    uint32_t PERRI:1;          /*!< bit:      3  Pipe Error Interrupt               */
    uint32_t NAKEDI:1;         /*!< bit:      4  NAKed Interrupt                    */
    uint32_t ERRORFI:1;        /*!< bit:      5  Errorflow Interrupt                */
    uint32_t RXSTALLDI:1;      /*!< bit:      6  Received STALLed Interrupt         */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t DTSEQ:2;          /*!< bit:  8.. 9  Data Toggle Sequence               */
    uint32_t RAMACERI:1;       /*!< bit:     10  Ram Access Error Interrupt         */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t NBUSYBK:2;        /*!< bit: 12..13  Number of Busy Bank                */
    uint32_t CURRBK:2;         /*!< bit: 14..15  Current Bank                       */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPSTA0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPSTA0_OFFSET          0x530        /**< \brief (USBC_UPSTA0 offset) Pipe Status Register */
#define USBC_UPSTA0_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPSTA0 reset_value) Pipe Status Register */

