frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UPSTA2_OFFSET          0x538        /**< \brief (USBC_UPSTA2 offset) Pipe Status Register */
#define USBC_UPSTA2_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPSTA2 reset_value) Pipe Status Register */

#define USBC_UPSTA2_RXINI_Pos       0            /**< \brief (USBC_UPSTA2) Received IN Data Interrupt */
#define USBC_UPSTA2_RXINI           (_U(0x1) << USBC_UPSTA2_RXINI_Pos)
#define USBC_UPSTA2_TXOUTI_Pos      1            /**< \brief (USBC_UPSTA2) Transmitted OUT Data Interrupt */
#define USBC_UPSTA2_TXOUTI          (_U(0x1) << USBC_UPSTA2_TXOUTI_Pos)
#define USBC_UPSTA2_TXSTPI_Pos      2            /**< \brief (USBC_UPSTA2) Transmitted SETUP Interrupt */
#define USBC_UPSTA2_TXSTPI          (_U(0x1) << USBC_UPSTA2_TXSTPI_Pos)
#define USBC_UPSTA2_PERRI_Pos       3            /**< \brief (USBC_UPSTA2) Pipe Error Interrupt */
#define USBC_UPSTA2_PERRI           (_U(0x1) << USBC_UPSTA2_PERRI_Pos)
#define USBC_UPSTA2_NAKEDI_Pos      4            /**< \brief (USBC_UPSTA2) NAKed Interrupt */
#define USBC_UPSTA2_NAKEDI          (_U(0x1) << USBC_UPSTA2_NAKEDI_Pos)
#define USBC_UPSTA2_ERRORFI_Pos     5            /**< \brief (USBC_UPSTA2) Errorflow Interrupt */
#define USBC_UPSTA2_ERRORFI         (_U(0x1) << USBC_UPSTA2_ERRORFI_Pos)
#define USBC_UPSTA2_RXSTALLDI_Pos   6            /**< \brief (USBC_UPSTA2) Received STALLed Interrupt */
#define USBC_UPSTA2_RXSTALLDI       (_U(0x1) << USBC_UPSTA2_RXSTALLDI_Pos)
#define USBC_UPSTA2_DTSEQ_Pos       8            /**< \brief (USBC_UPSTA2) Data Toggle Sequence */
#define USBC_UPSTA2_DTSEQ_Msk       (_U(0x3) << USBC_UPSTA2_DTSEQ_Pos)
#define USBC_UPSTA2_DTSEQ(value)    (USBC_UPSTA2_DTSEQ_Msk & ((value) << USBC_UPSTA2_DTSEQ_Pos))
#define USBC_UPSTA2_RAMACERI_Pos    10           /**< \brief (USBC_UPSTA2) Ram Access Error Interrupt */
#define USBC_UPSTA2_RAMACERI        (_U(0x1) << USBC_UPSTA2_RAMACERI_Pos)
#define USBC_UPSTA2_NBUSYBK_Pos     12           /**< \brief (USBC_UPSTA2) Number of Busy Bank */
#define USBC_UPSTA2_NBUSYBK_Msk     (_U(0x3) << USBC_UPSTA2_NBUSYBK_Pos)
#define USBC_UPSTA2_NBUSYBK(value)  (USBC_UPSTA2_NBUSYBK_Msk & ((value) << USBC_UPSTA2_NBUSYBK_Pos))
#define USBC_UPSTA2_CURRBK_Pos      14           /**< \brief (USBC_UPSTA2) Current Bank */
#define USBC_UPSTA2_CURRBK_Msk      (_U(0x3) << USBC_UPSTA2_CURRBK_Pos)
#define USBC_UPSTA2_CURRBK(value)   (USBC_UPSTA2_CURRBK_Msk & ((value) << USBC_UPSTA2_CURRBK_Pos))
#define USBC_UPSTA2_MASK            _U(0x0000F77F) /**< \brief (USBC_UPSTA2) MASK Register */

/* -------- USBC_UPSTA3 : (USBC Offset: 0x53C) (R/  32) Pipe Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINI:1;          /*!< bit:      0  Received IN Data Interrupt         */
    uint32_t TXOUTI:1;         /*!< bit:      1  Transmitted OUT Data Interrupt     */
    uint32_t TXSTPI:1;         /*!< bit:      2  Transmitted SETUP Interrupt        */
    uint32_t PERRI:1;          /*!< bit:      3  Pipe Error Interrupt               */
    uint32_t NAKEDI:1;         /*!< bit:      4  NAKed Interrupt                    */
    uint32_t ERRORFI:1;        /*!< bit:      5  Errorflow Interrupt                */
    uint32_t RXSTALLDI:1;      /*!< bit:      6  Received STALLed Interrupt         */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t DTSEQ:2;          /*!< bit:  8.. 9  Data Toggle Sequence               */
    uint32_t RAMACERI:1;       /*!< bit:     10  Ram Access Error Interrupt         */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t NBUSYBK:2;        /*!< bit: 12..13  Number of Busy Bank                */
    uint32_t CURRBK:2;         /*!< bit: 14..15  Current Bank                       */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPSTA3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPSTA3_OFFSET          0x53C        /**< \brief (USBC_UPSTA3 offset) Pipe Status Register */
#define USBC_UPSTA3_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPSTA3 reset_value) Pipe Status Register */

#define USBC_UPSTA3_RXINI_Pos       0            /**< \brief (USBC_UPSTA3) Received IN Data Interrupt */
#define USBC_UPSTA3_RXINI           (_U(0x1) << USBC_UPSTA3_RXINI_Pos)
#define USBC_UPSTA3_TXOUTI_Pos      1            /**< \brief (USBC_UPSTA3) Transmitted OUT Data Interrupt */
#define USBC_UPSTA3_TXOUTI          (_U(0x1) << USBC_UPSTA3_TXOUTI_Pos)
#define USBC_UPSTA3_TXSTPI_Pos      2            /**< \brief (USBC_UPSTA3) Transmitted SETUP Interrupt */
#define USBC_UPSTA3_TXSTPI          (_U(0x1) << USBC_UPSTA3_TXSTPI_Pos)
#define USBC_UPSTA3_PERRI_Pos       3            /**< \brief (USBC_UPSTA3) Pipe Error Interrupt */
#define USBC_UPSTA3_PERRI           (_U(0x1) << USBC_UPSTA3_PERRI_Pos)
#define USBC_UPSTA3_NAKEDI_Pos      4            /**< \brief (USBC_UPSTA3) NAKed Interrupt */
#define USBC_UPSTA3_NAKEDI          (_U(0x1) << USBC_UPSTA3_NAKEDI_Pos)
#define USBC_UPSTA3_ERRORFI_Pos     5            /**< \brief (USBC_UPSTA3) Errorflow Interrupt */
#define USBC_UPSTA3_ERRORFI         (_U(0x1) << USBC_UPSTA3_ERRORFI_Pos)
#define USBC_UPSTA3_RXSTALLDI_Pos   6            /**< \brief (USBC_UPSTA3) Received STALLed Interrupt */
#define USBC_UPSTA3_RXSTALLDI       (_U(0x1) << USBC_UPSTA3_RXSTALLDI_Pos)
#define USBC_UPSTA3_DTSEQ_Pos       8            /**< \brief (USBC_UPSTA3) Data Toggle Sequence */
#define USBC_UPSTA3_DTSEQ_Msk       (_U(0x3) << USBC_UPSTA3_DTSEQ_Pos)
#define USBC_UPSTA3_DTSEQ(value)    (USBC_UPSTA3_DTSEQ_Msk & ((value) << USBC_UPSTA3_DTSEQ_Pos))
#define USBC_UPSTA3_RAMACERI_Pos    10           /**< \brief (USBC_UPSTA3) Ram Access Error Interrupt */
#define USBC_UPSTA3_RAMACERI        (_U(0x1) << USBC_UPSTA3_RAMACERI_Pos)
#define USBC_UPSTA3_NBUSYBK_Pos     12           /**< \brief (USBC_UPSTA3) Number of Busy Bank */
#define USBC_UPSTA3_NBUSYBK_Msk     (_U(0x3) << USBC_UPSTA3_NBUSYBK_Pos)
#define USBC_UPSTA3_NBUSYBK(value)  (USBC_UPSTA3_NBUSYBK_Msk & ((value) << USBC_UPSTA3_NBUSYBK_Pos))
#define USBC_UPSTA3_CURRBK_Pos      14           /**< \brief (USBC_UPSTA3) Current Bank */
#define USBC_UPSTA3_CURRBK_Msk      (_U(0x3) << USBC_UPSTA3_CURRBK_Pos)
#define USBC_UPSTA3_CURRBK(value)   (USBC_UPSTA3_CURRBK_Msk & ((value) << USBC_UPSTA3_CURRBK_Pos))
#define USBC_UPSTA3_MASK            _U(0x0000F77F) /**< \brief (USBC_UPSTA3) MASK Register */

/* -------- USBC_UPSTA4 : (USBC Offset: 0x540) (R/  32) Pipe Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINI:1;          /*!< bit:      0  Received IN Data Interrupt         */
    uint32_t TXOUTI:1;         /*!< bit:      1  Transmitted OUT Data Interrupt     */
    uint32_t TXSTPI:1;         /*!< bit:      2  Transmitted SETUP Interrupt        */
    uint32_t PERRI:1;          /*!< bit:      3  Pipe Error Interrupt               */
    uint32_t NAKEDI:1;         /*!< bit:      4  NAKed Interrupt                    */
    uint32_t ERRORFI:1;        /*!< bit:      5  Errorflow Interrupt                */
    uint32_t RXSTALLDI:1;      /*!< bit:      6  Received STALLed Interrupt         */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t DTSEQ:2;          /*!< bit:  8.. 9  Data Toggle Sequence               */
    uint32_t RAMACERI:1;       /*!< bit:     10  Ram Access Error Interrupt         */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t NBUSYBK:2;        /*!< bit: 12..13  Number of Busy Bank                */
    uint32_t CURRBK:2;         /*!< bit: 14..15  Current Bank                       */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPSTA4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPSTA4_OFFSET          0x540        /**< \brief (USBC_UPSTA4 offset) Pipe Status Register */
#define USBC_UPSTA4_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPSTA4 reset_value) Pipe Status Register */

#define USBC_UPSTA4_RXINI_Pos       0            /**< \brief (USBC_UPSTA4) Received IN Data Interrupt */
#define USBC_UPSTA4_RXINI           (_U(0x1) << USBC_UPSTA4_RXINI_Pos)
#define USBC_UPSTA4_TXOUTI_Pos      1            /**< \brief (USBC_UPSTA4) Transmitted OUT Data Interrupt */
#define USBC_UPSTA4_TXOUTI          (_U(0x1) << USBC_UPSTA4_TXOUTI_Pos)
#define USBC_UPSTA4_TXSTPI_Pos      2            /**< \brief (USBC_UPSTA4) Transmitted SETUP Interrupt */
#define USBC_UPSTA4_TXSTPI          (_U(0x1) << USBC_UPSTA4_TXSTPI_Pos)
#define USBC_UPSTA4_PERRI_Pos       3            /**< \brief (USBC_UPSTA4) Pipe Error Interrupt */
#define USBC_UPSTA4_PERRI           (_U(0x1) << USBC_UPSTA4_PERRI_Pos)
#define USBC_UPSTA4_NAKEDI_Pos      4            /**< \brief (USBC_UPSTA4) NAKed Interrupt */
#define USBC_UPSTA4_NAKEDI          (_U(0x1) << USBC_UPSTA4_NAKEDI_Pos)
#define USBC_UPSTA4_ERRORFI_Pos     5            /**< \brief (USBC_UPSTA4) Errorflow Interrupt */
#define USBC_UPSTA4_ERRORFI         (_U(0x1) << USBC_UPSTA4_ERRORFI_Pos)
#define USBC_UPSTA4_RXSTALLDI_Pos   6            /**< \brief (USBC_UPSTA4) Received STALLed Interrupt */
#define USBC_UPSTA4_RXSTALLDI       (_U(0x1) << USBC_UPSTA4_RXSTALLDI_Pos)
#define USBC_UPSTA4_DTSEQ_Pos       8            /**< \brief (USBC_UPSTA4) Data Toggle Sequence */
#define USBC_UPSTA4_DTSEQ_Msk       (_U(0x3) << USBC_UPSTA4_DTSEQ_Pos)
#define USBC_UPSTA4_DTSEQ(value)    (USBC_UPSTA4_DTSEQ_Msk & ((value) << USBC_UPSTA4_DTSEQ_Pos))
#define USBC_UPSTA4_RAMACERI_Pos    10           /**< \brief (USBC_UPSTA4) Ram Access Error Interrupt */
#define USBC_UPSTA4_RAMACERI        (_U(0x1) << USBC_UPSTA4_RAMACERI_Pos)
#define USBC_UPSTA4_NBUSYBK_Pos     12           /**< \brief (USBC_UPSTA4) Number of Busy Bank */
#define USBC_UPSTA4_NBUSYBK_Msk     (_U(0x3) << USBC_UPSTA4_NBUSYBK_Pos)
#define USBC_UPSTA4_NBUSYBK(value)  (USBC_UPSTA4_NBUSYBK_Msk & ((value) << USBC_UPSTA4_NBUSYBK_Pos))
#define USBC_UPSTA4_CURRBK_Pos      14           /**< \brief (USBC_UPSTA4) Current Bank */
#define USBC_UPSTA4_CURRBK_Msk      (_U(0x3) << USBC_UPSTA4_CURRBK_Pos)
#define USBC_UPSTA4_CURRBK(value)   (USBC_UPSTA4_CURRBK_Msk & ((value) << USBC_UPSTA4_CURRBK_Pos))
#define USBC_UPSTA4_MASK            _U(0x0000F77F) /**< \brief (USBC_UPSTA4) MASK Register */

