frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/* -------- USBC_UPSTA5 : (USBC Offset: 0x544) (R/  32) Pipe Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINI:1;          /*!< bit:      0  Received IN Data Interrupt         */
    uint32_t TXOUTI:1;         /*!< bit:      1  Transmitted OUT Data Interrupt     */
    uint32_t TXSTPI:1;         /*!< bit:      2  Transmitted SETUP Interrupt        */
    uint32_t PERRI:1;          /*!< bit:      3  Pipe Error Interrupt               */
    uint32_t NAKEDI:1;         /*!< bit:      4  NAKed Interrupt                    */
    uint32_t ERRORFI:1;        /*!< bit:      5  Errorflow Interrupt                */
    uint32_t RXSTALLDI:1;      /*!< bit:      6  Received STALLed Interrupt         */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t DTSEQ:2;          /*!< bit:  8.. 9  Data Toggle Sequence               */
    uint32_t RAMACERI:1;       /*!< bit:     10  Ram Access Error Interrupt         */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t NBUSYBK:2;        /*!< bit: 12..13  Number of Busy Bank                */
    uint32_t CURRBK:2;         /*!< bit: 14..15  Current Bank                       */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPSTA5_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPSTA5_OFFSET          0x544        /**< \brief (USBC_UPSTA5 offset) Pipe Status Register */
#define USBC_UPSTA5_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPSTA5 reset_value) Pipe Status Register */

#define USBC_UPSTA5_RXINI_Pos       0            /**< \brief (USBC_UPSTA5) Received IN Data Interrupt */
#define USBC_UPSTA5_RXINI           (_U(0x1) << USBC_UPSTA5_RXINI_Pos)
#define USBC_UPSTA5_TXOUTI_Pos      1            /**< \brief (USBC_UPSTA5) Transmitted OUT Data Interrupt */
#define USBC_UPSTA5_TXOUTI          (_U(0x1) << USBC_UPSTA5_TXOUTI_Pos)
#define USBC_UPSTA5_TXSTPI_Pos      2            /**< \brief (USBC_UPSTA5) Transmitted SETUP Interrupt */
#define USBC_UPSTA5_TXSTPI          (_U(0x1) << USBC_UPSTA5_TXSTPI_Pos)
#define USBC_UPSTA5_PERRI_Pos       3            /**< \brief (USBC_UPSTA5) Pipe Error Interrupt */
#define USBC_UPSTA5_PERRI           (_U(0x1) << USBC_UPSTA5_PERRI_Pos)
#define USBC_UPSTA5_NAKEDI_Pos      4            /**< \brief (USBC_UPSTA5) NAKed Interrupt */
#define USBC_UPSTA5_NAKEDI          (_U(0x1) << USBC_UPSTA5_NAKEDI_Pos)
#define USBC_UPSTA5_ERRORFI_Pos     5            /**< \brief (USBC_UPSTA5) Errorflow Interrupt */
#define USBC_UPSTA5_ERRORFI         (_U(0x1) << USBC_UPSTA5_ERRORFI_Pos)
#define USBC_UPSTA5_RXSTALLDI_Pos   6            /**< \brief (USBC_UPSTA5) Received STALLed Interrupt */
#define USBC_UPSTA5_RXSTALLDI       (_U(0x1) << USBC_UPSTA5_RXSTALLDI_Pos)
#define USBC_UPSTA5_DTSEQ_Pos       8            /**< \brief (USBC_UPSTA5) Data Toggle Sequence */
#define USBC_UPSTA5_DTSEQ_Msk       (_U(0x3) << USBC_UPSTA5_DTSEQ_Pos)
#define USBC_UPSTA5_DTSEQ(value)    (USBC_UPSTA5_DTSEQ_Msk & ((value) << USBC_UPSTA5_DTSEQ_Pos))
#define USBC_UPSTA5_RAMACERI_Pos    10           /**< \brief (USBC_UPSTA5) Ram Access Error Interrupt */
#define USBC_UPSTA5_RAMACERI        (_U(0x1) << USBC_UPSTA5_RAMACERI_Pos)
#define USBC_UPSTA5_NBUSYBK_Pos     12           /**< \brief (USBC_UPSTA5) Number of Busy Bank */
#define USBC_UPSTA5_NBUSYBK_Msk     (_U(0x3) << USBC_UPSTA5_NBUSYBK_Pos)
#define USBC_UPSTA5_NBUSYBK(value)  (USBC_UPSTA5_NBUSYBK_Msk & ((value) << USBC_UPSTA5_NBUSYBK_Pos))
#define USBC_UPSTA5_CURRBK_Pos      14           /**< \brief (USBC_UPSTA5) Current Bank */
#define USBC_UPSTA5_CURRBK_Msk      (_U(0x3) << USBC_UPSTA5_CURRBK_Pos)
#define USBC_UPSTA5_CURRBK(value)   (USBC_UPSTA5_CURRBK_Msk & ((value) << USBC_UPSTA5_CURRBK_Pos))
#define USBC_UPSTA5_MASK            _U(0x0000F77F) /**< \brief (USBC_UPSTA5) MASK Register */

/* -------- USBC_UPSTA6 : (USBC Offset: 0x548) (R/  32) Pipe Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINI:1;          /*!< bit:      0  Received IN Data Interrupt         */
    uint32_t TXOUTI:1;         /*!< bit:      1  Transmitted OUT Data Interrupt     */
    uint32_t TXSTPI:1;         /*!< bit:      2  Transmitted SETUP Interrupt        */
    uint32_t PERRI:1;          /*!< bit:      3  Pipe Error Interrupt               */
    uint32_t NAKEDI:1;         /*!< bit:      4  NAKed Interrupt                    */
    uint32_t ERRORFI:1;        /*!< bit:      5  Errorflow Interrupt                */
    uint32_t RXSTALLDI:1;      /*!< bit:      6  Received STALLed Interrupt         */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t DTSEQ:2;          /*!< bit:  8.. 9  Data Toggle Sequence               */
    uint32_t RAMACERI:1;       /*!< bit:     10  Ram Access Error Interrupt         */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t NBUSYBK:2;        /*!< bit: 12..13  Number of Busy Bank                */
    uint32_t CURRBK:2;         /*!< bit: 14..15  Current Bank                       */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPSTA6_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPSTA6_OFFSET          0x548        /**< \brief (USBC_UPSTA6 offset) Pipe Status Register */
#define USBC_UPSTA6_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPSTA6 reset_value) Pipe Status Register */

#define USBC_UPSTA6_RXINI_Pos       0            /**< \brief (USBC_UPSTA6) Received IN Data Interrupt */
#define USBC_UPSTA6_RXINI           (_U(0x1) << USBC_UPSTA6_RXINI_Pos)
#define USBC_UPSTA6_TXOUTI_Pos      1            /**< \brief (USBC_UPSTA6) Transmitted OUT Data Interrupt */
#define USBC_UPSTA6_TXOUTI          (_U(0x1) << USBC_UPSTA6_TXOUTI_Pos)
#define USBC_UPSTA6_TXSTPI_Pos      2            /**< \brief (USBC_UPSTA6) Transmitted SETUP Interrupt */
#define USBC_UPSTA6_TXSTPI          (_U(0x1) << USBC_UPSTA6_TXSTPI_Pos)
#define USBC_UPSTA6_PERRI_Pos       3            /**< \brief (USBC_UPSTA6) Pipe Error Interrupt */
#define USBC_UPSTA6_PERRI           (_U(0x1) << USBC_UPSTA6_PERRI_Pos)
#define USBC_UPSTA6_NAKEDI_Pos      4            /**< \brief (USBC_UPSTA6) NAKed Interrupt */
#define USBC_UPSTA6_NAKEDI          (_U(0x1) << USBC_UPSTA6_NAKEDI_Pos)
#define USBC_UPSTA6_ERRORFI_Pos     5            /**< \brief (USBC_UPSTA6) Errorflow Interrupt */
#define USBC_UPSTA6_ERRORFI         (_U(0x1) << USBC_UPSTA6_ERRORFI_Pos)
#define USBC_UPSTA6_RXSTALLDI_Pos   6            /**< \brief (USBC_UPSTA6) Received STALLed Interrupt */
#define USBC_UPSTA6_RXSTALLDI       (_U(0x1) << USBC_UPSTA6_RXSTALLDI_Pos)
#define USBC_UPSTA6_DTSEQ_Pos       8            /**< \brief (USBC_UPSTA6) Data Toggle Sequence */
#define USBC_UPSTA6_DTSEQ_Msk       (_U(0x3) << USBC_UPSTA6_DTSEQ_Pos)
#define USBC_UPSTA6_DTSEQ(value)    (USBC_UPSTA6_DTSEQ_Msk & ((value) << USBC_UPSTA6_DTSEQ_Pos))
#define USBC_UPSTA6_RAMACERI_Pos    10           /**< \brief (USBC_UPSTA6) Ram Access Error Interrupt */
#define USBC_UPSTA6_RAMACERI        (_U(0x1) << USBC_UPSTA6_RAMACERI_Pos)
#define USBC_UPSTA6_NBUSYBK_Pos     12           /**< \brief (USBC_UPSTA6) Number of Busy Bank */
#define USBC_UPSTA6_NBUSYBK_Msk     (_U(0x3) << USBC_UPSTA6_NBUSYBK_Pos)
#define USBC_UPSTA6_NBUSYBK(value)  (USBC_UPSTA6_NBUSYBK_Msk & ((value) << USBC_UPSTA6_NBUSYBK_Pos))
#define USBC_UPSTA6_CURRBK_Pos      14           /**< \brief (USBC_UPSTA6) Current Bank */
#define USBC_UPSTA6_CURRBK_Msk      (_U(0x3) << USBC_UPSTA6_CURRBK_Pos)
#define USBC_UPSTA6_CURRBK(value)   (USBC_UPSTA6_CURRBK_Msk & ((value) << USBC_UPSTA6_CURRBK_Pos))
#define USBC_UPSTA6_MASK            _U(0x0000F77F) /**< \brief (USBC_UPSTA6) MASK Register */

/* -------- USBC_UPSTA7 : (USBC Offset: 0x54C) (R/  32) Pipe Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINI:1;          /*!< bit:      0  Received IN Data Interrupt         */
    uint32_t TXOUTI:1;         /*!< bit:      1  Transmitted OUT Data Interrupt     */
    uint32_t TXSTPI:1;         /*!< bit:      2  Transmitted SETUP Interrupt        */
    uint32_t PERRI:1;          /*!< bit:      3  Pipe Error Interrupt               */
    uint32_t NAKEDI:1;         /*!< bit:      4  NAKed Interrupt                    */
    uint32_t ERRORFI:1;        /*!< bit:      5  Errorflow Interrupt                */
    uint32_t RXSTALLDI:1;      /*!< bit:      6  Received STALLed Interrupt         */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t DTSEQ:2;          /*!< bit:  8.. 9  Data Toggle Sequence               */
    uint32_t RAMACERI:1;       /*!< bit:     10  Ram Access Error Interrupt         */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t NBUSYBK:2;        /*!< bit: 12..13  Number of Busy Bank                */
    uint32_t CURRBK:2;         /*!< bit: 14..15  Current Bank                       */
    uint32_t :16;              /*!< bit: 16..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPSTA7_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPSTA7_OFFSET          0x54C        /**< \brief (USBC_UPSTA7 offset) Pipe Status Register */
#define USBC_UPSTA7_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPSTA7 reset_value) Pipe Status Register */

#define USBC_UPSTA7_RXINI_Pos       0            /**< \brief (USBC_UPSTA7) Received IN Data Interrupt */
#define USBC_UPSTA7_RXINI           (_U(0x1) << USBC_UPSTA7_RXINI_Pos)
#define USBC_UPSTA7_TXOUTI_Pos      1            /**< \brief (USBC_UPSTA7) Transmitted OUT Data Interrupt */
#define USBC_UPSTA7_TXOUTI          (_U(0x1) << USBC_UPSTA7_TXOUTI_Pos)
#define USBC_UPSTA7_TXSTPI_Pos      2            /**< \brief (USBC_UPSTA7) Transmitted SETUP Interrupt */
#define USBC_UPSTA7_TXSTPI          (_U(0x1) << USBC_UPSTA7_TXSTPI_Pos)
#define USBC_UPSTA7_PERRI_Pos       3            /**< \brief (USBC_UPSTA7) Pipe Error Interrupt */
#define USBC_UPSTA7_PERRI           (_U(0x1) << USBC_UPSTA7_PERRI_Pos)
#define USBC_UPSTA7_NAKEDI_Pos      4            /**< \brief (USBC_UPSTA7) NAKed Interrupt */
#define USBC_UPSTA7_NAKEDI          (_U(0x1) << USBC_UPSTA7_NAKEDI_Pos)
#define USBC_UPSTA7_ERRORFI_Pos     5            /**< \brief (USBC_UPSTA7) Errorflow Interrupt */
#define USBC_UPSTA7_ERRORFI         (_U(0x1) << USBC_UPSTA7_ERRORFI_Pos)
#define USBC_UPSTA7_RXSTALLDI_Pos   6            /**< \brief (USBC_UPSTA7) Received STALLed Interrupt */
#define USBC_UPSTA7_RXSTALLDI       (_U(0x1) << USBC_UPSTA7_RXSTALLDI_Pos)
#define USBC_UPSTA7_DTSEQ_Pos       8            /**< \brief (USBC_UPSTA7) Data Toggle Sequence */
#define USBC_UPSTA7_DTSEQ_Msk       (_U(0x3) << USBC_UPSTA7_DTSEQ_Pos)
#define USBC_UPSTA7_DTSEQ(value)    (USBC_UPSTA7_DTSEQ_Msk & ((value) << USBC_UPSTA7_DTSEQ_Pos))
#define USBC_UPSTA7_RAMACERI_Pos    10           /**< \brief (USBC_UPSTA7) Ram Access Error Interrupt */
#define USBC_UPSTA7_RAMACERI        (_U(0x1) << USBC_UPSTA7_RAMACERI_Pos)
#define USBC_UPSTA7_NBUSYBK_Pos     12           /**< \brief (USBC_UPSTA7) Number of Busy Bank */
#define USBC_UPSTA7_NBUSYBK_Msk     (_U(0x3) << USBC_UPSTA7_NBUSYBK_Pos)
#define USBC_UPSTA7_NBUSYBK(value)  (USBC_UPSTA7_NBUSYBK_Msk & ((value) << USBC_UPSTA7_NBUSYBK_Pos))
#define USBC_UPSTA7_CURRBK_Pos      14           /**< \brief (USBC_UPSTA7) Current Bank */
#define USBC_UPSTA7_CURRBK_Msk      (_U(0x3) << USBC_UPSTA7_CURRBK_Pos)
#define USBC_UPSTA7_CURRBK(value)   (USBC_UPSTA7_CURRBK_Msk & ((value) << USBC_UPSTA7_CURRBK_Pos))
#define USBC_UPSTA7_MASK            _U(0x0000F77F) /**< \brief (USBC_UPSTA7) MASK Register */

/* -------- USBC_UPSTA0CLR : (USBC Offset: 0x560) ( /W 32) Pipe Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINIC:1;         /*!< bit:      0  RXINI Clear                        */
    uint32_t TXOUTIC:1;        /*!< bit:      1  TXOUTI Clear                       */
    uint32_t TXSTPIC:1;        /*!< bit:      2  TXSTPI Clear                       */
    uint32_t PERRIC:1;         /*!< bit:      3  PERRI Clear                        */
    uint32_t NAKEDIC:1;        /*!< bit:      4  NAKEDI Clear                       */
    uint32_t ERRORFIC:1;       /*!< bit:      5  ERRORFI Clear                      */
    uint32_t RXSTALLDIC:1;     /*!< bit:      6  RXSTALLDI Clear                    */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACERIC:1;      /*!< bit:     10  RAMACERI Clear                     */
    uint32_t :21;              /*!< bit: 11..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPSTA0CLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPSTA0CLR_OFFSET       0x560        /**< \brief (USBC_UPSTA0CLR offset) Pipe Status Clear Register */
#define USBC_UPSTA0CLR_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UPSTA0CLR reset_value) Pipe Status Clear Register */

#define USBC_UPSTA0CLR_RXINIC_Pos   0            /**< \brief (USBC_UPSTA0CLR) RXINI Clear */
#define USBC_UPSTA0CLR_RXINIC       (_U(0x1) << USBC_UPSTA0CLR_RXINIC_Pos)
#define USBC_UPSTA0CLR_TXOUTIC_Pos  1            /**< \brief (USBC_UPSTA0CLR) TXOUTI Clear */
#define USBC_UPSTA0CLR_TXOUTIC      (_U(0x1) << USBC_UPSTA0CLR_TXOUTIC_Pos)
#define USBC_UPSTA0CLR_TXSTPIC_Pos  2            /**< \brief (USBC_UPSTA0CLR) TXSTPI Clear */
#define USBC_UPSTA0CLR_TXSTPIC      (_U(0x1) << USBC_UPSTA0CLR_TXSTPIC_Pos)
#define USBC_UPSTA0CLR_PERRIC_Pos   3            /**< \brief (USBC_UPSTA0CLR) PERRI Clear */
#define USBC_UPSTA0CLR_PERRIC       (_U(0x1) << USBC_UPSTA0CLR_PERRIC_Pos)
#define USBC_UPSTA0CLR_NAKEDIC_Pos  4            /**< \brief (USBC_UPSTA0CLR) NAKEDI Clear */
#define USBC_UPSTA0CLR_NAKEDIC      (_U(0x1) << USBC_UPSTA0CLR_NAKEDIC_Pos)
#define USBC_UPSTA0CLR_ERRORFIC_Pos 5            /**< \brief (USBC_UPSTA0CLR) ERRORFI Clear */
#define USBC_UPSTA0CLR_ERRORFIC     (_U(0x1) << USBC_UPSTA0CLR_ERRORFIC_Pos)
#define USBC_UPSTA0CLR_RXSTALLDIC_Pos 6            /**< \brief (USBC_UPSTA0CLR) RXSTALLDI Clear */
#define USBC_UPSTA0CLR_RXSTALLDIC   (_U(0x1) << USBC_UPSTA0CLR_RXSTALLDIC_Pos)
#define USBC_UPSTA0CLR_RAMACERIC_Pos 10           /**< \brief (USBC_UPSTA0CLR) RAMACERI Clear */
#define USBC_UPSTA0CLR_RAMACERIC    (_U(0x1) << USBC_UPSTA0CLR_RAMACERIC_Pos)
#define USBC_UPSTA0CLR_MASK         _U(0x0000047F) /**< \brief (USBC_UPSTA0CLR) MASK Register */

/* -------- USBC_UPSTA1CLR : (USBC Offset: 0x564) ( /W 32) Pipe Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINIC:1;         /*!< bit:      0  RXINI Clear                        */
    uint32_t TXOUTIC:1;        /*!< bit:      1  TXOUTI Clear                       */
    uint32_t TXSTPIC:1;        /*!< bit:      2  TXSTPI Clear                       */
    uint32_t PERRIC:1;         /*!< bit:      3  PERRI Clear                        */
    uint32_t NAKEDIC:1;        /*!< bit:      4  NAKEDI Clear                       */
    uint32_t ERRORFIC:1;       /*!< bit:      5  ERRORFI Clear                      */
    uint32_t RXSTALLDIC:1;     /*!< bit:      6  RXSTALLDI Clear                    */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACERIC:1;      /*!< bit:     10  RAMACERI Clear                     */
    uint32_t :21;              /*!< bit: 11..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPSTA1CLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

