frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UPSTA1CLR_OFFSET       0x564        /**< \brief (USBC_UPSTA1CLR offset) Pipe Status Clear Register */
#define USBC_UPSTA1CLR_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UPSTA1CLR reset_value) Pipe Status Clear Register */

#define USBC_UPSTA1CLR_RXINIC_Pos   0            /**< \brief (USBC_UPSTA1CLR) RXINI Clear */
#define USBC_UPSTA1CLR_RXINIC       (_U(0x1) << USBC_UPSTA1CLR_RXINIC_Pos)
#define USBC_UPSTA1CLR_TXOUTIC_Pos  1            /**< \brief (USBC_UPSTA1CLR) TXOUTI Clear */
#define USBC_UPSTA1CLR_TXOUTIC      (_U(0x1) << USBC_UPSTA1CLR_TXOUTIC_Pos)
#define USBC_UPSTA1CLR_TXSTPIC_Pos  2            /**< \brief (USBC_UPSTA1CLR) TXSTPI Clear */
#define USBC_UPSTA1CLR_TXSTPIC      (_U(0x1) << USBC_UPSTA1CLR_TXSTPIC_Pos)
#define USBC_UPSTA1CLR_PERRIC_Pos   3            /**< \brief (USBC_UPSTA1CLR) PERRI Clear */
#define USBC_UPSTA1CLR_PERRIC       (_U(0x1) << USBC_UPSTA1CLR_PERRIC_Pos)
#define USBC_UPSTA1CLR_NAKEDIC_Pos  4            /**< \brief (USBC_UPSTA1CLR) NAKEDI Clear */
#define USBC_UPSTA1CLR_NAKEDIC      (_U(0x1) << USBC_UPSTA1CLR_NAKEDIC_Pos)
#define USBC_UPSTA1CLR_ERRORFIC_Pos 5            /**< \brief (USBC_UPSTA1CLR) ERRORFI Clear */
#define USBC_UPSTA1CLR_ERRORFIC     (_U(0x1) << USBC_UPSTA1CLR_ERRORFIC_Pos)
#define USBC_UPSTA1CLR_RXSTALLDIC_Pos 6            /**< \brief (USBC_UPSTA1CLR) RXSTALLDI Clear */
#define USBC_UPSTA1CLR_RXSTALLDIC   (_U(0x1) << USBC_UPSTA1CLR_RXSTALLDIC_Pos)
#define USBC_UPSTA1CLR_RAMACERIC_Pos 10           /**< \brief (USBC_UPSTA1CLR) RAMACERI Clear */
#define USBC_UPSTA1CLR_RAMACERIC    (_U(0x1) << USBC_UPSTA1CLR_RAMACERIC_Pos)
#define USBC_UPSTA1CLR_MASK         _U(0x0000047F) /**< \brief (USBC_UPSTA1CLR) MASK Register */

/* -------- USBC_UPSTA2CLR : (USBC Offset: 0x568) ( /W 32) Pipe Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINIC:1;         /*!< bit:      0  RXINI Clear                        */
    uint32_t TXOUTIC:1;        /*!< bit:      1  TXOUTI Clear                       */
    uint32_t TXSTPIC:1;        /*!< bit:      2  TXSTPI Clear                       */
    uint32_t PERRIC:1;         /*!< bit:      3  PERRI Clear                        */
    uint32_t NAKEDIC:1;        /*!< bit:      4  NAKEDI Clear                       */
    uint32_t ERRORFIC:1;       /*!< bit:      5  ERRORFI Clear                      */
    uint32_t RXSTALLDIC:1;     /*!< bit:      6  RXSTALLDI Clear                    */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACERIC:1;      /*!< bit:     10  RAMACERI Clear                     */
    uint32_t :21;              /*!< bit: 11..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPSTA2CLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPSTA2CLR_OFFSET       0x568        /**< \brief (USBC_UPSTA2CLR offset) Pipe Status Clear Register */
#define USBC_UPSTA2CLR_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UPSTA2CLR reset_value) Pipe Status Clear Register */

#define USBC_UPSTA2CLR_RXINIC_Pos   0            /**< \brief (USBC_UPSTA2CLR) RXINI Clear */
#define USBC_UPSTA2CLR_RXINIC       (_U(0x1) << USBC_UPSTA2CLR_RXINIC_Pos)
#define USBC_UPSTA2CLR_TXOUTIC_Pos  1            /**< \brief (USBC_UPSTA2CLR) TXOUTI Clear */
#define USBC_UPSTA2CLR_TXOUTIC      (_U(0x1) << USBC_UPSTA2CLR_TXOUTIC_Pos)
#define USBC_UPSTA2CLR_TXSTPIC_Pos  2            /**< \brief (USBC_UPSTA2CLR) TXSTPI Clear */
#define USBC_UPSTA2CLR_TXSTPIC      (_U(0x1) << USBC_UPSTA2CLR_TXSTPIC_Pos)
#define USBC_UPSTA2CLR_PERRIC_Pos   3            /**< \brief (USBC_UPSTA2CLR) PERRI Clear */
#define USBC_UPSTA2CLR_PERRIC       (_U(0x1) << USBC_UPSTA2CLR_PERRIC_Pos)
#define USBC_UPSTA2CLR_NAKEDIC_Pos  4            /**< \brief (USBC_UPSTA2CLR) NAKEDI Clear */
#define USBC_UPSTA2CLR_NAKEDIC      (_U(0x1) << USBC_UPSTA2CLR_NAKEDIC_Pos)
#define USBC_UPSTA2CLR_ERRORFIC_Pos 5            /**< \brief (USBC_UPSTA2CLR) ERRORFI Clear */
#define USBC_UPSTA2CLR_ERRORFIC     (_U(0x1) << USBC_UPSTA2CLR_ERRORFIC_Pos)
#define USBC_UPSTA2CLR_RXSTALLDIC_Pos 6            /**< \brief (USBC_UPSTA2CLR) RXSTALLDI Clear */
#define USBC_UPSTA2CLR_RXSTALLDIC   (_U(0x1) << USBC_UPSTA2CLR_RXSTALLDIC_Pos)
#define USBC_UPSTA2CLR_RAMACERIC_Pos 10           /**< \brief (USBC_UPSTA2CLR) RAMACERI Clear */
#define USBC_UPSTA2CLR_RAMACERIC    (_U(0x1) << USBC_UPSTA2CLR_RAMACERIC_Pos)
#define USBC_UPSTA2CLR_MASK         _U(0x0000047F) /**< \brief (USBC_UPSTA2CLR) MASK Register */

/* -------- USBC_UPSTA3CLR : (USBC Offset: 0x56C) ( /W 32) Pipe Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINIC:1;         /*!< bit:      0  RXINI Clear                        */
    uint32_t TXOUTIC:1;        /*!< bit:      1  TXOUTI Clear                       */
    uint32_t TXSTPIC:1;        /*!< bit:      2  TXSTPI Clear                       */
    uint32_t PERRIC:1;         /*!< bit:      3  PERRI Clear                        */
    uint32_t NAKEDIC:1;        /*!< bit:      4  NAKEDI Clear                       */
    uint32_t ERRORFIC:1;       /*!< bit:      5  ERRORFI Clear                      */
    uint32_t RXSTALLDIC:1;     /*!< bit:      6  RXSTALLDI Clear                    */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACERIC:1;      /*!< bit:     10  RAMACERI Clear                     */
    uint32_t :21;              /*!< bit: 11..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPSTA3CLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

