frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UPSTA2SET_OFFSET       0x598        /**< \brief (USBC_UPSTA2SET offset) Pipe Status Set Register */
#define USBC_UPSTA2SET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UPSTA2SET reset_value) Pipe Status Set Register */

#define USBC_UPSTA2SET_RXINIS_Pos   0            /**< \brief (USBC_UPSTA2SET) RXINI Set */
#define USBC_UPSTA2SET_RXINIS       (_U(0x1) << USBC_UPSTA2SET_RXINIS_Pos)
#define USBC_UPSTA2SET_TXOUTIS_Pos  1            /**< \brief (USBC_UPSTA2SET) TXOUTI Set */
#define USBC_UPSTA2SET_TXOUTIS      (_U(0x1) << USBC_UPSTA2SET_TXOUTIS_Pos)
#define USBC_UPSTA2SET_TXSTPIS_Pos  2            /**< \brief (USBC_UPSTA2SET) TXSTPI Set */
#define USBC_UPSTA2SET_TXSTPIS      (_U(0x1) << USBC_UPSTA2SET_TXSTPIS_Pos)
#define USBC_UPSTA2SET_PERRIS_Pos   3            /**< \brief (USBC_UPSTA2SET) PERRI Set */
#define USBC_UPSTA2SET_PERRIS       (_U(0x1) << USBC_UPSTA2SET_PERRIS_Pos)
#define USBC_UPSTA2SET_NAKEDIS_Pos  4            /**< \brief (USBC_UPSTA2SET) NAKEDI Set */
#define USBC_UPSTA2SET_NAKEDIS      (_U(0x1) << USBC_UPSTA2SET_NAKEDIS_Pos)
#define USBC_UPSTA2SET_ERRORFIS_Pos 5            /**< \brief (USBC_UPSTA2SET) ERRORFI Set */
#define USBC_UPSTA2SET_ERRORFIS     (_U(0x1) << USBC_UPSTA2SET_ERRORFIS_Pos)
#define USBC_UPSTA2SET_RXSTALLDIS_Pos 6            /**< \brief (USBC_UPSTA2SET) RXSTALLDI Set */
#define USBC_UPSTA2SET_RXSTALLDIS   (_U(0x1) << USBC_UPSTA2SET_RXSTALLDIS_Pos)
#define USBC_UPSTA2SET_RAMACERIS_Pos 10           /**< \brief (USBC_UPSTA2SET) RAMACERI Set */
#define USBC_UPSTA2SET_RAMACERIS    (_U(0x1) << USBC_UPSTA2SET_RAMACERIS_Pos)
#define USBC_UPSTA2SET_MASK         _U(0x0000047F) /**< \brief (USBC_UPSTA2SET) MASK Register */

/* -------- USBC_UPSTA3SET : (USBC Offset: 0x59C) ( /W 32) Pipe Status Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINIS:1;         /*!< bit:      0  RXINI Set                          */
    uint32_t TXOUTIS:1;        /*!< bit:      1  TXOUTI Set                         */
    uint32_t TXSTPIS:1;        /*!< bit:      2  TXSTPI Set                         */
    uint32_t PERRIS:1;         /*!< bit:      3  PERRI Set                          */
    uint32_t NAKEDIS:1;        /*!< bit:      4  NAKEDI Set                         */
    uint32_t ERRORFIS:1;       /*!< bit:      5  ERRORFI Set                        */
    uint32_t RXSTALLDIS:1;     /*!< bit:      6  RXSTALLDI Set                      */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACERIS:1;      /*!< bit:     10  RAMACERI Set                       */
    uint32_t :21;              /*!< bit: 11..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPSTA3SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPSTA3SET_OFFSET       0x59C        /**< \brief (USBC_UPSTA3SET offset) Pipe Status Set Register */
#define USBC_UPSTA3SET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UPSTA3SET reset_value) Pipe Status Set Register */

#define USBC_UPSTA3SET_RXINIS_Pos   0            /**< \brief (USBC_UPSTA3SET) RXINI Set */
#define USBC_UPSTA3SET_RXINIS       (_U(0x1) << USBC_UPSTA3SET_RXINIS_Pos)
#define USBC_UPSTA3SET_TXOUTIS_Pos  1            /**< \brief (USBC_UPSTA3SET) TXOUTI Set */
#define USBC_UPSTA3SET_TXOUTIS      (_U(0x1) << USBC_UPSTA3SET_TXOUTIS_Pos)
#define USBC_UPSTA3SET_TXSTPIS_Pos  2            /**< \brief (USBC_UPSTA3SET) TXSTPI Set */
#define USBC_UPSTA3SET_TXSTPIS      (_U(0x1) << USBC_UPSTA3SET_TXSTPIS_Pos)
#define USBC_UPSTA3SET_PERRIS_Pos   3            /**< \brief (USBC_UPSTA3SET) PERRI Set */
#define USBC_UPSTA3SET_PERRIS       (_U(0x1) << USBC_UPSTA3SET_PERRIS_Pos)
#define USBC_UPSTA3SET_NAKEDIS_Pos  4            /**< \brief (USBC_UPSTA3SET) NAKEDI Set */
#define USBC_UPSTA3SET_NAKEDIS      (_U(0x1) << USBC_UPSTA3SET_NAKEDIS_Pos)
#define USBC_UPSTA3SET_ERRORFIS_Pos 5            /**< \brief (USBC_UPSTA3SET) ERRORFI Set */
#define USBC_UPSTA3SET_ERRORFIS     (_U(0x1) << USBC_UPSTA3SET_ERRORFIS_Pos)
#define USBC_UPSTA3SET_RXSTALLDIS_Pos 6            /**< \brief (USBC_UPSTA3SET) RXSTALLDI Set */
#define USBC_UPSTA3SET_RXSTALLDIS   (_U(0x1) << USBC_UPSTA3SET_RXSTALLDIS_Pos)
#define USBC_UPSTA3SET_RAMACERIS_Pos 10           /**< \brief (USBC_UPSTA3SET) RAMACERI Set */
#define USBC_UPSTA3SET_RAMACERIS    (_U(0x1) << USBC_UPSTA3SET_RAMACERIS_Pos)
#define USBC_UPSTA3SET_MASK         _U(0x0000047F) /**< \brief (USBC_UPSTA3SET) MASK Register */

/* -------- USBC_UPSTA4SET : (USBC Offset: 0x5A0) ( /W 32) Pipe Status Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINIS:1;         /*!< bit:      0  RXINI Set                          */
    uint32_t TXOUTIS:1;        /*!< bit:      1  TXOUTI Set                         */
    uint32_t TXSTPIS:1;        /*!< bit:      2  TXSTPI Set                         */
    uint32_t PERRIS:1;         /*!< bit:      3  PERRI Set                          */
    uint32_t NAKEDIS:1;        /*!< bit:      4  NAKEDI Set                         */
    uint32_t ERRORFIS:1;       /*!< bit:      5  ERRORFI Set                        */
    uint32_t RXSTALLDIS:1;     /*!< bit:      6  RXSTALLDI Set                      */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACERIS:1;      /*!< bit:     10  RAMACERI Set                       */
    uint32_t :21;              /*!< bit: 11..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPSTA4SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

