frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UPSTA4SET_OFFSET       0x5A0        /**< \brief (USBC_UPSTA4SET offset) Pipe Status Set Register */
#define USBC_UPSTA4SET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UPSTA4SET reset_value) Pipe Status Set Register */

#define USBC_UPSTA4SET_RXINIS_Pos   0            /**< \brief (USBC_UPSTA4SET) RXINI Set */
#define USBC_UPSTA4SET_RXINIS       (_U(0x1) << USBC_UPSTA4SET_RXINIS_Pos)
#define USBC_UPSTA4SET_TXOUTIS_Pos  1            /**< \brief (USBC_UPSTA4SET) TXOUTI Set */
#define USBC_UPSTA4SET_TXOUTIS      (_U(0x1) << USBC_UPSTA4SET_TXOUTIS_Pos)
#define USBC_UPSTA4SET_TXSTPIS_Pos  2            /**< \brief (USBC_UPSTA4SET) TXSTPI Set */
#define USBC_UPSTA4SET_TXSTPIS      (_U(0x1) << USBC_UPSTA4SET_TXSTPIS_Pos)
#define USBC_UPSTA4SET_PERRIS_Pos   3            /**< \brief (USBC_UPSTA4SET) PERRI Set */
#define USBC_UPSTA4SET_PERRIS       (_U(0x1) << USBC_UPSTA4SET_PERRIS_Pos)
#define USBC_UPSTA4SET_NAKEDIS_Pos  4            /**< \brief (USBC_UPSTA4SET) NAKEDI Set */
#define USBC_UPSTA4SET_NAKEDIS      (_U(0x1) << USBC_UPSTA4SET_NAKEDIS_Pos)
#define USBC_UPSTA4SET_ERRORFIS_Pos 5            /**< \brief (USBC_UPSTA4SET) ERRORFI Set */
#define USBC_UPSTA4SET_ERRORFIS     (_U(0x1) << USBC_UPSTA4SET_ERRORFIS_Pos)
#define USBC_UPSTA4SET_RXSTALLDIS_Pos 6            /**< \brief (USBC_UPSTA4SET) RXSTALLDI Set */
#define USBC_UPSTA4SET_RXSTALLDIS   (_U(0x1) << USBC_UPSTA4SET_RXSTALLDIS_Pos)
#define USBC_UPSTA4SET_RAMACERIS_Pos 10           /**< \brief (USBC_UPSTA4SET) RAMACERI Set */
#define USBC_UPSTA4SET_RAMACERIS    (_U(0x1) << USBC_UPSTA4SET_RAMACERIS_Pos)
#define USBC_UPSTA4SET_MASK         _U(0x0000047F) /**< \brief (USBC_UPSTA4SET) MASK Register */

/* -------- USBC_UPSTA5SET : (USBC Offset: 0x5A4) ( /W 32) Pipe Status Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINIS:1;         /*!< bit:      0  RXINI Set                          */
    uint32_t TXOUTIS:1;        /*!< bit:      1  TXOUTI Set                         */
    uint32_t TXSTPIS:1;        /*!< bit:      2  TXSTPI Set                         */
    uint32_t PERRIS:1;         /*!< bit:      3  PERRI Set                          */
    uint32_t NAKEDIS:1;        /*!< bit:      4  NAKEDI Set                         */
    uint32_t ERRORFIS:1;       /*!< bit:      5  ERRORFI Set                        */
    uint32_t RXSTALLDIS:1;     /*!< bit:      6  RXSTALLDI Set                      */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACERIS:1;      /*!< bit:     10  RAMACERI Set                       */
    uint32_t :21;              /*!< bit: 11..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPSTA5SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPSTA5SET_OFFSET       0x5A4        /**< \brief (USBC_UPSTA5SET offset) Pipe Status Set Register */
#define USBC_UPSTA5SET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UPSTA5SET reset_value) Pipe Status Set Register */

#define USBC_UPSTA5SET_RXINIS_Pos   0            /**< \brief (USBC_UPSTA5SET) RXINI Set */
#define USBC_UPSTA5SET_RXINIS       (_U(0x1) << USBC_UPSTA5SET_RXINIS_Pos)
#define USBC_UPSTA5SET_TXOUTIS_Pos  1            /**< \brief (USBC_UPSTA5SET) TXOUTI Set */
#define USBC_UPSTA5SET_TXOUTIS      (_U(0x1) << USBC_UPSTA5SET_TXOUTIS_Pos)
#define USBC_UPSTA5SET_TXSTPIS_Pos  2            /**< \brief (USBC_UPSTA5SET) TXSTPI Set */
#define USBC_UPSTA5SET_TXSTPIS      (_U(0x1) << USBC_UPSTA5SET_TXSTPIS_Pos)
#define USBC_UPSTA5SET_PERRIS_Pos   3            /**< \brief (USBC_UPSTA5SET) PERRI Set */
#define USBC_UPSTA5SET_PERRIS       (_U(0x1) << USBC_UPSTA5SET_PERRIS_Pos)
#define USBC_UPSTA5SET_NAKEDIS_Pos  4            /**< \brief (USBC_UPSTA5SET) NAKEDI Set */
#define USBC_UPSTA5SET_NAKEDIS      (_U(0x1) << USBC_UPSTA5SET_NAKEDIS_Pos)
#define USBC_UPSTA5SET_ERRORFIS_Pos 5            /**< \brief (USBC_UPSTA5SET) ERRORFI Set */
#define USBC_UPSTA5SET_ERRORFIS     (_U(0x1) << USBC_UPSTA5SET_ERRORFIS_Pos)
#define USBC_UPSTA5SET_RXSTALLDIS_Pos 6            /**< \brief (USBC_UPSTA5SET) RXSTALLDI Set */
#define USBC_UPSTA5SET_RXSTALLDIS   (_U(0x1) << USBC_UPSTA5SET_RXSTALLDIS_Pos)
#define USBC_UPSTA5SET_RAMACERIS_Pos 10           /**< \brief (USBC_UPSTA5SET) RAMACERI Set */
#define USBC_UPSTA5SET_RAMACERIS    (_U(0x1) << USBC_UPSTA5SET_RAMACERIS_Pos)
#define USBC_UPSTA5SET_MASK         _U(0x0000047F) /**< \brief (USBC_UPSTA5SET) MASK Register */

/* -------- USBC_UPSTA6SET : (USBC Offset: 0x5A8) ( /W 32) Pipe Status Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINIS:1;         /*!< bit:      0  RXINI Set                          */
    uint32_t TXOUTIS:1;        /*!< bit:      1  TXOUTI Set                         */
    uint32_t TXSTPIS:1;        /*!< bit:      2  TXSTPI Set                         */
    uint32_t PERRIS:1;         /*!< bit:      3  PERRI Set                          */
    uint32_t NAKEDIS:1;        /*!< bit:      4  NAKEDI Set                         */
    uint32_t ERRORFIS:1;       /*!< bit:      5  ERRORFI Set                        */
    uint32_t RXSTALLDIS:1;     /*!< bit:      6  RXSTALLDI Set                      */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACERIS:1;      /*!< bit:     10  RAMACERI Set                       */
    uint32_t :21;              /*!< bit: 11..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPSTA6SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

