frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UPCON2_OFFSET          0x5C8        /**< \brief (USBC_UPCON2 offset) Pipe Control Register */
#define USBC_UPCON2_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPCON2 reset_value) Pipe Control Register */

#define USBC_UPCON2_RXINE_Pos       0            /**< \brief (USBC_UPCON2) RXIN Interrupt Enable */
#define USBC_UPCON2_RXINE           (_U(0x1) << USBC_UPCON2_RXINE_Pos)
#define USBC_UPCON2_TXOUTE_Pos      1            /**< \brief (USBC_UPCON2) TXOUT Interrupt Enable */
#define USBC_UPCON2_TXOUTE          (_U(0x1) << USBC_UPCON2_TXOUTE_Pos)
#define USBC_UPCON2_TXSTPE_Pos      2            /**< \brief (USBC_UPCON2) TXSTP Interrupt Enable */
#define USBC_UPCON2_TXSTPE          (_U(0x1) << USBC_UPCON2_TXSTPE_Pos)
#define USBC_UPCON2_PERRE_Pos       3            /**< \brief (USBC_UPCON2) PERR Interrupt Enable */
#define USBC_UPCON2_PERRE           (_U(0x1) << USBC_UPCON2_PERRE_Pos)
#define USBC_UPCON2_NAKEDE_Pos      4            /**< \brief (USBC_UPCON2) NAKED Interrupt Enable */
#define USBC_UPCON2_NAKEDE          (_U(0x1) << USBC_UPCON2_NAKEDE_Pos)
#define USBC_UPCON2_ERRORFIE_Pos    5            /**< \brief (USBC_UPCON2) ERRORFI Interrupt Enable */
#define USBC_UPCON2_ERRORFIE        (_U(0x1) << USBC_UPCON2_ERRORFIE_Pos)
#define USBC_UPCON2_RXSTALLDE_Pos   6            /**< \brief (USBC_UPCON2) RXTALLD Interrupt Enable */
#define USBC_UPCON2_RXSTALLDE       (_U(0x1) << USBC_UPCON2_RXSTALLDE_Pos)
#define USBC_UPCON2_RAMACERE_Pos    10           /**< \brief (USBC_UPCON2) RAMACER Interrupt Enable */
#define USBC_UPCON2_RAMACERE        (_U(0x1) << USBC_UPCON2_RAMACERE_Pos)
#define USBC_UPCON2_NBUSYBKE_Pos    12           /**< \brief (USBC_UPCON2) NBUSYBKInterrupt Enable */
#define USBC_UPCON2_NBUSYBKE        (_U(0x1) << USBC_UPCON2_NBUSYBKE_Pos)
#define USBC_UPCON2_FIFOCON_Pos     14           /**< \brief (USBC_UPCON2) FIFO Control */
#define USBC_UPCON2_FIFOCON         (_U(0x1) << USBC_UPCON2_FIFOCON_Pos)
#define USBC_UPCON2_PFREEZE_Pos     17           /**< \brief (USBC_UPCON2) Pipe Freeze */
#define USBC_UPCON2_PFREEZE         (_U(0x1) << USBC_UPCON2_PFREEZE_Pos)
#define USBC_UPCON2_INITDTGL_Pos    18           /**< \brief (USBC_UPCON2) Data Toggle Initialization */
#define USBC_UPCON2_INITDTGL        (_U(0x1) << USBC_UPCON2_INITDTGL_Pos)
#define USBC_UPCON2_INITBK_Pos      19           /**< \brief (USBC_UPCON2) Bank Initialization */
#define USBC_UPCON2_INITBK          (_U(0x1) << USBC_UPCON2_INITBK_Pos)
#define USBC_UPCON2_MASK            _U(0x000E547F) /**< \brief (USBC_UPCON2) MASK Register */

/* -------- USBC_UPCON3 : (USBC Offset: 0x5CC) (R/  32) Pipe Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINE:1;          /*!< bit:      0  RXIN Interrupt Enable              */
    uint32_t TXOUTE:1;         /*!< bit:      1  TXOUT Interrupt Enable             */
    uint32_t TXSTPE:1;         /*!< bit:      2  TXSTP Interrupt Enable             */
    uint32_t PERRE:1;          /*!< bit:      3  PERR Interrupt Enable              */
    uint32_t NAKEDE:1;         /*!< bit:      4  NAKED Interrupt Enable             */
    uint32_t ERRORFIE:1;       /*!< bit:      5  ERRORFI Interrupt Enable           */
    uint32_t RXSTALLDE:1;      /*!< bit:      6  RXTALLD Interrupt Enable           */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACERE:1;       /*!< bit:     10  RAMACER Interrupt Enable           */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t NBUSYBKE:1;       /*!< bit:     12  NBUSYBKInterrupt Enable            */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t FIFOCON:1;        /*!< bit:     14  FIFO Control                       */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t PFREEZE:1;        /*!< bit:     17  Pipe Freeze                        */
    uint32_t INITDTGL:1;       /*!< bit:     18  Data Toggle Initialization         */
    uint32_t INITBK:1;         /*!< bit:     19  Bank Initialization                */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPCON3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPCON3_OFFSET          0x5CC        /**< \brief (USBC_UPCON3 offset) Pipe Control Register */
#define USBC_UPCON3_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPCON3 reset_value) Pipe Control Register */

#define USBC_UPCON3_RXINE_Pos       0            /**< \brief (USBC_UPCON3) RXIN Interrupt Enable */
#define USBC_UPCON3_RXINE           (_U(0x1) << USBC_UPCON3_RXINE_Pos)
#define USBC_UPCON3_TXOUTE_Pos      1            /**< \brief (USBC_UPCON3) TXOUT Interrupt Enable */
#define USBC_UPCON3_TXOUTE          (_U(0x1) << USBC_UPCON3_TXOUTE_Pos)
#define USBC_UPCON3_TXSTPE_Pos      2            /**< \brief (USBC_UPCON3) TXSTP Interrupt Enable */
#define USBC_UPCON3_TXSTPE          (_U(0x1) << USBC_UPCON3_TXSTPE_Pos)
#define USBC_UPCON3_PERRE_Pos       3            /**< \brief (USBC_UPCON3) PERR Interrupt Enable */
#define USBC_UPCON3_PERRE           (_U(0x1) << USBC_UPCON3_PERRE_Pos)
#define USBC_UPCON3_NAKEDE_Pos      4            /**< \brief (USBC_UPCON3) NAKED Interrupt Enable */
#define USBC_UPCON3_NAKEDE          (_U(0x1) << USBC_UPCON3_NAKEDE_Pos)
#define USBC_UPCON3_ERRORFIE_Pos    5            /**< \brief (USBC_UPCON3) ERRORFI Interrupt Enable */
#define USBC_UPCON3_ERRORFIE        (_U(0x1) << USBC_UPCON3_ERRORFIE_Pos)
#define USBC_UPCON3_RXSTALLDE_Pos   6            /**< \brief (USBC_UPCON3) RXTALLD Interrupt Enable */
#define USBC_UPCON3_RXSTALLDE       (_U(0x1) << USBC_UPCON3_RXSTALLDE_Pos)
#define USBC_UPCON3_RAMACERE_Pos    10           /**< \brief (USBC_UPCON3) RAMACER Interrupt Enable */
#define USBC_UPCON3_RAMACERE        (_U(0x1) << USBC_UPCON3_RAMACERE_Pos)
#define USBC_UPCON3_NBUSYBKE_Pos    12           /**< \brief (USBC_UPCON3) NBUSYBKInterrupt Enable */
#define USBC_UPCON3_NBUSYBKE        (_U(0x1) << USBC_UPCON3_NBUSYBKE_Pos)
#define USBC_UPCON3_FIFOCON_Pos     14           /**< \brief (USBC_UPCON3) FIFO Control */
#define USBC_UPCON3_FIFOCON         (_U(0x1) << USBC_UPCON3_FIFOCON_Pos)
#define USBC_UPCON3_PFREEZE_Pos     17           /**< \brief (USBC_UPCON3) Pipe Freeze */
#define USBC_UPCON3_PFREEZE         (_U(0x1) << USBC_UPCON3_PFREEZE_Pos)
#define USBC_UPCON3_INITDTGL_Pos    18           /**< \brief (USBC_UPCON3) Data Toggle Initialization */
#define USBC_UPCON3_INITDTGL        (_U(0x1) << USBC_UPCON3_INITDTGL_Pos)
#define USBC_UPCON3_INITBK_Pos      19           /**< \brief (USBC_UPCON3) Bank Initialization */
#define USBC_UPCON3_INITBK          (_U(0x1) << USBC_UPCON3_INITBK_Pos)
#define USBC_UPCON3_MASK            _U(0x000E547F) /**< \brief (USBC_UPCON3) MASK Register */

