frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/* -------- USBC_UPCON4 : (USBC Offset: 0x5D0) (R/  32) Pipe Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINE:1;          /*!< bit:      0  RXIN Interrupt Enable              */
    uint32_t TXOUTE:1;         /*!< bit:      1  TXOUT Interrupt Enable             */
    uint32_t TXSTPE:1;         /*!< bit:      2  TXSTP Interrupt Enable             */
    uint32_t PERRE:1;          /*!< bit:      3  PERR Interrupt Enable              */
    uint32_t NAKEDE:1;         /*!< bit:      4  NAKED Interrupt Enable             */
    uint32_t ERRORFIE:1;       /*!< bit:      5  ERRORFI Interrupt Enable           */
    uint32_t RXSTALLDE:1;      /*!< bit:      6  RXTALLD Interrupt Enable           */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACERE:1;       /*!< bit:     10  RAMACER Interrupt Enable           */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t NBUSYBKE:1;       /*!< bit:     12  NBUSYBKInterrupt Enable            */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t FIFOCON:1;        /*!< bit:     14  FIFO Control                       */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t PFREEZE:1;        /*!< bit:     17  Pipe Freeze                        */
    uint32_t INITDTGL:1;       /*!< bit:     18  Data Toggle Initialization         */
    uint32_t INITBK:1;         /*!< bit:     19  Bank Initialization                */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPCON4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPCON4_OFFSET          0x5D0        /**< \brief (USBC_UPCON4 offset) Pipe Control Register */
#define USBC_UPCON4_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPCON4 reset_value) Pipe Control Register */

#define USBC_UPCON4_RXINE_Pos       0            /**< \brief (USBC_UPCON4) RXIN Interrupt Enable */
#define USBC_UPCON4_RXINE           (_U(0x1) << USBC_UPCON4_RXINE_Pos)
#define USBC_UPCON4_TXOUTE_Pos      1            /**< \brief (USBC_UPCON4) TXOUT Interrupt Enable */
#define USBC_UPCON4_TXOUTE          (_U(0x1) << USBC_UPCON4_TXOUTE_Pos)
#define USBC_UPCON4_TXSTPE_Pos      2            /**< \brief (USBC_UPCON4) TXSTP Interrupt Enable */
#define USBC_UPCON4_TXSTPE          (_U(0x1) << USBC_UPCON4_TXSTPE_Pos)
#define USBC_UPCON4_PERRE_Pos       3            /**< \brief (USBC_UPCON4) PERR Interrupt Enable */
#define USBC_UPCON4_PERRE           (_U(0x1) << USBC_UPCON4_PERRE_Pos)
#define USBC_UPCON4_NAKEDE_Pos      4            /**< \brief (USBC_UPCON4) NAKED Interrupt Enable */
#define USBC_UPCON4_NAKEDE          (_U(0x1) << USBC_UPCON4_NAKEDE_Pos)
#define USBC_UPCON4_ERRORFIE_Pos    5            /**< \brief (USBC_UPCON4) ERRORFI Interrupt Enable */
#define USBC_UPCON4_ERRORFIE        (_U(0x1) << USBC_UPCON4_ERRORFIE_Pos)
#define USBC_UPCON4_RXSTALLDE_Pos   6            /**< \brief (USBC_UPCON4) RXTALLD Interrupt Enable */
#define USBC_UPCON4_RXSTALLDE       (_U(0x1) << USBC_UPCON4_RXSTALLDE_Pos)
#define USBC_UPCON4_RAMACERE_Pos    10           /**< \brief (USBC_UPCON4) RAMACER Interrupt Enable */
#define USBC_UPCON4_RAMACERE        (_U(0x1) << USBC_UPCON4_RAMACERE_Pos)
#define USBC_UPCON4_NBUSYBKE_Pos    12           /**< \brief (USBC_UPCON4) NBUSYBKInterrupt Enable */
#define USBC_UPCON4_NBUSYBKE        (_U(0x1) << USBC_UPCON4_NBUSYBKE_Pos)
#define USBC_UPCON4_FIFOCON_Pos     14           /**< \brief (USBC_UPCON4) FIFO Control */
#define USBC_UPCON4_FIFOCON         (_U(0x1) << USBC_UPCON4_FIFOCON_Pos)
#define USBC_UPCON4_PFREEZE_Pos     17           /**< \brief (USBC_UPCON4) Pipe Freeze */
#define USBC_UPCON4_PFREEZE         (_U(0x1) << USBC_UPCON4_PFREEZE_Pos)
#define USBC_UPCON4_INITDTGL_Pos    18           /**< \brief (USBC_UPCON4) Data Toggle Initialization */
#define USBC_UPCON4_INITDTGL        (_U(0x1) << USBC_UPCON4_INITDTGL_Pos)
#define USBC_UPCON4_INITBK_Pos      19           /**< \brief (USBC_UPCON4) Bank Initialization */
#define USBC_UPCON4_INITBK          (_U(0x1) << USBC_UPCON4_INITBK_Pos)
#define USBC_UPCON4_MASK            _U(0x000E547F) /**< \brief (USBC_UPCON4) MASK Register */

/* -------- USBC_UPCON5 : (USBC Offset: 0x5D4) (R/  32) Pipe Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINE:1;          /*!< bit:      0  RXIN Interrupt Enable              */
    uint32_t TXOUTE:1;         /*!< bit:      1  TXOUT Interrupt Enable             */
    uint32_t TXSTPE:1;         /*!< bit:      2  TXSTP Interrupt Enable             */
    uint32_t PERRE:1;          /*!< bit:      3  PERR Interrupt Enable              */
    uint32_t NAKEDE:1;         /*!< bit:      4  NAKED Interrupt Enable             */
    uint32_t ERRORFIE:1;       /*!< bit:      5  ERRORFI Interrupt Enable           */
    uint32_t RXSTALLDE:1;      /*!< bit:      6  RXTALLD Interrupt Enable           */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACERE:1;       /*!< bit:     10  RAMACER Interrupt Enable           */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t NBUSYBKE:1;       /*!< bit:     12  NBUSYBKInterrupt Enable            */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t FIFOCON:1;        /*!< bit:     14  FIFO Control                       */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t PFREEZE:1;        /*!< bit:     17  Pipe Freeze                        */
    uint32_t INITDTGL:1;       /*!< bit:     18  Data Toggle Initialization         */
    uint32_t INITBK:1;         /*!< bit:     19  Bank Initialization                */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPCON5_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

