frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
#define USBC_UPCON5_OFFSET          0x5D4        /**< \brief (USBC_UPCON5 offset) Pipe Control Register */
#define USBC_UPCON5_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPCON5 reset_value) Pipe Control Register */

#define USBC_UPCON5_RXINE_Pos       0            /**< \brief (USBC_UPCON5) RXIN Interrupt Enable */
#define USBC_UPCON5_RXINE           (_U(0x1) << USBC_UPCON5_RXINE_Pos)
#define USBC_UPCON5_TXOUTE_Pos      1            /**< \brief (USBC_UPCON5) TXOUT Interrupt Enable */
#define USBC_UPCON5_TXOUTE          (_U(0x1) << USBC_UPCON5_TXOUTE_Pos)
#define USBC_UPCON5_TXSTPE_Pos      2            /**< \brief (USBC_UPCON5) TXSTP Interrupt Enable */
#define USBC_UPCON5_TXSTPE          (_U(0x1) << USBC_UPCON5_TXSTPE_Pos)
#define USBC_UPCON5_PERRE_Pos       3            /**< \brief (USBC_UPCON5) PERR Interrupt Enable */
#define USBC_UPCON5_PERRE           (_U(0x1) << USBC_UPCON5_PERRE_Pos)
#define USBC_UPCON5_NAKEDE_Pos      4            /**< \brief (USBC_UPCON5) NAKED Interrupt Enable */
#define USBC_UPCON5_NAKEDE          (_U(0x1) << USBC_UPCON5_NAKEDE_Pos)
#define USBC_UPCON5_ERRORFIE_Pos    5            /**< \brief (USBC_UPCON5) ERRORFI Interrupt Enable */
#define USBC_UPCON5_ERRORFIE        (_U(0x1) << USBC_UPCON5_ERRORFIE_Pos)
#define USBC_UPCON5_RXSTALLDE_Pos   6            /**< \brief (USBC_UPCON5) RXTALLD Interrupt Enable */
#define USBC_UPCON5_RXSTALLDE       (_U(0x1) << USBC_UPCON5_RXSTALLDE_Pos)
#define USBC_UPCON5_RAMACERE_Pos    10           /**< \brief (USBC_UPCON5) RAMACER Interrupt Enable */
#define USBC_UPCON5_RAMACERE        (_U(0x1) << USBC_UPCON5_RAMACERE_Pos)
#define USBC_UPCON5_NBUSYBKE_Pos    12           /**< \brief (USBC_UPCON5) NBUSYBKInterrupt Enable */
#define USBC_UPCON5_NBUSYBKE        (_U(0x1) << USBC_UPCON5_NBUSYBKE_Pos)
#define USBC_UPCON5_FIFOCON_Pos     14           /**< \brief (USBC_UPCON5) FIFO Control */
#define USBC_UPCON5_FIFOCON         (_U(0x1) << USBC_UPCON5_FIFOCON_Pos)
#define USBC_UPCON5_PFREEZE_Pos     17           /**< \brief (USBC_UPCON5) Pipe Freeze */
#define USBC_UPCON5_PFREEZE         (_U(0x1) << USBC_UPCON5_PFREEZE_Pos)
#define USBC_UPCON5_INITDTGL_Pos    18           /**< \brief (USBC_UPCON5) Data Toggle Initialization */
#define USBC_UPCON5_INITDTGL        (_U(0x1) << USBC_UPCON5_INITDTGL_Pos)
#define USBC_UPCON5_INITBK_Pos      19           /**< \brief (USBC_UPCON5) Bank Initialization */
#define USBC_UPCON5_INITBK          (_U(0x1) << USBC_UPCON5_INITBK_Pos)
#define USBC_UPCON5_MASK            _U(0x000E547F) /**< \brief (USBC_UPCON5) MASK Register */

/* -------- USBC_UPCON6 : (USBC Offset: 0x5D8) (R/  32) Pipe Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINE:1;          /*!< bit:      0  RXIN Interrupt Enable              */
    uint32_t TXOUTE:1;         /*!< bit:      1  TXOUT Interrupt Enable             */
    uint32_t TXSTPE:1;         /*!< bit:      2  TXSTP Interrupt Enable             */
    uint32_t PERRE:1;          /*!< bit:      3  PERR Interrupt Enable              */
    uint32_t NAKEDE:1;         /*!< bit:      4  NAKED Interrupt Enable             */
    uint32_t ERRORFIE:1;       /*!< bit:      5  ERRORFI Interrupt Enable           */
    uint32_t RXSTALLDE:1;      /*!< bit:      6  RXTALLD Interrupt Enable           */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACERE:1;       /*!< bit:     10  RAMACER Interrupt Enable           */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t NBUSYBKE:1;       /*!< bit:     12  NBUSYBKInterrupt Enable            */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t FIFOCON:1;        /*!< bit:     14  FIFO Control                       */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t PFREEZE:1;        /*!< bit:     17  Pipe Freeze                        */
    uint32_t INITDTGL:1;       /*!< bit:     18  Data Toggle Initialization         */
    uint32_t INITBK:1;         /*!< bit:     19  Bank Initialization                */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPCON6_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPCON6_OFFSET          0x5D8        /**< \brief (USBC_UPCON6 offset) Pipe Control Register */
#define USBC_UPCON6_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPCON6 reset_value) Pipe Control Register */

#define USBC_UPCON6_RXINE_Pos       0            /**< \brief (USBC_UPCON6) RXIN Interrupt Enable */
#define USBC_UPCON6_RXINE           (_U(0x1) << USBC_UPCON6_RXINE_Pos)
#define USBC_UPCON6_TXOUTE_Pos      1            /**< \brief (USBC_UPCON6) TXOUT Interrupt Enable */
#define USBC_UPCON6_TXOUTE          (_U(0x1) << USBC_UPCON6_TXOUTE_Pos)
#define USBC_UPCON6_TXSTPE_Pos      2            /**< \brief (USBC_UPCON6) TXSTP Interrupt Enable */
#define USBC_UPCON6_TXSTPE          (_U(0x1) << USBC_UPCON6_TXSTPE_Pos)
#define USBC_UPCON6_PERRE_Pos       3            /**< \brief (USBC_UPCON6) PERR Interrupt Enable */
#define USBC_UPCON6_PERRE           (_U(0x1) << USBC_UPCON6_PERRE_Pos)
#define USBC_UPCON6_NAKEDE_Pos      4            /**< \brief (USBC_UPCON6) NAKED Interrupt Enable */
#define USBC_UPCON6_NAKEDE          (_U(0x1) << USBC_UPCON6_NAKEDE_Pos)
#define USBC_UPCON6_ERRORFIE_Pos    5            /**< \brief (USBC_UPCON6) ERRORFI Interrupt Enable */
#define USBC_UPCON6_ERRORFIE        (_U(0x1) << USBC_UPCON6_ERRORFIE_Pos)
#define USBC_UPCON6_RXSTALLDE_Pos   6            /**< \brief (USBC_UPCON6) RXTALLD Interrupt Enable */
#define USBC_UPCON6_RXSTALLDE       (_U(0x1) << USBC_UPCON6_RXSTALLDE_Pos)
#define USBC_UPCON6_RAMACERE_Pos    10           /**< \brief (USBC_UPCON6) RAMACER Interrupt Enable */
#define USBC_UPCON6_RAMACERE        (_U(0x1) << USBC_UPCON6_RAMACERE_Pos)
#define USBC_UPCON6_NBUSYBKE_Pos    12           /**< \brief (USBC_UPCON6) NBUSYBKInterrupt Enable */
#define USBC_UPCON6_NBUSYBKE        (_U(0x1) << USBC_UPCON6_NBUSYBKE_Pos)
#define USBC_UPCON6_FIFOCON_Pos     14           /**< \brief (USBC_UPCON6) FIFO Control */
#define USBC_UPCON6_FIFOCON         (_U(0x1) << USBC_UPCON6_FIFOCON_Pos)
#define USBC_UPCON6_PFREEZE_Pos     17           /**< \brief (USBC_UPCON6) Pipe Freeze */
#define USBC_UPCON6_PFREEZE         (_U(0x1) << USBC_UPCON6_PFREEZE_Pos)
#define USBC_UPCON6_INITDTGL_Pos    18           /**< \brief (USBC_UPCON6) Data Toggle Initialization */
#define USBC_UPCON6_INITDTGL        (_U(0x1) << USBC_UPCON6_INITDTGL_Pos)
#define USBC_UPCON6_INITBK_Pos      19           /**< \brief (USBC_UPCON6) Bank Initialization */
#define USBC_UPCON6_INITBK          (_U(0x1) << USBC_UPCON6_INITBK_Pos)
#define USBC_UPCON6_MASK            _U(0x000E547F) /**< \brief (USBC_UPCON6) MASK Register */

/* -------- USBC_UPCON7 : (USBC Offset: 0x5DC) (R/  32) Pipe Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINE:1;          /*!< bit:      0  RXIN Interrupt Enable              */
    uint32_t TXOUTE:1;         /*!< bit:      1  TXOUT Interrupt Enable             */
    uint32_t TXSTPE:1;         /*!< bit:      2  TXSTP Interrupt Enable             */
    uint32_t PERRE:1;          /*!< bit:      3  PERR Interrupt Enable              */
    uint32_t NAKEDE:1;         /*!< bit:      4  NAKED Interrupt Enable             */
    uint32_t ERRORFIE:1;       /*!< bit:      5  ERRORFI Interrupt Enable           */
    uint32_t RXSTALLDE:1;      /*!< bit:      6  RXTALLD Interrupt Enable           */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACERE:1;       /*!< bit:     10  RAMACER Interrupt Enable           */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t NBUSYBKE:1;       /*!< bit:     12  NBUSYBKInterrupt Enable            */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t FIFOCON:1;        /*!< bit:     14  FIFO Control                       */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t PFREEZE:1;        /*!< bit:     17  Pipe Freeze                        */
    uint32_t INITDTGL:1;       /*!< bit:     18  Data Toggle Initialization         */
    uint32_t INITBK:1;         /*!< bit:     19  Bank Initialization                */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPCON7_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPCON7_OFFSET          0x5DC        /**< \brief (USBC_UPCON7 offset) Pipe Control Register */
#define USBC_UPCON7_RESETVALUE      _U(0x00000000); /**< \brief (USBC_UPCON7 reset_value) Pipe Control Register */

#define USBC_UPCON7_RXINE_Pos       0            /**< \brief (USBC_UPCON7) RXIN Interrupt Enable */
#define USBC_UPCON7_RXINE           (_U(0x1) << USBC_UPCON7_RXINE_Pos)
#define USBC_UPCON7_TXOUTE_Pos      1            /**< \brief (USBC_UPCON7) TXOUT Interrupt Enable */
#define USBC_UPCON7_TXOUTE          (_U(0x1) << USBC_UPCON7_TXOUTE_Pos)
#define USBC_UPCON7_TXSTPE_Pos      2            /**< \brief (USBC_UPCON7) TXSTP Interrupt Enable */
#define USBC_UPCON7_TXSTPE          (_U(0x1) << USBC_UPCON7_TXSTPE_Pos)
#define USBC_UPCON7_PERRE_Pos       3            /**< \brief (USBC_UPCON7) PERR Interrupt Enable */
#define USBC_UPCON7_PERRE           (_U(0x1) << USBC_UPCON7_PERRE_Pos)
#define USBC_UPCON7_NAKEDE_Pos      4            /**< \brief (USBC_UPCON7) NAKED Interrupt Enable */
#define USBC_UPCON7_NAKEDE          (_U(0x1) << USBC_UPCON7_NAKEDE_Pos)
#define USBC_UPCON7_ERRORFIE_Pos    5            /**< \brief (USBC_UPCON7) ERRORFI Interrupt Enable */
#define USBC_UPCON7_ERRORFIE        (_U(0x1) << USBC_UPCON7_ERRORFIE_Pos)
#define USBC_UPCON7_RXSTALLDE_Pos   6            /**< \brief (USBC_UPCON7) RXTALLD Interrupt Enable */
#define USBC_UPCON7_RXSTALLDE       (_U(0x1) << USBC_UPCON7_RXSTALLDE_Pos)
#define USBC_UPCON7_RAMACERE_Pos    10           /**< \brief (USBC_UPCON7) RAMACER Interrupt Enable */
#define USBC_UPCON7_RAMACERE        (_U(0x1) << USBC_UPCON7_RAMACERE_Pos)
#define USBC_UPCON7_NBUSYBKE_Pos    12           /**< \brief (USBC_UPCON7) NBUSYBKInterrupt Enable */
#define USBC_UPCON7_NBUSYBKE        (_U(0x1) << USBC_UPCON7_NBUSYBKE_Pos)
#define USBC_UPCON7_FIFOCON_Pos     14           /**< \brief (USBC_UPCON7) FIFO Control */
#define USBC_UPCON7_FIFOCON         (_U(0x1) << USBC_UPCON7_FIFOCON_Pos)
#define USBC_UPCON7_PFREEZE_Pos     17           /**< \brief (USBC_UPCON7) Pipe Freeze */
#define USBC_UPCON7_PFREEZE         (_U(0x1) << USBC_UPCON7_PFREEZE_Pos)
#define USBC_UPCON7_INITDTGL_Pos    18           /**< \brief (USBC_UPCON7) Data Toggle Initialization */
#define USBC_UPCON7_INITDTGL        (_U(0x1) << USBC_UPCON7_INITDTGL_Pos)
#define USBC_UPCON7_INITBK_Pos      19           /**< \brief (USBC_UPCON7) Bank Initialization */
#define USBC_UPCON7_INITBK          (_U(0x1) << USBC_UPCON7_INITBK_Pos)
#define USBC_UPCON7_MASK            _U(0x000E547F) /**< \brief (USBC_UPCON7) MASK Register */

/* -------- USBC_UPCON0SET : (USBC Offset: 0x5F0) ( /W 32) Pipe Control Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINES:1;         /*!< bit:      0  RXINE Set                          */
    uint32_t TXOUTES:1;        /*!< bit:      1  TXOUTE Set                         */
    uint32_t TXSTPES:1;        /*!< bit:      2  TXSTPE Set                         */
    uint32_t PERRES:1;         /*!< bit:      3  PERRE Set                          */
    uint32_t NAKEDES:1;        /*!< bit:      4  NAKEDE Set                         */
    uint32_t ERRORFIES:1;      /*!< bit:      5  ERRORFIE Set                       */
    uint32_t RXSTALLDES:1;     /*!< bit:      6  RXSTALLDE Set                      */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACERES:1;      /*!< bit:     10  RAMACERE Set                       */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t NBUSYBKES:1;      /*!< bit:     12  NBUSYBKE Set                       */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t FIFOCONS:1;       /*!< bit:     14  FIFOCON Set                        */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t PFREEZES:1;       /*!< bit:     17  PFREEZE Set                        */
    uint32_t INITDTGLS:1;      /*!< bit:     18  INITDTGL Set                       */
    uint32_t INITBKS:1;        /*!< bit:     19  INITBK Set                         */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPCON0SET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPCON0SET_OFFSET       0x5F0        /**< \brief (USBC_UPCON0SET offset) Pipe Control Set Register */
#define USBC_UPCON0SET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UPCON0SET reset_value) Pipe Control Set Register */

