frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/* -------- USBC_UPCON0CLR : (USBC Offset: 0x620) ( /W 32) Pipe Control Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINEC:1;         /*!< bit:      0  RXINE Clear                        */
    uint32_t TXOUTEC:1;        /*!< bit:      1  TXOUTE Clear                       */
    uint32_t TXSTPEC:1;        /*!< bit:      2  TXSTPE Clear                       */
    uint32_t PERREC:1;         /*!< bit:      3  PERRE Clear                        */
    uint32_t NAKEDEC:1;        /*!< bit:      4  NAKEDE Clear                       */
    uint32_t ERRORFIEC:1;      /*!< bit:      5  ERRORFIE Clear                     */
    uint32_t RXSTALLDEC:1;     /*!< bit:      6  RXTALLDE Clear                     */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACEREC:1;      /*!< bit:     10  RAMACERE Clear                     */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t NBUSYBKEC:1;      /*!< bit:     12  NBUSYBKE Clear                     */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t FIFOCONC:1;       /*!< bit:     14  FIFOCON Clear                      */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t PFREEZEC:1;       /*!< bit:     17  PFREEZE Clear                      */
    uint32_t INITDTGLC:1;      /*!< bit:     18  INITDTGL Clear                     */
    uint32_t INITBKC:1;        /*!< bit:     19  INITBK Clear                       */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPCON0CLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPCON0CLR_OFFSET       0x620        /**< \brief (USBC_UPCON0CLR offset) Pipe Control Clear Register */
#define USBC_UPCON0CLR_RESETVALUE   _U(0x00000000); /**< \brief (USBC_UPCON0CLR reset_value) Pipe Control Clear Register */

#define USBC_UPCON0CLR_RXINEC_Pos   0            /**< \brief (USBC_UPCON0CLR) RXINE Clear */
#define USBC_UPCON0CLR_RXINEC       (_U(0x1) << USBC_UPCON0CLR_RXINEC_Pos)
#define USBC_UPCON0CLR_TXOUTEC_Pos  1            /**< \brief (USBC_UPCON0CLR) TXOUTE Clear */
#define USBC_UPCON0CLR_TXOUTEC      (_U(0x1) << USBC_UPCON0CLR_TXOUTEC_Pos)
#define USBC_UPCON0CLR_TXSTPEC_Pos  2            /**< \brief (USBC_UPCON0CLR) TXSTPE Clear */
#define USBC_UPCON0CLR_TXSTPEC      (_U(0x1) << USBC_UPCON0CLR_TXSTPEC_Pos)
#define USBC_UPCON0CLR_PERREC_Pos   3            /**< \brief (USBC_UPCON0CLR) PERRE Clear */
#define USBC_UPCON0CLR_PERREC       (_U(0x1) << USBC_UPCON0CLR_PERREC_Pos)
#define USBC_UPCON0CLR_NAKEDEC_Pos  4            /**< \brief (USBC_UPCON0CLR) NAKEDE Clear */
#define USBC_UPCON0CLR_NAKEDEC      (_U(0x1) << USBC_UPCON0CLR_NAKEDEC_Pos)
#define USBC_UPCON0CLR_ERRORFIEC_Pos 5            /**< \brief (USBC_UPCON0CLR) ERRORFIE Clear */
#define USBC_UPCON0CLR_ERRORFIEC    (_U(0x1) << USBC_UPCON0CLR_ERRORFIEC_Pos)
#define USBC_UPCON0CLR_RXSTALLDEC_Pos 6            /**< \brief (USBC_UPCON0CLR) RXTALLDE Clear */
#define USBC_UPCON0CLR_RXSTALLDEC   (_U(0x1) << USBC_UPCON0CLR_RXSTALLDEC_Pos)
#define USBC_UPCON0CLR_RAMACEREC_Pos 10           /**< \brief (USBC_UPCON0CLR) RAMACERE Clear */
#define USBC_UPCON0CLR_RAMACEREC    (_U(0x1) << USBC_UPCON0CLR_RAMACEREC_Pos)
#define USBC_UPCON0CLR_NBUSYBKEC_Pos 12           /**< \brief (USBC_UPCON0CLR) NBUSYBKE Clear */
#define USBC_UPCON0CLR_NBUSYBKEC    (_U(0x1) << USBC_UPCON0CLR_NBUSYBKEC_Pos)
#define USBC_UPCON0CLR_FIFOCONC_Pos 14           /**< \brief (USBC_UPCON0CLR) FIFOCON Clear */
#define USBC_UPCON0CLR_FIFOCONC     (_U(0x1) << USBC_UPCON0CLR_FIFOCONC_Pos)
#define USBC_UPCON0CLR_PFREEZEC_Pos 17           /**< \brief (USBC_UPCON0CLR) PFREEZE Clear */
#define USBC_UPCON0CLR_PFREEZEC     (_U(0x1) << USBC_UPCON0CLR_PFREEZEC_Pos)
#define USBC_UPCON0CLR_INITDTGLC_Pos 18           /**< \brief (USBC_UPCON0CLR) INITDTGL Clear */
#define USBC_UPCON0CLR_INITDTGLC    (_U(0x1) << USBC_UPCON0CLR_INITDTGLC_Pos)
#define USBC_UPCON0CLR_INITBKC_Pos  19           /**< \brief (USBC_UPCON0CLR) INITBK Clear */
#define USBC_UPCON0CLR_INITBKC      (_U(0x1) << USBC_UPCON0CLR_INITBKC_Pos)
#define USBC_UPCON0CLR_MASK         _U(0x000E547F) /**< \brief (USBC_UPCON0CLR) MASK Register */

/* -------- USBC_UPCON1CLR : (USBC Offset: 0x624) ( /W 32) Pipe Control Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXINEC:1;         /*!< bit:      0  RXINE Clear                        */
    uint32_t TXOUTEC:1;        /*!< bit:      1  TXOUTE Clear                       */
    uint32_t TXSTPEC:1;        /*!< bit:      2  TXSTPE Clear                       */
    uint32_t PERREC:1;         /*!< bit:      3  PERRE Clear                        */
    uint32_t NAKEDEC:1;        /*!< bit:      4  NAKEDE Clear                       */
    uint32_t ERRORFIEC:1;      /*!< bit:      5  ERRORFIE Clear                     */
    uint32_t RXSTALLDEC:1;     /*!< bit:      6  RXTALLDE Clear                     */
    uint32_t :3;               /*!< bit:  7.. 9  Reserved                           */
    uint32_t RAMACEREC:1;      /*!< bit:     10  RAMACERE Clear                     */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t NBUSYBKEC:1;      /*!< bit:     12  NBUSYBKE Clear                     */
    uint32_t :1;               /*!< bit:     13  Reserved                           */
    uint32_t FIFOCONC:1;       /*!< bit:     14  FIFOCON Clear                      */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t PFREEZEC:1;       /*!< bit:     17  PFREEZE Clear                      */
    uint32_t INITDTGLC:1;      /*!< bit:     18  INITDTGL Clear                     */
    uint32_t INITBKC:1;        /*!< bit:     19  INITBK Clear                       */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPCON1CLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

