frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/* -------- USBC_UPINRQ6 : (USBC Offset: 0x668) (R/W 32) Pipe In Request -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t INRQ:8;           /*!< bit:  0.. 7  IN Request Number before Freeze    */
    uint32_t INMODE:1;         /*!< bit:      8  IN Request Mode                    */
    uint32_t :23;              /*!< bit:  9..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPINRQ6_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPINRQ6_OFFSET         0x668        /**< \brief (USBC_UPINRQ6 offset) Pipe In Request */
#define USBC_UPINRQ6_RESETVALUE     _U(0x00000001); /**< \brief (USBC_UPINRQ6 reset_value) Pipe In Request */

#define USBC_UPINRQ6_INRQ_Pos       0            /**< \brief (USBC_UPINRQ6) IN Request Number before Freeze */
#define USBC_UPINRQ6_INRQ_Msk       (_U(0xFF) << USBC_UPINRQ6_INRQ_Pos)
#define USBC_UPINRQ6_INRQ(value)    (USBC_UPINRQ6_INRQ_Msk & ((value) << USBC_UPINRQ6_INRQ_Pos))
#define USBC_UPINRQ6_INMODE_Pos     8            /**< \brief (USBC_UPINRQ6) IN Request Mode */
#define USBC_UPINRQ6_INMODE         (_U(0x1) << USBC_UPINRQ6_INMODE_Pos)
#define USBC_UPINRQ6_MASK           _U(0x000001FF) /**< \brief (USBC_UPINRQ6) MASK Register */

/* -------- USBC_UPINRQ7 : (USBC Offset: 0x66C) (R/W 32) Pipe In Request -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t INRQ:8;           /*!< bit:  0.. 7  IN Request Number before Freeze    */
    uint32_t INMODE:1;         /*!< bit:      8  IN Request Mode                    */
    uint32_t :23;              /*!< bit:  9..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UPINRQ7_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UPINRQ7_OFFSET         0x66C        /**< \brief (USBC_UPINRQ7 offset) Pipe In Request */
#define USBC_UPINRQ7_RESETVALUE     _U(0x00000001); /**< \brief (USBC_UPINRQ7 reset_value) Pipe In Request */

#define USBC_UPINRQ7_INRQ_Pos       0            /**< \brief (USBC_UPINRQ7) IN Request Number before Freeze */
#define USBC_UPINRQ7_INRQ_Msk       (_U(0xFF) << USBC_UPINRQ7_INRQ_Pos)
#define USBC_UPINRQ7_INRQ(value)    (USBC_UPINRQ7_INRQ_Msk & ((value) << USBC_UPINRQ7_INRQ_Pos))
#define USBC_UPINRQ7_INMODE_Pos     8            /**< \brief (USBC_UPINRQ7) IN Request Mode */
#define USBC_UPINRQ7_INMODE         (_U(0x1) << USBC_UPINRQ7_INMODE_Pos)
#define USBC_UPINRQ7_MASK           _U(0x000001FF) /**< \brief (USBC_UPINRQ7) MASK Register */

/* -------- USBC_USBCON : (USBC Offset: 0x800) (R/W 32) General Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :14;              /*!< bit:  0..13  Reserved                           */
    uint32_t FRZCLK:1;         /*!< bit:     14  Freeze USB Clock                   */
    uint32_t USBE:1;           /*!< bit:     15  USBC Enable                        */
    uint32_t :8;               /*!< bit: 16..23  Reserved                           */
    uint32_t UIMOD:1;          /*!< bit:     24  USBC Mode                          */
    uint32_t :7;               /*!< bit: 25..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_USBCON_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_USBCON_OFFSET          0x800        /**< \brief (USBC_USBCON offset) General Control Register */
#define USBC_USBCON_RESETVALUE      _U(0x01004000); /**< \brief (USBC_USBCON reset_value) General Control Register */

#define USBC_USBCON_FRZCLK_Pos      14           /**< \brief (USBC_USBCON) Freeze USB Clock */
#define USBC_USBCON_FRZCLK          (_U(0x1) << USBC_USBCON_FRZCLK_Pos)
#define USBC_USBCON_USBE_Pos        15           /**< \brief (USBC_USBCON) USBC Enable */
#define USBC_USBCON_USBE            (_U(0x1) << USBC_USBCON_USBE_Pos)
#define USBC_USBCON_UIMOD_Pos       24           /**< \brief (USBC_USBCON) USBC Mode */
#define USBC_USBCON_UIMOD           (_U(0x1) << USBC_USBCON_UIMOD_Pos)
#define USBC_USBCON_MASK            _U(0x0100C000) /**< \brief (USBC_USBCON) MASK Register */

/* -------- USBC_USBSTA : (USBC Offset: 0x804) (R/  32) General Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :9;               /*!< bit:  0.. 8  Reserved                           */
    uint32_t VBUSRQ:1;         /*!< bit:      9  VBus Request                       */
    uint32_t :2;               /*!< bit: 10..11  Reserved                           */
    uint32_t SPEED:2;          /*!< bit: 12..13  Speed Status                       */
    uint32_t CLKUSABLE:1;      /*!< bit:     14  USB Clock Usable                   */
    uint32_t :1;               /*!< bit:     15  Reserved                           */
    uint32_t SUSPEND:1;        /*!< bit:     16  Suspend module state               */
    uint32_t :15;              /*!< bit: 17..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_USBSTA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_USBSTA_OFFSET          0x804        /**< \brief (USBC_USBSTA offset) General Status Register */
#define USBC_USBSTA_RESETVALUE      _U(0x00010000); /**< \brief (USBC_USBSTA reset_value) General Status Register */

#define USBC_USBSTA_VBUSRQ_Pos      9            /**< \brief (USBC_USBSTA) VBus Request */
#define USBC_USBSTA_VBUSRQ          (_U(0x1) << USBC_USBSTA_VBUSRQ_Pos)
#define USBC_USBSTA_SPEED_Pos       12           /**< \brief (USBC_USBSTA) Speed Status */
#define USBC_USBSTA_SPEED_Msk       (_U(0x3) << USBC_USBSTA_SPEED_Pos)
#define USBC_USBSTA_SPEED(value)    (USBC_USBSTA_SPEED_Msk & ((value) << USBC_USBSTA_SPEED_Pos))
#define   USBC_USBSTA_SPEED_FULL_Val      _U(0x0)   /**< \brief (USBC_USBSTA)  */
#define   USBC_USBSTA_SPEED_HIGH_Val      _U(0x1)   /**< \brief (USBC_USBSTA)  */
#define   USBC_USBSTA_SPEED_LOW_Val       _U(0x2)   /**< \brief (USBC_USBSTA)  */
#define USBC_USBSTA_SPEED_FULL      (USBC_USBSTA_SPEED_FULL_Val    << USBC_USBSTA_SPEED_Pos)
#define USBC_USBSTA_SPEED_HIGH      (USBC_USBSTA_SPEED_HIGH_Val    << USBC_USBSTA_SPEED_Pos)
#define USBC_USBSTA_SPEED_LOW       (USBC_USBSTA_SPEED_LOW_Val     << USBC_USBSTA_SPEED_Pos)
#define USBC_USBSTA_CLKUSABLE_Pos   14           /**< \brief (USBC_USBSTA) USB Clock Usable */
#define USBC_USBSTA_CLKUSABLE       (_U(0x1) << USBC_USBSTA_CLKUSABLE_Pos)
#define USBC_USBSTA_SUSPEND_Pos     16           /**< \brief (USBC_USBSTA) Suspend module state */
#define USBC_USBSTA_SUSPEND         (_U(0x1) << USBC_USBSTA_SUSPEND_Pos)
#define USBC_USBSTA_MASK            _U(0x00017200) /**< \brief (USBC_USBSTA) MASK Register */

