frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/* -------- USBC_USBSTACLR : (USBC Offset: 0x808) ( /W 32) General Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :8;               /*!< bit:  0.. 7  Reserved                           */
    uint32_t RAMACERIC:1;      /*!< bit:      8  RAMACERI Clear                     */
    uint32_t VBUSRQC:1;        /*!< bit:      9  VBUSRQ Clear                       */
    uint32_t :22;              /*!< bit: 10..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_USBSTACLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_USBSTACLR_OFFSET       0x808        /**< \brief (USBC_USBSTACLR offset) General Status Clear Register */
#define USBC_USBSTACLR_RESETVALUE   _U(0x00000000); /**< \brief (USBC_USBSTACLR reset_value) General Status Clear Register */

#define USBC_USBSTACLR_RAMACERIC_Pos 8            /**< \brief (USBC_USBSTACLR) RAMACERI Clear */
#define USBC_USBSTACLR_RAMACERIC    (_U(0x1) << USBC_USBSTACLR_RAMACERIC_Pos)
#define USBC_USBSTACLR_VBUSRQC_Pos  9            /**< \brief (USBC_USBSTACLR) VBUSRQ Clear */
#define USBC_USBSTACLR_VBUSRQC      (_U(0x1) << USBC_USBSTACLR_VBUSRQC_Pos)
#define USBC_USBSTACLR_MASK         _U(0x00000300) /**< \brief (USBC_USBSTACLR) MASK Register */

/* -------- USBC_USBSTASET : (USBC Offset: 0x80C) ( /W 32) General Status Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :8;               /*!< bit:  0.. 7  Reserved                           */
    uint32_t RAMACERIS:1;      /*!< bit:      8  RAMACERI Set                       */
    uint32_t VBUSRQS:1;        /*!< bit:      9  VBUSRQ Set                         */
    uint32_t :22;              /*!< bit: 10..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_USBSTASET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_USBSTASET_OFFSET       0x80C        /**< \brief (USBC_USBSTASET offset) General Status Set Register */
#define USBC_USBSTASET_RESETVALUE   _U(0x00000000); /**< \brief (USBC_USBSTASET reset_value) General Status Set Register */

#define USBC_USBSTASET_RAMACERIS_Pos 8            /**< \brief (USBC_USBSTASET) RAMACERI Set */
#define USBC_USBSTASET_RAMACERIS    (_U(0x1) << USBC_USBSTASET_RAMACERIS_Pos)
#define USBC_USBSTASET_VBUSRQS_Pos  9            /**< \brief (USBC_USBSTASET) VBUSRQ Set */
#define USBC_USBSTASET_VBUSRQS      (_U(0x1) << USBC_USBSTASET_VBUSRQS_Pos)
#define USBC_USBSTASET_MASK         _U(0x00000300) /**< \brief (USBC_USBSTASET) MASK Register */

/* -------- USBC_UVERS : (USBC Offset: 0x818) (R/  32) IP Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Version Number                     */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:3;        /*!< bit: 16..18  Variant Number                     */
    uint32_t :13;              /*!< bit: 19..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UVERS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UVERS_OFFSET           0x818        /**< \brief (USBC_UVERS offset) IP Version Register */
#define USBC_UVERS_RESETVALUE       _U(0x00000310); /**< \brief (USBC_UVERS reset_value) IP Version Register */

#define USBC_UVERS_VERSION_Pos      0            /**< \brief (USBC_UVERS) Version Number */
#define USBC_UVERS_VERSION_Msk      (_U(0xFFF) << USBC_UVERS_VERSION_Pos)
#define USBC_UVERS_VERSION(value)   (USBC_UVERS_VERSION_Msk & ((value) << USBC_UVERS_VERSION_Pos))
#define USBC_UVERS_VARIANT_Pos      16           /**< \brief (USBC_UVERS) Variant Number */
#define USBC_UVERS_VARIANT_Msk      (_U(0x7) << USBC_UVERS_VARIANT_Pos)
#define USBC_UVERS_VARIANT(value)   (USBC_UVERS_VARIANT_Msk & ((value) << USBC_UVERS_VARIANT_Pos))
#define USBC_UVERS_MASK             _U(0x00070FFF) /**< \brief (USBC_UVERS) MASK Register */

/* -------- USBC_UFEATURES : (USBC Offset: 0x81C) (R/  32) IP Features Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t EPTNBRMAX:4;      /*!< bit:  0.. 3  Maximum Number of Pipes/Endpints   */
    uint32_t :4;               /*!< bit:  4.. 7  Reserved                           */
    uint32_t UTMIMODE:1;       /*!< bit:      8  UTMI Mode                          */
    uint32_t :23;              /*!< bit:  9..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UFEATURES_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UFEATURES_OFFSET       0x81C        /**< \brief (USBC_UFEATURES offset) IP Features Register */
#define USBC_UFEATURES_RESETVALUE   _U(0x00000007); /**< \brief (USBC_UFEATURES reset_value) IP Features Register */

#define USBC_UFEATURES_EPTNBRMAX_Pos 0            /**< \brief (USBC_UFEATURES) Maximum Number of Pipes/Endpints */
#define USBC_UFEATURES_EPTNBRMAX_Msk (_U(0xF) << USBC_UFEATURES_EPTNBRMAX_Pos)
#define USBC_UFEATURES_EPTNBRMAX(value) (USBC_UFEATURES_EPTNBRMAX_Msk & ((value) << USBC_UFEATURES_EPTNBRMAX_Pos))
#define USBC_UFEATURES_UTMIMODE_Pos 8            /**< \brief (USBC_UFEATURES) UTMI Mode */
#define USBC_UFEATURES_UTMIMODE     (_U(0x1) << USBC_UFEATURES_UTMIMODE_Pos)
#define USBC_UFEATURES_MASK         _U(0x0000010F) /**< \brief (USBC_UFEATURES) MASK Register */

/* -------- USBC_UADDRSIZE : (USBC Offset: 0x820) (R/  32) IP PB address size Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t UADDRSIZE:32;     /*!< bit:  0..31  IP PB Address Size                 */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UADDRSIZE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UADDRSIZE_OFFSET       0x820        /**< \brief (USBC_UADDRSIZE offset) IP PB address size Register */
#define USBC_UADDRSIZE_RESETVALUE   _U(0x00001000); /**< \brief (USBC_UADDRSIZE reset_value) IP PB address size Register */

#define USBC_UADDRSIZE_UADDRSIZE_Pos 0            /**< \brief (USBC_UADDRSIZE) IP PB Address Size */
#define USBC_UADDRSIZE_UADDRSIZE_Msk (_U(0xFFFFFFFF) << USBC_UADDRSIZE_UADDRSIZE_Pos)
#define USBC_UADDRSIZE_UADDRSIZE(value) (USBC_UADDRSIZE_UADDRSIZE_Msk & ((value) << USBC_UADDRSIZE_UADDRSIZE_Pos))
#define USBC_UADDRSIZE_MASK         _U(0xFFFFFFFF) /**< \brief (USBC_UADDRSIZE) MASK Register */

/* -------- USBC_UNAME1 : (USBC Offset: 0x824) (R/  32) IP Name Part One: HUSB -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t UNAME1:32;        /*!< bit:  0..31  IP Name Part One                   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UNAME1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBC_UNAME1_OFFSET          0x824        /**< \brief (USBC_UNAME1 offset) IP Name Part One: HUSB */
#define USBC_UNAME1_RESETVALUE      _U(0x48555342); /**< \brief (USBC_UNAME1 reset_value) IP Name Part One: HUSB */

#define USBC_UNAME1_UNAME1_Pos      0            /**< \brief (USBC_UNAME1) IP Name Part One */
#define USBC_UNAME1_UNAME1_Msk      (_U(0xFFFFFFFF) << USBC_UNAME1_UNAME1_Pos)
#define USBC_UNAME1_UNAME1(value)   (USBC_UNAME1_UNAME1_Msk & ((value) << USBC_UNAME1_UNAME1_Pos))
#define USBC_UNAME1_MASK            _U(0xFFFFFFFF) /**< \brief (USBC_UNAME1) MASK Register */

/* -------- USBC_UNAME2 : (USBC Offset: 0x828) (R/  32) IP Name Part Two: HOST -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t UNAME2:32;        /*!< bit:  0..31  IP Name Part Two                   */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} USBC_UNAME2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

