frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/usbc.h
/** \brief USBC hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO USBC_UDCON_Type           UDCON;       /**< \brief Offset: 0x000 (R/W 32) Device General Control Register */
  __I  USBC_UDINT_Type           UDINT;       /**< \brief Offset: 0x004 (R/  32) Device Global Interupt Register */
  __O  USBC_UDINTCLR_Type        UDINTCLR;    /**< \brief Offset: 0x008 ( /W 32) Device Global Interrupt Clear Register */
  __O  USBC_UDINTSET_Type        UDINTSET;    /**< \brief Offset: 0x00C ( /W 32) Device Global Interrupt Set Regsiter */
  __I  USBC_UDINTE_Type          UDINTE;      /**< \brief Offset: 0x010 (R/  32) Device Global Interrupt Enable Register */
  __O  USBC_UDINTECLR_Type       UDINTECLR;   /**< \brief Offset: 0x014 ( /W 32) Device Global Interrupt Enable Clear Register */
  __O  USBC_UDINTESET_Type       UDINTESET;   /**< \brief Offset: 0x018 ( /W 32) Device Global Interrupt Enable Set Register */
  __IO USBC_UERST_Type           UERST;       /**< \brief Offset: 0x01C (R/W 32) Endpoint Enable/Reset Register */
  __I  USBC_UDFNUM_Type          UDFNUM;      /**< \brief Offset: 0x020 (R/  32) Device Frame Number Register */
       RoReg8                    Reserved1[0xDC];
  __IO USBC_UECFG0_Type          UECFG0;      /**< \brief Offset: 0x100 (R/W 32) Endpoint Configuration Register */
  __IO USBC_UECFG1_Type          UECFG1;      /**< \brief Offset: 0x104 (R/W 32) Endpoint Configuration Register */
  __IO USBC_UECFG2_Type          UECFG2;      /**< \brief Offset: 0x108 (R/W 32) Endpoint Configuration Register */
  __IO USBC_UECFG3_Type          UECFG3;      /**< \brief Offset: 0x10C (R/W 32) Endpoint Configuration Register */
  __IO USBC_UECFG4_Type          UECFG4;      /**< \brief Offset: 0x110 (R/W 32) Endpoint Configuration Register */
  __IO USBC_UECFG5_Type          UECFG5;      /**< \brief Offset: 0x114 (R/W 32) Endpoint Configuration Register */
  __IO USBC_UECFG6_Type          UECFG6;      /**< \brief Offset: 0x118 (R/W 32) Endpoint Configuration Register */
  __IO USBC_UECFG7_Type          UECFG7;      /**< \brief Offset: 0x11C (R/W 32) Endpoint Configuration Register */
       RoReg8                    Reserved2[0x10];
  __I  USBC_UESTA0_Type          UESTA0;      /**< \brief Offset: 0x130 (R/  32) Endpoint Status Register */
  __I  USBC_UESTA1_Type          UESTA1;      /**< \brief Offset: 0x134 (R/  32) Endpoint Status Register */
  __I  USBC_UESTA2_Type          UESTA2;      /**< \brief Offset: 0x138 (R/  32) Endpoint Status Register */
  __I  USBC_UESTA3_Type          UESTA3;      /**< \brief Offset: 0x13C (R/  32) Endpoint Status Register */
  __I  USBC_UESTA4_Type          UESTA4;      /**< \brief Offset: 0x140 (R/  32) Endpoint Status Register */
  __I  USBC_UESTA5_Type          UESTA5;      /**< \brief Offset: 0x144 (R/  32) Endpoint Status Register */
  __I  USBC_UESTA6_Type          UESTA6;      /**< \brief Offset: 0x148 (R/  32) Endpoint Status Register */
  __I  USBC_UESTA7_Type          UESTA7;      /**< \brief Offset: 0x14C (R/  32) Endpoint Status Register */
       RoReg8                    Reserved3[0x10];
  __O  USBC_UESTA0CLR_Type       UESTA0CLR;   /**< \brief Offset: 0x160 ( /W 32) Endpoint Status Clear Register */
  __O  USBC_UESTA1CLR_Type       UESTA1CLR;   /**< \brief Offset: 0x164 ( /W 32) Endpoint Status Clear Register */
  __O  USBC_UESTA2CLR_Type       UESTA2CLR;   /**< \brief Offset: 0x168 ( /W 32) Endpoint Status Clear Register */
  __O  USBC_UESTA3CLR_Type       UESTA3CLR;   /**< \brief Offset: 0x16C ( /W 32) Endpoint Status Clear Register */
  __O  USBC_UESTA4CLR_Type       UESTA4CLR;   /**< \brief Offset: 0x170 ( /W 32) Endpoint Status Clear Register */
  __O  USBC_UESTA5CLR_Type       UESTA5CLR;   /**< \brief Offset: 0x174 ( /W 32) Endpoint Status Clear Register */
  __O  USBC_UESTA6CLR_Type       UESTA6CLR;   /**< \brief Offset: 0x178 ( /W 32) Endpoint Status Clear Register */
  __O  USBC_UESTA7CLR_Type       UESTA7CLR;   /**< \brief Offset: 0x17C ( /W 32) Endpoint Status Clear Register */
       RoReg8                    Reserved4[0x10];
  __O  USBC_UESTA0SET_Type       UESTA0SET;   /**< \brief Offset: 0x190 ( /W 32) Endpoint Status Set Register */
  __O  USBC_UESTA1SET_Type       UESTA1SET;   /**< \brief Offset: 0x194 ( /W 32) Endpoint Status Set Register */
  __O  USBC_UESTA2SET_Type       UESTA2SET;   /**< \brief Offset: 0x198 ( /W 32) Endpoint Status Set Register */
  __O  USBC_UESTA3SET_Type       UESTA3SET;   /**< \brief Offset: 0x19C ( /W 32) Endpoint Status Set Register */
  __O  USBC_UESTA4SET_Type       UESTA4SET;   /**< \brief Offset: 0x1A0 ( /W 32) Endpoint Status Set Register */
  __O  USBC_UESTA5SET_Type       UESTA5SET;   /**< \brief Offset: 0x1A4 ( /W 32) Endpoint Status Set Register */
  __O  USBC_UESTA6SET_Type       UESTA6SET;   /**< \brief Offset: 0x1A8 ( /W 32) Endpoint Status Set Register */
  __O  USBC_UESTA7SET_Type       UESTA7SET;   /**< \brief Offset: 0x1AC ( /W 32) Endpoint Status Set Register */
       RoReg8                    Reserved5[0x10];
  __I  USBC_UECON0_Type          UECON0;      /**< \brief Offset: 0x1C0 (R/  32) Endpoint Control Register */
  __I  USBC_UECON1_Type          UECON1;      /**< \brief Offset: 0x1C4 (R/  32) Endpoint Control Register */
  __I  USBC_UECON2_Type          UECON2;      /**< \brief Offset: 0x1C8 (R/  32) Endpoint Control Register */
  __I  USBC_UECON3_Type          UECON3;      /**< \brief Offset: 0x1CC (R/  32) Endpoint Control Register */
  __I  USBC_UECON4_Type          UECON4;      /**< \brief Offset: 0x1D0 (R/  32) Endpoint Control Register */
  __I  USBC_UECON5_Type          UECON5;      /**< \brief Offset: 0x1D4 (R/  32) Endpoint Control Register */
  __I  USBC_UECON6_Type          UECON6;      /**< \brief Offset: 0x1D8 (R/  32) Endpoint Control Register */
  __I  USBC_UECON7_Type          UECON7;      /**< \brief Offset: 0x1DC (R/  32) Endpoint Control Register */
       RoReg8                    Reserved6[0x10];
  __O  USBC_UECON0SET_Type       UECON0SET;   /**< \brief Offset: 0x1F0 ( /W 32) Endpoint Control Set Register */
  __O  USBC_UECON1SET_Type       UECON1SET;   /**< \brief Offset: 0x1F4 ( /W 32) Endpoint Control Set Register */
  __O  USBC_UECON2SET_Type       UECON2SET;   /**< \brief Offset: 0x1F8 ( /W 32) Endpoint Control Set Register */
  __O  USBC_UECON3SET_Type       UECON3SET;   /**< \brief Offset: 0x1FC ( /W 32) Endpoint Control Set Register */
  __O  USBC_UECON4SET_Type       UECON4SET;   /**< \brief Offset: 0x200 ( /W 32) Endpoint Control Set Register */
  __O  USBC_UECON5SET_Type       UECON5SET;   /**< \brief Offset: 0x204 ( /W 32) Endpoint Control Set Register */
  __O  USBC_UECON6SET_Type       UECON6SET;   /**< \brief Offset: 0x208 ( /W 32) Endpoint Control Set Register */
  __O  USBC_UECON7SET_Type       UECON7SET;   /**< \brief Offset: 0x20C ( /W 32) Endpoint Control Set Register */
       RoReg8                    Reserved7[0x10];
  __O  USBC_UECON0CLR_Type       UECON0CLR;   /**< \brief Offset: 0x220 ( /W 32) Endpoint Control Clear Register */
  __O  USBC_UECON1CLR_Type       UECON1CLR;   /**< \brief Offset: 0x224 ( /W 32) TXINE Clear */
  __O  USBC_UECON2CLR_Type       UECON2CLR;   /**< \brief Offset: 0x228 ( /W 32) TXINE Clear */
  __O  USBC_UECON3CLR_Type       UECON3CLR;   /**< \brief Offset: 0x22C ( /W 32) TXINE Clear */
  __O  USBC_UECON4CLR_Type       UECON4CLR;   /**< \brief Offset: 0x230 ( /W 32) TXINE Clear */
  __O  USBC_UECON5CLR_Type       UECON5CLR;   /**< \brief Offset: 0x234 ( /W 32) TXINE Clear */
  __O  USBC_UECON6CLR_Type       UECON6CLR;   /**< \brief Offset: 0x238 ( /W 32) TXINE Clear */
  __O  USBC_UECON7CLR_Type       UECON7CLR;   /**< \brief Offset: 0x23C ( /W 32) TXINE Clear */
       RoReg8                    Reserved8[0x1C0];
  __IO USBC_UHCON_Type           UHCON;       /**< \brief Offset: 0x400 (R/W 32) Host General Control Register */
  __I  USBC_UHINT_Type           UHINT;       /**< \brief Offset: 0x404 (R/  32) Host Global Interrupt Register */
  __O  USBC_UHINTCLR_Type        UHINTCLR;    /**< \brief Offset: 0x408 ( /W 32) Host Global Interrrupt Clear Register */
  __O  USBC_UHINTSET_Type        UHINTSET;    /**< \brief Offset: 0x40C ( /W 32) Host Global Interrupt Set Register */
  __I  USBC_UHINTE_Type          UHINTE;      /**< \brief Offset: 0x410 (R/  32) Host Global Interrupt Enable Register */
  __O  USBC_UHINTECLR_Type       UHINTECLR;   /**< \brief Offset: 0x414 ( /W 32) Host Global Interrupt Enable Clear Register */
  __O  USBC_UHINTESET_Type       UHINTESET;   /**< \brief Offset: 0x418 ( /W 32) Host Global Interrupt Enable Set Register */
  __IO USBC_UPRST_Type           UPRST;       /**< \brief Offset: 0x41C (R/W 32) Pipe Reset Register */
  __IO USBC_UHFNUM_Type          UHFNUM;      /**< \brief Offset: 0x420 (R/W 32) Host Frame Number Register */
  __IO USBC_UHSOFC_Type          UHSOFC;      /**< \brief Offset: 0x424 (R/W 32) Host Start of Frame Control Register */
       RoReg8                    Reserved9[0xD8];
  __IO USBC_UPCFG0_Type          UPCFG0;      /**< \brief Offset: 0x500 (R/W 32) Pipe Configuration Register */
  __IO USBC_UPCFG1_Type          UPCFG1;      /**< \brief Offset: 0x504 (R/W 32) Pipe Configuration Register */
  __IO USBC_UPCFG2_Type          UPCFG2;      /**< \brief Offset: 0x508 (R/W 32) Pipe Configuration Register */
  __IO USBC_UPCFG3_Type          UPCFG3;      /**< \brief Offset: 0x50C (R/W 32) Pipe Configuration Register */
  __IO USBC_UPCFG4_Type          UPCFG4;      /**< \brief Offset: 0x510 (R/W 32) Pipe Configuration Register */
  __IO USBC_UPCFG5_Type          UPCFG5;      /**< \brief Offset: 0x514 (R/W 32) Pipe Configuration Register */
  __IO USBC_UPCFG6_Type          UPCFG6;      /**< \brief Offset: 0x518 (R/W 32) Pipe Configuration Register */
  __IO USBC_UPCFG7_Type          UPCFG7;      /**< \brief Offset: 0x51C (R/W 32) Pipe Configuration Register */
       RoReg8                    Reserved10[0x10];
  __I  USBC_UPSTA0_Type          UPSTA0;      /**< \brief Offset: 0x530 (R/  32) Pipe Status Register */
  __I  USBC_UPSTA1_Type          UPSTA1;      /**< \brief Offset: 0x534 (R/  32) Pipe Status Register */
  __I  USBC_UPSTA2_Type          UPSTA2;      /**< \brief Offset: 0x538 (R/  32) Pipe Status Register */
  __I  USBC_UPSTA3_Type          UPSTA3;      /**< \brief Offset: 0x53C (R/  32) Pipe Status Register */
  __I  USBC_UPSTA4_Type          UPSTA4;      /**< \brief Offset: 0x540 (R/  32) Pipe Status Register */
  __I  USBC_UPSTA5_Type          UPSTA5;      /**< \brief Offset: 0x544 (R/  32) Pipe Status Register */
  __I  USBC_UPSTA6_Type          UPSTA6;      /**< \brief Offset: 0x548 (R/  32) Pipe Status Register */
  __I  USBC_UPSTA7_Type          UPSTA7;      /**< \brief Offset: 0x54C (R/  32) Pipe Status Register */
       RoReg8                    Reserved11[0x10];
  __O  USBC_UPSTA0CLR_Type       UPSTA0CLR;   /**< \brief Offset: 0x560 ( /W 32) Pipe Status Clear Register */
  __O  USBC_UPSTA1CLR_Type       UPSTA1CLR;   /**< \brief Offset: 0x564 ( /W 32) Pipe Status Clear Register */
  __O  USBC_UPSTA2CLR_Type       UPSTA2CLR;   /**< \brief Offset: 0x568 ( /W 32) Pipe Status Clear Register */
  __O  USBC_UPSTA3CLR_Type       UPSTA3CLR;   /**< \brief Offset: 0x56C ( /W 32) Pipe Status Clear Register */
  __O  USBC_UPSTA4CLR_Type       UPSTA4CLR;   /**< \brief Offset: 0x570 ( /W 32) Pipe Status Clear Register */
  __O  USBC_UPSTA5CLR_Type       UPSTA5CLR;   /**< \brief Offset: 0x574 ( /W 32) Pipe Status Clear Register */
  __O  USBC_UPSTA6CLR_Type       UPSTA6CLR;   /**< \brief Offset: 0x578 ( /W 32) Pipe Status Clear Register */
  __O  USBC_UPSTA7CLR_Type       UPSTA7CLR;   /**< \brief Offset: 0x57C ( /W 32) Pipe Status Clear Register */
       RoReg8                    Reserved12[0x10];
  __O  USBC_UPSTA0SET_Type       UPSTA0SET;   /**< \brief Offset: 0x590 ( /W 32) Pipe Status Set Register */
  __O  USBC_UPSTA1SET_Type       UPSTA1SET;   /**< \brief Offset: 0x594 ( /W 32) Pipe Status Set Register */
  __O  USBC_UPSTA2SET_Type       UPSTA2SET;   /**< \brief Offset: 0x598 ( /W 32) Pipe Status Set Register */
  __O  USBC_UPSTA3SET_Type       UPSTA3SET;   /**< \brief Offset: 0x59C ( /W 32) Pipe Status Set Register */
  __O  USBC_UPSTA4SET_Type       UPSTA4SET;   /**< \brief Offset: 0x5A0 ( /W 32) Pipe Status Set Register */
  __O  USBC_UPSTA5SET_Type       UPSTA5SET;   /**< \brief Offset: 0x5A4 ( /W 32) Pipe Status Set Register */
  __O  USBC_UPSTA6SET_Type       UPSTA6SET;   /**< \brief Offset: 0x5A8 ( /W 32) Pipe Status Set Register */
  __O  USBC_UPSTA7SET_Type       UPSTA7SET;   /**< \brief Offset: 0x5AC ( /W 32) Pipe Status Set Register */
       RoReg8                    Reserved13[0x10];
  __I  USBC_UPCON0_Type          UPCON0;      /**< \brief Offset: 0x5C0 (R/  32) Pipe Control Register */
  __I  USBC_UPCON1_Type          UPCON1;      /**< \brief Offset: 0x5C4 (R/  32) Pipe Control Register */
  __I  USBC_UPCON2_Type          UPCON2;      /**< \brief Offset: 0x5C8 (R/  32) Pipe Control Register */
  __I  USBC_UPCON3_Type          UPCON3;      /**< \brief Offset: 0x5CC (R/  32) Pipe Control Register */
  __I  USBC_UPCON4_Type          UPCON4;      /**< \brief Offset: 0x5D0 (R/  32) Pipe Control Register */
  __I  USBC_UPCON5_Type          UPCON5;      /**< \brief Offset: 0x5D4 (R/  32) Pipe Control Register */
  __I  USBC_UPCON6_Type          UPCON6;      /**< \brief Offset: 0x5D8 (R/  32) Pipe Control Register */
  __I  USBC_UPCON7_Type          UPCON7;      /**< \brief Offset: 0x5DC (R/  32) Pipe Control Register */
       RoReg8                    Reserved14[0x10];
  __O  USBC_UPCON0SET_Type       UPCON0SET;   /**< \brief Offset: 0x5F0 ( /W 32) Pipe Control Set Register */
  __O  USBC_UPCON1SET_Type       UPCON1SET;   /**< \brief Offset: 0x5F4 ( /W 32) Pipe Control Set Register */
  __O  USBC_UPCON2SET_Type       UPCON2SET;   /**< \brief Offset: 0x5F8 ( /W 32) Pipe Control Set Register */
  __O  USBC_UPCON3SET_Type       UPCON3SET;   /**< \brief Offset: 0x5FC ( /W 32) Pipe Control Set Register */
  __O  USBC_UPCON4SET_Type       UPCON4SET;   /**< \brief Offset: 0x600 ( /W 32) Pipe Control Set Register */
  __O  USBC_UPCON5SET_Type       UPCON5SET;   /**< \brief Offset: 0x604 ( /W 32) Pipe Control Set Register */
  __O  USBC_UPCON6SET_Type       UPCON6SET;   /**< \brief Offset: 0x608 ( /W 32) Pipe Control Set Register */
  __O  USBC_UPCON7SET_Type       UPCON7SET;   /**< \brief Offset: 0x60C ( /W 32) Pipe Control Set Register */
       RoReg8                    Reserved15[0x10];
  __O  USBC_UPCON0CLR_Type       UPCON0CLR;   /**< \brief Offset: 0x620 ( /W 32) Pipe Control Clear Register */
  __O  USBC_UPCON1CLR_Type       UPCON1CLR;   /**< \brief Offset: 0x624 ( /W 32) Pipe Control Clear Register */
  __O  USBC_UPCON2CLR_Type       UPCON2CLR;   /**< \brief Offset: 0x628 ( /W 32) Pipe Control Clear Register */
  __O  USBC_UPCON3CLR_Type       UPCON3CLR;   /**< \brief Offset: 0x62C ( /W 32) Pipe Control Clear Register */
  __O  USBC_UPCON4CLR_Type       UPCON4CLR;   /**< \brief Offset: 0x630 ( /W 32) Pipe Control Clear Register */
  __O  USBC_UPCON5CLR_Type       UPCON5CLR;   /**< \brief Offset: 0x634 ( /W 32) Pipe Control Clear Register */
  __O  USBC_UPCON6CLR_Type       UPCON6CLR;   /**< \brief Offset: 0x638 ( /W 32) Pipe Control Clear Register */
  __O  USBC_UPCON7CLR_Type       UPCON7CLR;   /**< \brief Offset: 0x63C ( /W 32) Pipe Control Clear Register */
       RoReg8                    Reserved16[0x10];
  __IO USBC_UPINRQ0_Type         UPINRQ0;     /**< \brief Offset: 0x650 (R/W 32) Pipe In Request */
  __IO USBC_UPINRQ1_Type         UPINRQ1;     /**< \brief Offset: 0x654 (R/W 32) Pipe In Request */
  __IO USBC_UPINRQ2_Type         UPINRQ2;     /**< \brief Offset: 0x658 (R/W 32) Pipe In Request */
  __IO USBC_UPINRQ3_Type         UPINRQ3;     /**< \brief Offset: 0x65C (R/W 32) Pipe In Request */
  __IO USBC_UPINRQ4_Type         UPINRQ4;     /**< \brief Offset: 0x660 (R/W 32) Pipe In Request */
  __IO USBC_UPINRQ5_Type         UPINRQ5;     /**< \brief Offset: 0x664 (R/W 32) Pipe In Request */
  __IO USBC_UPINRQ6_Type         UPINRQ6;     /**< \brief Offset: 0x668 (R/W 32) Pipe In Request */
  __IO USBC_UPINRQ7_Type         UPINRQ7;     /**< \brief Offset: 0x66C (R/W 32) Pipe In Request */
       RoReg8                    Reserved17[0x190];
  __IO USBC_USBCON_Type          USBCON;      /**< \brief Offset: 0x800 (R/W 32) General Control Register */
  __I  USBC_USBSTA_Type          USBSTA;      /**< \brief Offset: 0x804 (R/  32) General Status Register */
  __O  USBC_USBSTACLR_Type       USBSTACLR;   /**< \brief Offset: 0x808 ( /W 32) General Status Clear Register */
  __O  USBC_USBSTASET_Type       USBSTASET;   /**< \brief Offset: 0x80C ( /W 32) General Status Set Register */
       RoReg8                    Reserved18[0x8];
  __I  USBC_UVERS_Type           UVERS;       /**< \brief Offset: 0x818 (R/  32) IP Version Register */
  __I  USBC_UFEATURES_Type       UFEATURES;   /**< \brief Offset: 0x81C (R/  32) IP Features Register */
  __I  USBC_UADDRSIZE_Type       UADDRSIZE;   /**< \brief Offset: 0x820 (R/  32) IP PB address size Register */
  __I  USBC_UNAME1_Type          UNAME1;      /**< \brief Offset: 0x824 (R/  32) IP Name Part One: HUSB */
  __I  USBC_UNAME2_Type          UNAME2;      /**< \brief Offset: 0x828 (R/  32) IP Name Part Two: HOST */
  __I  USBC_USBFSM_Type          USBFSM;      /**< \brief Offset: 0x82C (R/  32) USB internal finite state machine */
  __IO USBC_UDESC_Type           UDESC;       /**< \brief Offset: 0x830 (R/W 32) Endpoint descriptor table */
 } bf;
 struct {
  RwReg   USBC_UDCON;         /**< \brief (USBC Offset: 0x000) Device General Control Register */
  RoReg   USBC_UDINT;         /**< \brief (USBC Offset: 0x004) Device Global Interupt Register */
  WoReg   USBC_UDINTCLR;      /**< \brief (USBC Offset: 0x008) Device Global Interrupt Clear Register */
  WoReg   USBC_UDINTSET;      /**< \brief (USBC Offset: 0x00C) Device Global Interrupt Set Regsiter */
  RoReg   USBC_UDINTE;        /**< \brief (USBC Offset: 0x010) Device Global Interrupt Enable Register */
  WoReg   USBC_UDINTECLR;     /**< \brief (USBC Offset: 0x014) Device Global Interrupt Enable Clear Register */
  WoReg   USBC_UDINTESET;     /**< \brief (USBC Offset: 0x018) Device Global Interrupt Enable Set Register */
  RwReg   USBC_UERST;         /**< \brief (USBC Offset: 0x01C) Endpoint Enable/Reset Register */
  RoReg   USBC_UDFNUM;        /**< \brief (USBC Offset: 0x020) Device Frame Number Register */
  RoReg8  Reserved19[0xDC];
  RwReg   USBC_UECFG0;        /**< \brief (USBC Offset: 0x100) Endpoint Configuration Register */
  RwReg   USBC_UECFG1;        /**< \brief (USBC Offset: 0x104) Endpoint Configuration Register */
  RwReg   USBC_UECFG2;        /**< \brief (USBC Offset: 0x108) Endpoint Configuration Register */
  RwReg   USBC_UECFG3;        /**< \brief (USBC Offset: 0x10C) Endpoint Configuration Register */
  RwReg   USBC_UECFG4;        /**< \brief (USBC Offset: 0x110) Endpoint Configuration Register */
  RwReg   USBC_UECFG5;        /**< \brief (USBC Offset: 0x114) Endpoint Configuration Register */
  RwReg   USBC_UECFG6;        /**< \brief (USBC Offset: 0x118) Endpoint Configuration Register */
  RwReg   USBC_UECFG7;        /**< \brief (USBC Offset: 0x11C) Endpoint Configuration Register */
  RoReg8  Reserved20[0x10];
  RoReg   USBC_UESTA0;        /**< \brief (USBC Offset: 0x130) Endpoint Status Register */
  RoReg   USBC_UESTA1;        /**< \brief (USBC Offset: 0x134) Endpoint Status Register */
  RoReg   USBC_UESTA2;        /**< \brief (USBC Offset: 0x138) Endpoint Status Register */
  RoReg   USBC_UESTA3;        /**< \brief (USBC Offset: 0x13C) Endpoint Status Register */
  RoReg   USBC_UESTA4;        /**< \brief (USBC Offset: 0x140) Endpoint Status Register */
  RoReg   USBC_UESTA5;        /**< \brief (USBC Offset: 0x144) Endpoint Status Register */
  RoReg   USBC_UESTA6;        /**< \brief (USBC Offset: 0x148) Endpoint Status Register */
  RoReg   USBC_UESTA7;        /**< \brief (USBC Offset: 0x14C) Endpoint Status Register */
  RoReg8  Reserved21[0x10];
  WoReg   USBC_UESTA0CLR;     /**< \brief (USBC Offset: 0x160) Endpoint Status Clear Register */
  WoReg   USBC_UESTA1CLR;     /**< \brief (USBC Offset: 0x164) Endpoint Status Clear Register */
  WoReg   USBC_UESTA2CLR;     /**< \brief (USBC Offset: 0x168) Endpoint Status Clear Register */
  WoReg   USBC_UESTA3CLR;     /**< \brief (USBC Offset: 0x16C) Endpoint Status Clear Register */
  WoReg   USBC_UESTA4CLR;     /**< \brief (USBC Offset: 0x170) Endpoint Status Clear Register */
  WoReg   USBC_UESTA5CLR;     /**< \brief (USBC Offset: 0x174) Endpoint Status Clear Register */
  WoReg   USBC_UESTA6CLR;     /**< \brief (USBC Offset: 0x178) Endpoint Status Clear Register */
  WoReg   USBC_UESTA7CLR;     /**< \brief (USBC Offset: 0x17C) Endpoint Status Clear Register */
  RoReg8  Reserved22[0x10];
  WoReg   USBC_UESTA0SET;     /**< \brief (USBC Offset: 0x190) Endpoint Status Set Register */
  WoReg   USBC_UESTA1SET;     /**< \brief (USBC Offset: 0x194) Endpoint Status Set Register */
  WoReg   USBC_UESTA2SET;     /**< \brief (USBC Offset: 0x198) Endpoint Status Set Register */
  WoReg   USBC_UESTA3SET;     /**< \brief (USBC Offset: 0x19C) Endpoint Status Set Register */
  WoReg   USBC_UESTA4SET;     /**< \brief (USBC Offset: 0x1A0) Endpoint Status Set Register */
  WoReg   USBC_UESTA5SET;     /**< \brief (USBC Offset: 0x1A4) Endpoint Status Set Register */
  WoReg   USBC_UESTA6SET;     /**< \brief (USBC Offset: 0x1A8) Endpoint Status Set Register */
  WoReg   USBC_UESTA7SET;     /**< \brief (USBC Offset: 0x1AC) Endpoint Status Set Register */
  RoReg8  Reserved23[0x10];
  RoReg   USBC_UECON0;        /**< \brief (USBC Offset: 0x1C0) Endpoint Control Register */
  RoReg   USBC_UECON1;        /**< \brief (USBC Offset: 0x1C4) Endpoint Control Register */
  RoReg   USBC_UECON2;        /**< \brief (USBC Offset: 0x1C8) Endpoint Control Register */
  RoReg   USBC_UECON3;        /**< \brief (USBC Offset: 0x1CC) Endpoint Control Register */
  RoReg   USBC_UECON4;        /**< \brief (USBC Offset: 0x1D0) Endpoint Control Register */
  RoReg   USBC_UECON5;        /**< \brief (USBC Offset: 0x1D4) Endpoint Control Register */
  RoReg   USBC_UECON6;        /**< \brief (USBC Offset: 0x1D8) Endpoint Control Register */
  RoReg   USBC_UECON7;        /**< \brief (USBC Offset: 0x1DC) Endpoint Control Register */
  RoReg8  Reserved24[0x10];
  WoReg   USBC_UECON0SET;     /**< \brief (USBC Offset: 0x1F0) Endpoint Control Set Register */
  WoReg   USBC_UECON1SET;     /**< \brief (USBC Offset: 0x1F4) Endpoint Control Set Register */
  WoReg   USBC_UECON2SET;     /**< \brief (USBC Offset: 0x1F8) Endpoint Control Set Register */
  WoReg   USBC_UECON3SET;     /**< \brief (USBC Offset: 0x1FC) Endpoint Control Set Register */
  WoReg   USBC_UECON4SET;     /**< \brief (USBC Offset: 0x200) Endpoint Control Set Register */
  WoReg   USBC_UECON5SET;     /**< \brief (USBC Offset: 0x204) Endpoint Control Set Register */
  WoReg   USBC_UECON6SET;     /**< \brief (USBC Offset: 0x208) Endpoint Control Set Register */
  WoReg   USBC_UECON7SET;     /**< \brief (USBC Offset: 0x20C) Endpoint Control Set Register */
  RoReg8  Reserved25[0x10];
  WoReg   USBC_UECON0CLR;     /**< \brief (USBC Offset: 0x220) Endpoint Control Clear Register */
  WoReg   USBC_UECON1CLR;     /**< \brief (USBC Offset: 0x224) TXINE Clear */
  WoReg   USBC_UECON2CLR;     /**< \brief (USBC Offset: 0x228) TXINE Clear */
  WoReg   USBC_UECON3CLR;     /**< \brief (USBC Offset: 0x22C) TXINE Clear */
  WoReg   USBC_UECON4CLR;     /**< \brief (USBC Offset: 0x230) TXINE Clear */
